#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityOverviewGamepad_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AbilityOverviewGamepad_BP.AbilityOverviewGamepad_BP_C
// 0x0060 (0x0600 - 0x05A0)
class UAbilityOverviewGamepad_BP_C final : public UAbilityOverviewWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FlickerCommandThree;                               // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlickerCommandTwo;                                 // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlickerCommandOne;                                 // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlickerCommandFour;                                // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActivationPulse;                                   // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInFadeOutAbilityOverview;                      // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInFadeOutTTD;                                  // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AbilityGamepadPanelImage;                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                AbilityOverviewAnimationContainer;                 // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bTTDNeedsFadeOut;                                  // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAbilityOverviewNeedsFadeOut;                      // 0x05F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AbilityOverviewGamepad_BP(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnAbilityCooldownFinished(EAbilityPosition AbillityPosition);
	void OnPlayerCombatStateChange(bool IsPlayerInCombat, bool bRestoring);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AbilityOverviewGamepad_BP_C">();
	}
	static class UAbilityOverviewGamepad_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityOverviewGamepad_BP_C>();
	}
};
static_assert(alignof(UAbilityOverviewGamepad_BP_C) == 0x000008, "Wrong alignment on UAbilityOverviewGamepad_BP_C");
static_assert(sizeof(UAbilityOverviewGamepad_BP_C) == 0x000600, "Wrong size on UAbilityOverviewGamepad_BP_C");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, UberGraphFrame) == 0x0005A0, "Member 'UAbilityOverviewGamepad_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, FlickerCommandThree) == 0x0005A8, "Member 'UAbilityOverviewGamepad_BP_C::FlickerCommandThree' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, FlickerCommandTwo) == 0x0005B0, "Member 'UAbilityOverviewGamepad_BP_C::FlickerCommandTwo' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, FlickerCommandOne) == 0x0005B8, "Member 'UAbilityOverviewGamepad_BP_C::FlickerCommandOne' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, FlickerCommandFour) == 0x0005C0, "Member 'UAbilityOverviewGamepad_BP_C::FlickerCommandFour' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, ActivationPulse) == 0x0005C8, "Member 'UAbilityOverviewGamepad_BP_C::ActivationPulse' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, FadeInFadeOutAbilityOverview) == 0x0005D0, "Member 'UAbilityOverviewGamepad_BP_C::FadeInFadeOutAbilityOverview' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, FadeInFadeOutTTD) == 0x0005D8, "Member 'UAbilityOverviewGamepad_BP_C::FadeInFadeOutTTD' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, AbilityGamepadPanelImage) == 0x0005E0, "Member 'UAbilityOverviewGamepad_BP_C::AbilityGamepadPanelImage' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, AbilityOverviewAnimationContainer) == 0x0005E8, "Member 'UAbilityOverviewGamepad_BP_C::AbilityOverviewAnimationContainer' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, InvalidationBox_0) == 0x0005F0, "Member 'UAbilityOverviewGamepad_BP_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, bTTDNeedsFadeOut) == 0x0005F8, "Member 'UAbilityOverviewGamepad_BP_C::bTTDNeedsFadeOut' has a wrong offset!");
static_assert(offsetof(UAbilityOverviewGamepad_BP_C, bAbilityOverviewNeedsFadeOut) == 0x0005F9, "Member 'UAbilityOverviewGamepad_BP_C::bAbilityOverviewNeedsFadeOut' has a wrong offset!");

}

