#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityOverDetail_Ability_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AbilityOverDetail_Ability_BP.AbilityOverDetail_Ability_BP_C
// 0x0020 (0x0420 - 0x0400)
class UAbilityOverDetail_Ability_BP_C final : public UAbilityOverviewDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HoldArtGamepad;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldArtPC;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RadialMaterial;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AbilityOverDetail_Ability_BP(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AbilityOverDetail_Ability_BP_C">();
	}
	static class UAbilityOverDetail_Ability_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityOverDetail_Ability_BP_C>();
	}
};
static_assert(alignof(UAbilityOverDetail_Ability_BP_C) == 0x000008, "Wrong alignment on UAbilityOverDetail_Ability_BP_C");
static_assert(sizeof(UAbilityOverDetail_Ability_BP_C) == 0x000420, "Wrong size on UAbilityOverDetail_Ability_BP_C");
static_assert(offsetof(UAbilityOverDetail_Ability_BP_C, UberGraphFrame) == 0x000400, "Member 'UAbilityOverDetail_Ability_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbilityOverDetail_Ability_BP_C, HoldArtGamepad) == 0x000408, "Member 'UAbilityOverDetail_Ability_BP_C::HoldArtGamepad' has a wrong offset!");
static_assert(offsetof(UAbilityOverDetail_Ability_BP_C, HoldArtPC) == 0x000410, "Member 'UAbilityOverDetail_Ability_BP_C::HoldArtPC' has a wrong offset!");
static_assert(offsetof(UAbilityOverDetail_Ability_BP_C, RadialMaterial) == 0x000418, "Member 'UAbilityOverDetail_Ability_BP_C::RadialMaterial' has a wrong offset!");

}

