#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmmoReadout_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AmmoReadout_BP.AmmoReadout_BP_C
// 0x0010 (0x03C0 - 0x03B0)
class UAmmoReadout_BP_C final : public UAmmoReadoutWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          LoadedAmmoPrevIndex;                               // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RemainingAmmoPrevIndex;                            // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AmmoReadout_BP(int32 EntryPoint);
	void EvaluateLowAmmoWarning(int32 MaxClipSize, int32 CurrentClipSize, int32 RemainingAmmo);
	void ColorTextBlock(bool Index_0, class UTextBlockBase* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AmmoReadout_BP_C">();
	}
	static class UAmmoReadout_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmmoReadout_BP_C>();
	}
};
static_assert(alignof(UAmmoReadout_BP_C) == 0x000008, "Wrong alignment on UAmmoReadout_BP_C");
static_assert(sizeof(UAmmoReadout_BP_C) == 0x0003C0, "Wrong size on UAmmoReadout_BP_C");
static_assert(offsetof(UAmmoReadout_BP_C, UberGraphFrame) == 0x0003B0, "Member 'UAmmoReadout_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAmmoReadout_BP_C, LoadedAmmoPrevIndex) == 0x0003B8, "Member 'UAmmoReadout_BP_C::LoadedAmmoPrevIndex' has a wrong offset!");
static_assert(offsetof(UAmmoReadout_BP_C, RemainingAmmoPrevIndex) == 0x0003B9, "Member 'UAmmoReadout_BP_C::RemainingAmmoPrevIndex' has a wrong offset!");

}

