#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioLogWidget_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function AudioLogWidget_BP.AudioLogWidget_BP_C.ExecuteUbergraph_AudioLogWidget_BP
// 0x0028 (0x0028 - 0x0000)
struct AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShow;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CurrentRenderOpacity;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP) == 0x000008, "Wrong alignment on AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP");
static_assert(sizeof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP) == 0x000028, "Wrong size on AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, EntryPoint) == 0x000000, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, Temp_bool_Variable) == 0x000004, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, Temp_bool_Variable_1) == 0x000005, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, K2Node_Event_bShow) == 0x000006, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, K2Node_Event_CurrentRenderOpacity) == 0x000008, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::K2Node_Event_CurrentRenderOpacity' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, K2Node_Select_Default) == 0x000010, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, K2Node_Select_Default_1) == 0x000018, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'AudioLogWidget_BP_C_ExecuteUbergraph_AudioLogWidget_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AudioLogWidget_BP.AudioLogWidget_BP_C.ShowAudioLog
// 0x0008 (0x0008 - 0x0000)
struct AudioLogWidget_BP_C_ShowAudioLog final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentRenderOpacity;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AudioLogWidget_BP_C_ShowAudioLog) == 0x000004, "Wrong alignment on AudioLogWidget_BP_C_ShowAudioLog");
static_assert(sizeof(AudioLogWidget_BP_C_ShowAudioLog) == 0x000008, "Wrong size on AudioLogWidget_BP_C_ShowAudioLog");
static_assert(offsetof(AudioLogWidget_BP_C_ShowAudioLog, bShow) == 0x000000, "Member 'AudioLogWidget_BP_C_ShowAudioLog::bShow' has a wrong offset!");
static_assert(offsetof(AudioLogWidget_BP_C_ShowAudioLog, CurrentRenderOpacity) == 0x000004, "Member 'AudioLogWidget_BP_C_ShowAudioLog::CurrentRenderOpacity' has a wrong offset!");

}

