#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundSplitPanelWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BackgroundSplitPanelWidget.BackgroundSplitPanelWidget_C.ExecuteUbergraph_BackgroundSplitPanelWidget
// 0x02B8 (0x02B8 - 0x0000)
struct BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_Texture_3;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x0088)()
	class UTexture2D*                             K2Node_Event_Texture_2;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00A0(0x0088)()
	class UTexture2D*                             K2Node_Event_Texture_1;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_Texture;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0138(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x01C0(0x0088)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0268(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0290(0x0028)()
};
static_assert(alignof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget) == 0x000008, "Wrong alignment on BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget");
static_assert(sizeof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget) == 0x0002B8, "Wrong size on BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, EntryPoint) == 0x000000, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_Event_Texture_3) == 0x000008, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_Event_Texture_3' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_Event_Texture_2) == 0x000098, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_Event_Texture_2' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_SlateBrush_1) == 0x0000A0, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_Event_Texture_1) == 0x000128, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_Event_Texture_1' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_Event_Texture) == 0x000130, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_SlateBrush_2) == 0x000138, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_SlateBrush_3) == 0x0001C0, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_LinearColor) == 0x000248, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_LinearColor_1) == 0x000258, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_SlateColor) == 0x000268, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget, K2Node_MakeStruct_SlateColor_1) == 0x000290, "Member 'BackgroundSplitPanelWidget_C_ExecuteUbergraph_BackgroundSplitPanelWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function BackgroundSplitPanelWidget.BackgroundSplitPanelWidget_C.OnInnerBottomTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded) == 0x000008, "Wrong alignment on BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded");
static_assert(sizeof(BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded) == 0x000008, "Wrong size on BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded");
static_assert(offsetof(BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded, Texture) == 0x000000, "Member 'BackgroundSplitPanelWidget_C_OnInnerBottomTextureLoaded::Texture' has a wrong offset!");

// Function BackgroundSplitPanelWidget.BackgroundSplitPanelWidget_C.OnInnerTopTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded) == 0x000008, "Wrong alignment on BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded");
static_assert(sizeof(BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded) == 0x000008, "Wrong size on BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded");
static_assert(offsetof(BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded, Texture) == 0x000000, "Member 'BackgroundSplitPanelWidget_C_OnInnerTopTextureLoaded::Texture' has a wrong offset!");

// Function BackgroundSplitPanelWidget.BackgroundSplitPanelWidget_C.OnOuterBottomTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded) == 0x000008, "Wrong alignment on BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded");
static_assert(sizeof(BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded) == 0x000008, "Wrong size on BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded");
static_assert(offsetof(BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded, Texture) == 0x000000, "Member 'BackgroundSplitPanelWidget_C_OnOuterBottomTextureLoaded::Texture' has a wrong offset!");

// Function BackgroundSplitPanelWidget.BackgroundSplitPanelWidget_C.OnOuterTopTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded) == 0x000008, "Wrong alignment on BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded");
static_assert(sizeof(BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded) == 0x000008, "Wrong size on BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded");
static_assert(offsetof(BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded, Texture) == 0x000000, "Member 'BackgroundSplitPanelWidget_C_OnOuterTopTextureLoaded::Texture' has a wrong offset!");

}

