#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundPanelWidget

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BackgroundPanelWidget.BackgroundPanelWidget_C
// 0x0128 (0x0428 - 0x0300)
class UBackgroundPanelWidget_C final : public UBackgroundPanelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOpacity;                                       // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            OuterBrush;                                        // 0x0318(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            InnerBrush;                                        // 0x03A0(0x0088)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BackgroundPanelWidget(int32 EntryPoint);
	void Construct();
	void OnOuterTextureLoaded(class UTexture2D* Texture);
	void OnInnerTextureLoaded(class UTexture2D* Texture);
	void SetBackgroundFocused(bool bFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BackgroundPanelWidget_C">();
	}
	static class UBackgroundPanelWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackgroundPanelWidget_C>();
	}
};
static_assert(alignof(UBackgroundPanelWidget_C) == 0x000008, "Wrong alignment on UBackgroundPanelWidget_C");
static_assert(sizeof(UBackgroundPanelWidget_C) == 0x000428, "Wrong size on UBackgroundPanelWidget_C");
static_assert(offsetof(UBackgroundPanelWidget_C, UberGraphFrame) == 0x000300, "Member 'UBackgroundPanelWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBackgroundPanelWidget_C, FadeOpacity) == 0x000308, "Member 'UBackgroundPanelWidget_C::FadeOpacity' has a wrong offset!");
static_assert(offsetof(UBackgroundPanelWidget_C, NamedSlot) == 0x000310, "Member 'UBackgroundPanelWidget_C::NamedSlot' has a wrong offset!");
static_assert(offsetof(UBackgroundPanelWidget_C, OuterBrush) == 0x000318, "Member 'UBackgroundPanelWidget_C::OuterBrush' has a wrong offset!");
static_assert(offsetof(UBackgroundPanelWidget_C, InnerBrush) == 0x0003A0, "Member 'UBackgroundPanelWidget_C::InnerBrush' has a wrong offset!");

}

