#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BarkVolume_Companion_Generic

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function BarkVolume_Companion_Generic.BarkVolume_Companion_Generic_C.ExecuteUbergraph_BarkVolume_Companion_Generic
// 0x0038 (0x0038 - 0x0000)
struct BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBranches                                CallFunc_StartConversationByDescription_Branches;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversationByDescription_InstanceID; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversationByDescription_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic) == 0x000008, "Wrong alignment on BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic");
static_assert(sizeof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic) == 0x000038, "Wrong size on BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, EntryPoint) == 0x000000, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, CallFunc_StartConversationByDescription_Branches) == 0x000004, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::CallFunc_StartConversationByDescription_Branches' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, CallFunc_StartConversationByDescription_InstanceID) == 0x000008, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::CallFunc_StartConversationByDescription_InstanceID' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, CallFunc_StartConversationByDescription_ReturnValue) == 0x00000C, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::CallFunc_StartConversationByDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, K2Node_CustomEvent_OverlappedActor) == 0x000028, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic, K2Node_CustomEvent_OtherActor) == 0x000030, "Member 'BarkVolume_Companion_Generic_C_ExecuteUbergraph_BarkVolume_Companion_Generic::K2Node_CustomEvent_OtherActor' has a wrong offset!");

// Function BarkVolume_Companion_Generic.BarkVolume_Companion_Generic_C.OnActorBeginOverlap_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0 final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0) == 0x000008, "Wrong alignment on BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0");
static_assert(sizeof(BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0) == 0x000010, "Wrong size on BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0");
static_assert(offsetof(BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0, OverlappedActor) == 0x000000, "Member 'BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0, OtherActor) == 0x000008, "Member 'BarkVolume_Companion_Generic_C_OnActorBeginOverlap_Event_0::OtherActor' has a wrong offset!");

}

