#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_Human

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Base_Ai_Character_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Base_Human.Base_Human_C
// 0x0020 (0x0ED0 - 0x0EB0)
class ABase_Human_C : public ABase_Ai_Character_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Base_Human_C;                       // 0x0EB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFaceFXComponent*                       FaceFX;                                            // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULocomotionLogicComponent*              LocomotionLogic;                                   // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConversationRegisterComponent*         ConversationRegister;                              // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Base_Human(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_Human_C">();
	}
	static class ABase_Human_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABase_Human_C>();
	}
};
static_assert(alignof(ABase_Human_C) == 0x000010, "Wrong alignment on ABase_Human_C");
static_assert(sizeof(ABase_Human_C) == 0x000ED0, "Wrong size on ABase_Human_C");
static_assert(offsetof(ABase_Human_C, UberGraphFrame_Base_Human_C) == 0x000EB0, "Member 'ABase_Human_C::UberGraphFrame_Base_Human_C' has a wrong offset!");
static_assert(offsetof(ABase_Human_C, FaceFX) == 0x000EB8, "Member 'ABase_Human_C::FaceFX' has a wrong offset!");
static_assert(offsetof(ABase_Human_C, LocomotionLogic) == 0x000EC0, "Member 'ABase_Human_C::LocomotionLogic' has a wrong offset!");
static_assert(offsetof(ABase_Human_C, ConversationRegister) == 0x000EC8, "Member 'ABase_Human_C::ConversationRegister' has a wrong offset!");

}

