#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_DamageType

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function Base_DamageType.Base_DamageType_C.SetupImpactFx
// 0x0248 (0x0248 - 0x0000)
struct Base_DamageType_C_SetupImpactFx final
{
public:
	class UParticleSystemComponent*               ParentEffect;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGraze;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCritical;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeakSpot;                                         // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRadial;                                           // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_4;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_5;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_6;                   // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_7;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_8;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_9;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_10;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_2;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_11;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_3;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_12;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x00B2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable_1;                              // 0x00C5(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Temp_byte_Variable_2;                              // 0x00C6(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Temp_byte_Variable_3;                              // 0x00C7(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_Map_Find_Value;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_Map_Find_Value_1;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable_4;                              // 0x00E5(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_Map_Find_Value_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_Map_Find_Value_3;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_1;  // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_Map_Find_Value_4;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_3;                           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_4;                           // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_5;                           // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_6;                           // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_7;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_8;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_9;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_3;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_4;        // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_10;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue;   // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_5;        // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_DamageType_C_SetupImpactFx) == 0x000008, "Wrong alignment on Base_DamageType_C_SetupImpactFx");
static_assert(sizeof(Base_DamageType_C_SetupImpactFx) == 0x000248, "Wrong size on Base_DamageType_C_SetupImpactFx");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, ParentEffect) == 0x000000, "Member 'Base_DamageType_C_SetupImpactFx::ParentEffect' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, bGraze) == 0x000008, "Member 'Base_DamageType_C_SetupImpactFx::bGraze' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, bCritical) == 0x000009, "Member 'Base_DamageType_C_SetupImpactFx::bCritical' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, bWeakSpot) == 0x00000A, "Member 'Base_DamageType_C_SetupImpactFx::bWeakSpot' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, bRadial) == 0x00000B, "Member 'Base_DamageType_C_SetupImpactFx::bRadial' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Radius) == 0x00000C, "Member 'Base_DamageType_C_SetupImpactFx::Radius' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000010, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue) == 0x000030, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_1) == 0x000031, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_2) == 0x000032, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_3) == 0x000033, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_4) == 0x000034, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_5) == 0x000036, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_6) == 0x000037, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_GetDisplayName_ReturnValue_1) == 0x000038, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_GetDisplayName_ReturnValue_2) == 0x000048, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_7) == 0x000058, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_8) == 0x000059, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_MakeLiteralString_ReturnValue) == 0x000060, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000070, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_9) == 0x000080, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_10) == 0x000081, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_MakeLiteralString_ReturnValue_2) == 0x000088, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_MakeLiteralString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_11) == 0x000098, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_MakeLiteralString_ReturnValue_3) == 0x0000A0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_MakeLiteralString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Contains_ReturnValue_12) == 0x0000B0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Contains_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable) == 0x0000B1, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_byte_Variable) == 0x0000B2, "Member 'Base_DamageType_C_SetupImpactFx::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_1) == 0x0000B3, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_struct_Variable) == 0x0000B4, "Member 'Base_DamageType_C_SetupImpactFx::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_2) == 0x0000C4, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_byte_Variable_1) == 0x0000C5, "Member 'Base_DamageType_C_SetupImpactFx::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_byte_Variable_2) == 0x0000C6, "Member 'Base_DamageType_C_SetupImpactFx::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_byte_Variable_3) == 0x0000C7, "Member 'Base_DamageType_C_SetupImpactFx::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_Value) == 0x0000C8, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_Value_1) == 0x0000D8, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_ReturnValue_1) == 0x0000E0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_IsValid_ReturnValue_1) == 0x0000E2, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_BooleanAND_ReturnValue) == 0x0000E3, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E4, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_byte_Variable_4) == 0x0000E5, "Member 'Base_DamageType_C_SetupImpactFx::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_Value_2) == 0x0000E8, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_ReturnValue_2) == 0x0000F0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_Value_3) == 0x0000F8, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_ReturnValue_3) == 0x000100, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_IsValid_ReturnValue_2) == 0x000101, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_IsValid_ReturnValue_3) == 0x000102, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_BooleanAND_ReturnValue_2) == 0x000103, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_BooleanAND_ReturnValue_3) == 0x000104, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_3) == 0x000105, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000108, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default) == 0x000118, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_1) == 0x000128, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Multiply_LinearColorFloat_ReturnValue_1) == 0x000130, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Multiply_LinearColorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000140, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_2) == 0x000148, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_Value_4) == 0x000158, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Map_Find_ReturnValue_4) == 0x000160, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_string_Variable) == 0x000168, "Member 'Base_DamageType_C_SetupImpactFx::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_IsValid_ReturnValue_4) == 0x000178, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_BooleanAND_ReturnValue_4) == 0x000179, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_4) == 0x00017A, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_3) == 0x000180, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_IsValid_ReturnValue_5) == 0x000190, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_5) == 0x000191, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_4) == 0x000198, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0001A8, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_6) == 0x0001B1, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_7) == 0x0001B2, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_5) == 0x0001B8, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_6) == 0x0001C8, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_7) == 0x0001D8, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x0001F0, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_Conv_StringToName_ReturnValue) == 0x0001F8, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_8) == 0x000200, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_9) == 0x000201, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_8) == 0x000208, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_9) == 0x000210, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnSystemAttached_ReturnValue_3) == 0x000218, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnSystemAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnSystemAttached_ReturnValue_4) == 0x000220, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnSystemAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, Temp_bool_Variable_10) == 0x000228, "Member 'Base_DamageType_C_SetupImpactFx::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, K2Node_Select_Default_10) == 0x000230, "Member 'Base_DamageType_C_SetupImpactFx::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnPooledEmitterAttached_ReturnValue) == 0x000238, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnPooledEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupImpactFx, CallFunc_SpawnSystemAttached_ReturnValue_5) == 0x000240, "Member 'Base_DamageType_C_SetupImpactFx::CallFunc_SpawnSystemAttached_ReturnValue_5' has a wrong offset!");

// Function Base_DamageType.Base_DamageType_C.SetupSecondaryImpactFx
// 0x0038 (0x0038 - 0x0000)
struct Base_DamageType_C_SetupSecondaryImpactFx final
{
public:
	class UParticleSystemComponent*               ParentEffect;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGraze;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCritical;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWeakSpot;                                         // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRadial;                                           // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_DamageType_C_SetupSecondaryImpactFx) == 0x000008, "Wrong alignment on Base_DamageType_C_SetupSecondaryImpactFx");
static_assert(sizeof(Base_DamageType_C_SetupSecondaryImpactFx) == 0x000038, "Wrong size on Base_DamageType_C_SetupSecondaryImpactFx");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, ParentEffect) == 0x000000, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::ParentEffect' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, bGraze) == 0x000008, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::bGraze' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, bCritical) == 0x000009, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::bCritical' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, bWeakSpot) == 0x00000A, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::bWeakSpot' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, bRadial) == 0x00000B, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::bRadial' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, Radius) == 0x00000C, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::Radius' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000010, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, CallFunc_SpawnPooledEmitterAttached_ReturnValue) == 0x000020, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::CallFunc_SpawnPooledEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000028, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_SetupSecondaryImpactFx, CallFunc_SpawnPooledEmitterAttached_ReturnValue_1) == 0x000030, "Member 'Base_DamageType_C_SetupSecondaryImpactFx::CallFunc_SpawnPooledEmitterAttached_ReturnValue_1' has a wrong offset!");

// Function Base_DamageType.Base_DamageType_C.TriggerMuzzleFx
// 0x0150 (0x0150 - 0x0000)
struct Base_DamageType_C_TriggerMuzzleFx final
{
public:
	class USceneComponent*                        AttachComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPerson;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFirstPersonView;                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerCharacter*                K2Node_DynamicCast_AsIndiana_Player_Character;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaCharacter*                      K2Node_DynamicCast_AsIndiana_Character;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeapon*                                CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeapon*                                CallFunc_GetCurrentWeapon_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_4;                   // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponMode*                            CallFunc_GetPrimaryMode_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URangedMode*                            K2Node_DynamicCast_AsRanged_Mode;                  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasScope_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                K2Node_DynamicCast_AsIndiana_Player_Character_1;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFullyAimed_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeapon*                                CallFunc_GetCurrentWeapon_ReturnValue_2;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponMode*                            CallFunc_GetPrimaryMode_ReturnValue_1;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URangedMode*                            K2Node_DynamicCast_AsRanged_Mode_1;                // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasScope_ReturnValue_1;                   // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFullyAimed_ReturnValue_1;               // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_Map_Find_Value;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue;   // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_DamageType_C_TriggerMuzzleFx) == 0x000008, "Wrong alignment on Base_DamageType_C_TriggerMuzzleFx");
static_assert(sizeof(Base_DamageType_C_TriggerMuzzleFx) == 0x000150, "Wrong size on Base_DamageType_C_TriggerMuzzleFx");
static_assert(offsetof(Base_DamageType_C_TriggerMuzzleFx, AttachComponent) == 0x000000, "Member 'Base_DamageType_C_TriggerMuzzleFx::AttachComponent' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_TriggerMuzzleFx, IsFirstPerson) == 0x000008, "Member 'Base_DamageType_C_TriggerMuzzleFx::IsFirstPerson' has a wrong offset!");
static_assert(offsetof(Base_DamageType_C_TriggerMuzzleFx, IsFirstPersonView) == 0x000009, "Member 'Base_DamageType_C_TriggerMuzzleFx::IsFirstPersonView' has a wrong offset!");
