#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Attached_To_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Attached_To_Player.BP_Attached_To_Player_C.ExecuteUbergraph_BP_Attached_To_Player
// 0x04C0 (0x04C0 - 0x0000)
struct BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_4;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_5;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_3;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_3;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerVolume*                         CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_2;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_2;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_1;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0120(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x02AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0334(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerVolume*                         CallFunc_Array_Get_Item_1;                         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerVolume*                         CallFunc_Array_Get_Item_2;                         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_3;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerVolume*                         CallFunc_Array_Get_Item_3;                         // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_4;         // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Trigger_Volume_Bound_C*             CallFunc_Array_Get_Item_4;                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45A[0x2];                                      // 0x045A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Trigger_Volume_Bound_C*             CallFunc_Array_Get_Item_5;                         // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0475(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_476[0x2];                                      // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x047C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Trigger_Volume_Bound_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0490(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APatrolNode*                            CallFunc_Array_Get_Item_6;                         // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x04BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player) == 0x000010, "Wrong alignment on BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player");
static_assert(sizeof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player) == 0x0004C0, "Wrong size on BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, EntryPoint) == 0x000000, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Variable) == 0x000004, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Variable_1) == 0x000008, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Variable_2) == 0x000014, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Variable_3) == 0x00002C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue_3) == 0x000040, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_object_Variable) == 0x000048, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Variable_4) == 0x000068, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue_4) == 0x00006C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Variable_5) == 0x000080, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue_5) == 0x000084, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000098, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A1, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OverlappedActor_3) == 0x0000A8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OverlappedActor_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OtherActor_3) == 0x0000B0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OverlappedActor_2) == 0x0000D0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OverlappedActor_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OtherActor_2) == 0x0000D8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000E0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OverlappedActor_1) == 0x0000E8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OverlappedActor_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OtherActor_1) == 0x0000F0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OverlappedActor) == 0x0000F8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CustomEvent_OtherActor) == 0x000100, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_Event_EndPlayReason) == 0x000108, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetPlayerPawn_ReturnValue) == 0x000110, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetTransform_ReturnValue) == 0x000120, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakVector_X) == 0x000150, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakVector_Y) == 0x000154, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakVector_Z) == 0x000158, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakVector_X_1) == 0x00015C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakVector_Y_1) == 0x000160, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakVector_Z_1) == 0x000164, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_RandomFloatInRange_ReturnValue) == 0x000168, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00016C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_MakeVector_ReturnValue) == 0x000170, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_MakeVector_ReturnValue_1) == 0x00017C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_TransformLocation_ReturnValue) == 0x000188, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_TransformLocation_ReturnValue_1) == 0x000194, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_LineTraceSingle_OutHit) == 0x0001A0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_LineTraceSingle_ReturnValue) == 0x000228, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_bBlockingHit) == 0x000229, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_bInitialOverlap) == 0x00022A, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_Time) == 0x00022C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_Distance) == 0x000230, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_Location) == 0x000234, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_ImpactPoint) == 0x000240, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_Normal) == 0x00024C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_ImpactNormal) == 0x000258, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_PhysMat) == 0x000268, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_HitActor) == 0x000270, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_HitComponent) == 0x000278, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_HitBoneName) == 0x000280, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_HitItem) == 0x000288, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_ElementIndex) == 0x00028C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_FaceIndex) == 0x000290, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_TraceStart) == 0x000294, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_BreakHitResult_TraceEnd) == 0x0002A0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0002AC, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000334, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_IsValid_ReturnValue_1) == 0x0003BC, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_bool_Has_Been_Initd_Variable) == 0x0003BD, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0003C0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x0003C8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item_1) == 0x0003D0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue_2) == 0x0003D8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item_2) == 0x0003E0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003E8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue_3) == 0x0003EC, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x0003F0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003F8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetComponentByClass_ReturnValue) == 0x000400, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000408, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetPlayerCharacter_ReturnValue_3) == 0x000410, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetPlayerCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000418, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item_3) == 0x000420, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000428, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue_4) == 0x00042C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue_3) == 0x000430, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_bool_IsClosed_Variable) == 0x000431, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetPlayerCharacter_ReturnValue_4) == 0x000438, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetPlayerCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000440, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000448, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item_4) == 0x000450, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_IsValid_ReturnValue_2) == 0x000458, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_IsValid_ReturnValue_3) == 0x000459, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue_5) == 0x00045C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item_5) == 0x000460, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue_4) == 0x000468, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Length_ReturnValue_6) == 0x00046C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Loop_Counter_Variable) == 0x000470, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue_5) == 0x000474, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Less_IntInt_ReturnValue_6) == 0x000475, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Add_IntInt_ReturnValue_6) == 0x000478, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, K2Node_CreateDelegate_OutputDelegate_5) == 0x00047C, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetAllActorsOfClass_OutActors) == 0x000490, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, Temp_int_Array_Index_Variable) == 0x0004A0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_Array_Get_Item_6) == 0x0004A8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0004B0, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_GetDistanceTo_ReturnValue) == 0x0004B8, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x0004BC, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0004BD, "Member 'BP_Attached_To_Player_C_ExecuteUbergraph_BP_Attached_To_Player::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Attached_To_Player.BP_Attached_To_Player_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Attached_To_Player_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attached_To_Player_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Attached_To_Player_C_ReceiveEndPlay");
static_assert(sizeof(BP_Attached_To_Player_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Attached_To_Player_C_ReceiveEndPlay");
static_assert(offsetof(BP_Attached_To_Player_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Attached_To_Player_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Attached_To_Player.BP_Attached_To_Player_C.End_Overlap_Container
// 0x0010 (0x0010 - 0x0000)
struct BP_Attached_To_Player_C_End_Overlap_Container final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attached_To_Player_C_End_Overlap_Container) == 0x000008, "Wrong alignment on BP_Attached_To_Player_C_End_Overlap_Container");
static_assert(sizeof(BP_Attached_To_Player_C_End_Overlap_Container) == 0x000010, "Wrong size on BP_Attached_To_Player_C_End_Overlap_Container");
static_assert(offsetof(BP_Attached_To_Player_C_End_Overlap_Container, OverlappedActor) == 0x000000, "Member 'BP_Attached_To_Player_C_End_Overlap_Container::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_End_Overlap_Container, OtherActor) == 0x000008, "Member 'BP_Attached_To_Player_C_End_Overlap_Container::OtherActor' has a wrong offset!");

// Function BP_Attached_To_Player.BP_Attached_To_Player_C.Begin_Overlap_Container
// 0x0010 (0x0010 - 0x0000)
struct BP_Attached_To_Player_C_Begin_Overlap_Container final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attached_To_Player_C_Begin_Overlap_Container) == 0x000008, "Wrong alignment on BP_Attached_To_Player_C_Begin_Overlap_Container");
static_assert(sizeof(BP_Attached_To_Player_C_Begin_Overlap_Container) == 0x000010, "Wrong size on BP_Attached_To_Player_C_Begin_Overlap_Container");
static_assert(offsetof(BP_Attached_To_Player_C_Begin_Overlap_Container, OverlappedActor) == 0x000000, "Member 'BP_Attached_To_Player_C_Begin_Overlap_Container::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_Begin_Overlap_Container, OtherActor) == 0x000008, "Member 'BP_Attached_To_Player_C_Begin_Overlap_Container::OtherActor' has a wrong offset!");

// Function BP_Attached_To_Player.BP_Attached_To_Player_C.Begin_Overlap_Exit
// 0x0010 (0x0010 - 0x0000)
struct BP_Attached_To_Player_C_Begin_Overlap_Exit final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Attached_To_Player_C_Begin_Overlap_Exit) == 0x000008, "Wrong alignment on BP_Attached_To_Player_C_Begin_Overlap_Exit");
static_assert(sizeof(BP_Attached_To_Player_C_Begin_Overlap_Exit) == 0x000010, "Wrong size on BP_Attached_To_Player_C_Begin_Overlap_Exit");
static_assert(offsetof(BP_Attached_To_Player_C_Begin_Overlap_Exit, OverlappedActor) == 0x000000, "Member 'BP_Attached_To_Player_C_Begin_Overlap_Exit::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_Attached_To_Player_C_Begin_Overlap_Exit, OtherActor) == 0x000008, "Member 'BP_Attached_To_Player_C_Begin_Overlap_Exit::OtherActor' has a wrong offset!");

// Function BP_Attached_To_Player.BP_Attached_To_Player_C.Begin_Overlap_Entrance
// 0x0010 (0x0010 - 0x0000)
struct BP_Attached_To_Player_C_Begin_Overlap_Entrance final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
