#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bugs_Light

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Bugs_Light.BP_Bugs_Light_C.ExecuteUbergraph_BP_Bugs_Light
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBasicParticleData                     CallFunc_Array_Get_Item;                           // 0x0038(0x001C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBasicParticleData                     CallFunc_Array_Get_Item_1;                         // 0x0070(0x001C)(NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light) == 0x000008, "Wrong alignment on BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light");
static_assert(sizeof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light) == 0x0000B0, "Wrong size on BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, EntryPoint) == 0x000000, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000018, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, K2Node_Event_Data) == 0x000020, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, K2Node_Event_NiagaraSystem) == 0x000030, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::K2Node_Event_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_FTrunc_ReturnValue) == 0x00005C, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, Temp_int_Array_Index_Variable_1) == 0x00006C, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00008C, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Add_VectorVector_ReturnValue) == 0x000098, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BP_Bugs_Light_C_ExecuteUbergraph_BP_Bugs_Light::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Bugs_Light.BP_Bugs_Light_C.ReceiveParticleData
// 0x0018 (0x0018 - 0x0000)
struct BP_Bugs_Light_C_ReceiveParticleData final
{
public:
	TArray<struct FBasicParticleData>             Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bugs_Light_C_ReceiveParticleData) == 0x000008, "Wrong alignment on BP_Bugs_Light_C_ReceiveParticleData");
static_assert(sizeof(BP_Bugs_Light_C_ReceiveParticleData) == 0x000018, "Wrong size on BP_Bugs_Light_C_ReceiveParticleData");
static_assert(offsetof(BP_Bugs_Light_C_ReceiveParticleData, Data) == 0x000000, "Member 'BP_Bugs_Light_C_ReceiveParticleData::Data' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_ReceiveParticleData, NiagaraSystem) == 0x000010, "Member 'BP_Bugs_Light_C_ReceiveParticleData::NiagaraSystem' has a wrong offset!");

// Function BP_Bugs_Light.BP_Bugs_Light_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Bugs_Light_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bugs_Light_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Bugs_Light_C_ReceiveTick");
static_assert(sizeof(BP_Bugs_Light_C_ReceiveTick) == 0x000004, "Wrong size on BP_Bugs_Light_C_ReceiveTick");
static_assert(offsetof(BP_Bugs_Light_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Bugs_Light_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Bugs_Light.BP_Bugs_Light_C.UserConstructionScript
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Bugs_Light_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraParameterCollectionInstance*> K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class UNiagaraParameterCollectionInstance*    CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorParameter_ReturnValue;           // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolParameter_ReturnValue;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatParameter_ReturnValue;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bugs_Light_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Bugs_Light_C_UserConstructionScript");
static_assert(sizeof(BP_Bugs_Light_C_UserConstructionScript) == 0x0000D8, "Wrong size on BP_Bugs_Light_C_UserConstructionScript");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_Bugs_Light_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_StartsWith_ReturnValue) == 0x000018, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_StartsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00001C, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, Temp_int_Variable_1) == 0x000020, "Member 'BP_Bugs_Light_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue) == 0x000024, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, Temp_int_Variable_2) == 0x00002C, "Member 'BP_Bugs_Light_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000088, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000090, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000098, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue_2) == 0x00009C, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000A1, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A4, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0000A8, "Member 'BP_Bugs_Light_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_Array_Get_Item_3) == 0x0000B8, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_GetVectorParameter_ReturnValue) == 0x0000C0, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_GetVectorParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_GetBoolParameter_ReturnValue) == 0x0000CC, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_GetBoolParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bugs_Light_C_UserConstructionScript, CallFunc_GetFloatParameter_ReturnValue) == 0x0000D0, "Member 'BP_Bugs_Light_C_UserConstructionScript::CallFunc_GetFloatParameter_ReturnValue' has a wrong offset!");

}

