#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloudMaskGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CloudMaskGenerator.BP_CloudMaskGenerator_C
// 0x00A0 (0x0358 - 0x02B8)
class ABP_CloudMaskGenerator_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              Resolution;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Scene_Capture_RT;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CopyCloudMID;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BlendCloudMID;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Finalize_Blur_Cloud_MID;                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Cloud_Scratch_RT;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Cloud_Single_Render_RT;                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Blended_Cloud_RT;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Finalized_Cloud_RT;                                // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Blur_Radius;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Detail_Channels;                                   // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVolumetricCloud*                       CloudComp;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Texture_Path;                                      // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Texture_Name;                                      // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         Scale_Km;                                          // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RenderedThisFrame;                                 // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CloudMaskGenerator(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Save_Texture();
	void Allocate_RTs();
	void UserConstructionScript();
	void Render_Clouds(bool DeferRender);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CloudMaskGenerator_C">();
	}
	static class ABP_CloudMaskGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CloudMaskGenerator_C>();
	}
};
static_assert(alignof(ABP_CloudMaskGenerator_C) == 0x000008, "Wrong alignment on ABP_CloudMaskGenerator_C");
static_assert(sizeof(ABP_CloudMaskGenerator_C) == 0x000358, "Wrong size on ABP_CloudMaskGenerator_C");
static_assert(offsetof(ABP_CloudMaskGenerator_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_CloudMaskGenerator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, StaticMesh) == 0x0002C0, "Member 'ABP_CloudMaskGenerator_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_CloudMaskGenerator_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Resolution) == 0x0002D0, "Member 'ABP_CloudMaskGenerator_C::Resolution' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Scene_Capture_RT) == 0x0002D8, "Member 'ABP_CloudMaskGenerator_C::Scene_Capture_RT' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, CopyCloudMID) == 0x0002E0, "Member 'ABP_CloudMaskGenerator_C::CopyCloudMID' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, BlendCloudMID) == 0x0002E8, "Member 'ABP_CloudMaskGenerator_C::BlendCloudMID' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Finalize_Blur_Cloud_MID) == 0x0002F0, "Member 'ABP_CloudMaskGenerator_C::Finalize_Blur_Cloud_MID' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Cloud_Scratch_RT) == 0x0002F8, "Member 'ABP_CloudMaskGenerator_C::Cloud_Scratch_RT' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Cloud_Single_Render_RT) == 0x000300, "Member 'ABP_CloudMaskGenerator_C::Cloud_Single_Render_RT' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Blended_Cloud_RT) == 0x000308, "Member 'ABP_CloudMaskGenerator_C::Blended_Cloud_RT' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Finalized_Cloud_RT) == 0x000310, "Member 'ABP_CloudMaskGenerator_C::Finalized_Cloud_RT' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Blur_Radius) == 0x000318, "Member 'ABP_CloudMaskGenerator_C::Blur_Radius' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Detail_Channels) == 0x00031C, "Member 'ABP_CloudMaskGenerator_C::Detail_Channels' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, CloudComp) == 0x000328, "Member 'ABP_CloudMaskGenerator_C::CloudComp' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Texture_Path) == 0x000330, "Member 'ABP_CloudMaskGenerator_C::Texture_Path' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Texture_Name) == 0x000340, "Member 'ABP_CloudMaskGenerator_C::Texture_Name' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, Scale_Km) == 0x000350, "Member 'ABP_CloudMaskGenerator_C::Scale_Km' has a wrong offset!");
static_assert(offsetof(ABP_CloudMaskGenerator_C, RenderedThisFrame) == 0x000354, "Member 'ABP_CloudMaskGenerator_C::RenderedThisFrame' has a wrong offset!");

}

