#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloudMask_Object

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CloudMask_Object.BP_CloudMask_Object_C.ExecuteUbergraph_BP_CloudMask_Object
// 0x0040 (0x0040 - 0x0000)
struct BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CloudMask_Object_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class ABP_CloudMask_Object_C*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object) == 0x000008, "Wrong alignment on BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object");
static_assert(sizeof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object) == 0x000040, "Wrong size on BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, EntryPoint) == 0x000000, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000004, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_CloudMask_Object_C_ExecuteUbergraph_BP_CloudMask_Object::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CloudMask_Object.BP_CloudMask_Object_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CloudMask_Object_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMask_Object_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CloudMask_Object_C_ReceiveTick");
static_assert(sizeof(BP_CloudMask_Object_C_ReceiveTick) == 0x000004, "Wrong size on BP_CloudMask_Object_C_ReceiveTick");
static_assert(offsetof(BP_CloudMask_Object_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CloudMask_Object_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CloudMask_Object.BP_CloudMask_Object_C.UserConstructionScript
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CloudMask_Object_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CloudMask_Object_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_CloudMask_Object_C_UserConstructionScript");
static_assert(sizeof(BP_CloudMask_Object_C_UserConstructionScript) == 0x0000A8, "Wrong size on BP_CloudMask_Object_C_UserConstructionScript");
static_assert(offsetof(BP_CloudMask_Object_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'BP_CloudMask_Object_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_UserConstructionScript, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000088, "Member 'BP_CloudMask_Object_C_UserConstructionScript::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000098, "Member 'BP_CloudMask_Object_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A4, "Member 'BP_CloudMask_Object_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0000A5, "Member 'BP_CloudMask_Object_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x0000A6, "Member 'BP_CloudMask_Object_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CloudMask_Object.BP_CloudMask_Object_C.Update Mask Generator
// 0x0028 (0x0028 - 0x0000)
struct BP_CloudMask_Object_C_Update_Mask_Generator final
{
public:
	TArray<class ABP_CloudMaskGenerator_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CloudMaskGenerator_C*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CloudMask_Object_C_Update_Mask_Generator) == 0x000008, "Wrong alignment on BP_CloudMask_Object_C_Update_Mask_Generator");
static_assert(sizeof(BP_CloudMask_Object_C_Update_Mask_Generator) == 0x000028, "Wrong size on BP_CloudMask_Object_C_Update_Mask_Generator");
static_assert(offsetof(BP_CloudMask_Object_C_Update_Mask_Generator, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'BP_CloudMask_Object_C_Update_Mask_Generator::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_Update_Mask_Generator, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_CloudMask_Object_C_Update_Mask_Generator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_Update_Mask_Generator, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_CloudMask_Object_C_Update_Mask_Generator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_Update_Mask_Generator, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'BP_CloudMask_Object_C_Update_Mask_Generator::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_Update_Mask_Generator, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_CloudMask_Object_C_Update_Mask_Generator::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CloudMask_Object.BP_CloudMask_Object_C.CloudUpdate
// 0x00AC (0x00AC - 0x0000)
struct BP_CloudMask_Object_C_CloudUpdate final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CloudMask_Object_C_CloudUpdate) == 0x000004, "Wrong alignment on BP_CloudMask_Object_C_CloudUpdate");
static_assert(sizeof(BP_CloudMask_Object_C_CloudUpdate) == 0x0000AC, "Wrong size on BP_CloudMask_Object_C_CloudUpdate");
static_assert(offsetof(BP_CloudMask_Object_C_CloudUpdate, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_CloudMask_Object_C_CloudUpdate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_CloudUpdate, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000004, "Member 'BP_CloudMask_Object_C_CloudUpdate::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_CloudUpdate, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00008C, "Member 'BP_CloudMask_Object_C_CloudUpdate::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_CloudUpdate, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00009C, "Member 'BP_CloudMask_Object_C_CloudUpdate::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_CloudUpdate, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A8, "Member 'BP_CloudMask_Object_C_CloudUpdate::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMask_Object_C_CloudUpdate, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0000A9, "Member 'BP_CloudMask_Object_C_CloudUpdate::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

}

