#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Common_CeilingLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Common_CeilingLight.BP_Common_CeilingLight_C
// 0x0040 (0x02F8 - 0x02B8)
class ABP_Common_CeilingLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_Bugs_Light;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Bugs;                                              // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              PS_Params;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible)
	bool                                          UseLight;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Common_CeilingLight(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Common_CeilingLight_C">();
	}
	static class ABP_Common_CeilingLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Common_CeilingLight_C>();
	}
};
static_assert(alignof(ABP_Common_CeilingLight_C) == 0x000008, "Wrong alignment on ABP_Common_CeilingLight_C");
static_assert(sizeof(ABP_Common_CeilingLight_C) == 0x0002F8, "Wrong size on ABP_Common_CeilingLight_C");
static_assert(offsetof(ABP_Common_CeilingLight_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_Common_CeilingLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Common_CeilingLight_C, PS_Bugs_Light) == 0x0002C0, "Member 'ABP_Common_CeilingLight_C::PS_Bugs_Light' has a wrong offset!");
static_assert(offsetof(ABP_Common_CeilingLight_C, PointLight) == 0x0002C8, "Member 'ABP_Common_CeilingLight_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Common_CeilingLight_C, StaticMesh) == 0x0002D0, "Member 'ABP_Common_CeilingLight_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Common_CeilingLight_C, Bugs) == 0x0002D8, "Member 'ABP_Common_CeilingLight_C::Bugs' has a wrong offset!");
static_assert(offsetof(ABP_Common_CeilingLight_C, PS_Params) == 0x0002E0, "Member 'ABP_Common_CeilingLight_C::PS_Params' has a wrong offset!");
static_assert(offsetof(ABP_Common_CeilingLight_C, UseLight) == 0x0002F0, "Member 'ABP_Common_CeilingLight_C::UseLight' has a wrong offset!");

}

