#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cleo_PillarA4m

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Cleo_PillarA4m.BP_Cleo_PillarA4m_C
// 0x0058 (0x0310 - 0x02B8)
class ABP_Cleo_PillarA4m_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AkEmitterSound;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLightDown;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Sound;                                             // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Audio_Event;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightOn;                                           // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LightColor;                                        // 0x02F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightTemperature;                                  // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Cleo_PillarA4m(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cleo_PillarA4m_C">();
	}
	static class ABP_Cleo_PillarA4m_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cleo_PillarA4m_C>();
	}
};
static_assert(alignof(ABP_Cleo_PillarA4m_C) == 0x000008, "Wrong alignment on ABP_Cleo_PillarA4m_C");
static_assert(sizeof(ABP_Cleo_PillarA4m_C) == 0x000310, "Wrong size on ABP_Cleo_PillarA4m_C");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_Cleo_PillarA4m_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, AkEmitterSound) == 0x0002C0, "Member 'ABP_Cleo_PillarA4m_C::AkEmitterSound' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, SpotLightDown) == 0x0002C8, "Member 'ABP_Cleo_PillarA4m_C::SpotLightDown' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, StaticMesh) == 0x0002D0, "Member 'ABP_Cleo_PillarA4m_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, Sound) == 0x0002D8, "Member 'ABP_Cleo_PillarA4m_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, Audio_Event) == 0x0002E0, "Member 'ABP_Cleo_PillarA4m_C::Audio_Event' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, Intensity) == 0x0002E8, "Member 'ABP_Cleo_PillarA4m_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, Radius) == 0x0002EC, "Member 'ABP_Cleo_PillarA4m_C::Radius' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, LightOn) == 0x0002F0, "Member 'ABP_Cleo_PillarA4m_C::LightOn' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, LightColor) == 0x0002F4, "Member 'ABP_Cleo_PillarA4m_C::LightColor' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, LightTemperature) == 0x000304, "Member 'ABP_Cleo_PillarA4m_C::LightTemperature' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_PillarA4m_C, UseLight) == 0x000308, "Member 'ABP_Cleo_PillarA4m_C::UseLight' has a wrong offset!");

}

