#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cleo_CeilingLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Cleo_CeilingLight.BP_Cleo_CeilingLight_C
// 0x0060 (0x0318 - 0x02B8)
class ABP_Cleo_CeilingLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_Hanging_Dust_Triangle;                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Fog;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    PlayerLight;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Interior;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Player_Light_Position;                             // 0x02F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dust_Specks;                                       // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              Parameters;                                        // 0x0300(0x0010)(Edit, BlueprintVisible)
	bool                                          UseLight;                                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Cleo_CeilingLight(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cleo_CeilingLight_C">();
	}
	static class ABP_Cleo_CeilingLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cleo_CeilingLight_C>();
	}
};
static_assert(alignof(ABP_Cleo_CeilingLight_C) == 0x000008, "Wrong alignment on ABP_Cleo_CeilingLight_C");
static_assert(sizeof(ABP_Cleo_CeilingLight_C) == 0x000318, "Wrong size on ABP_Cleo_CeilingLight_C");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_Cleo_CeilingLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, PS_Hanging_Dust_Triangle) == 0x0002C0, "Member 'ABP_Cleo_CeilingLight_C::PS_Hanging_Dust_Triangle' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, Fog) == 0x0002C8, "Member 'ABP_Cleo_CeilingLight_C::Fog' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, PlayerLight) == 0x0002D0, "Member 'ABP_Cleo_CeilingLight_C::PlayerLight' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, Interior) == 0x0002D8, "Member 'ABP_Cleo_CeilingLight_C::Interior' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, SpotLight1) == 0x0002E0, "Member 'ABP_Cleo_CeilingLight_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, StaticMesh) == 0x0002E8, "Member 'ABP_Cleo_CeilingLight_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, Player_Light_Position) == 0x0002F0, "Member 'ABP_Cleo_CeilingLight_C::Player_Light_Position' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, Dust_Specks) == 0x0002FC, "Member 'ABP_Cleo_CeilingLight_C::Dust_Specks' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, Parameters) == 0x000300, "Member 'ABP_Cleo_CeilingLight_C::Parameters' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_C, UseLight) == 0x000310, "Member 'ABP_Cleo_CeilingLight_C::UseLight' has a wrong offset!");

}

