#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DynamicTOD

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DynamicTOD.BP_DynamicTOD_C.ExecuteUbergraph_BP_DynamicTOD
// 0x03A8 (0x03A8 - 0x0000)
struct BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeBetweenUpdates;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_UpdateLength;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_2;    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Wetness;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_1;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentWeatherAmount_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentMaterialWetness_1;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentWeatherAmount;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentMaterialWetness;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeIn_3;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeIn_2;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetRawHour_ReturnValue;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetRawHour_ReturnValue_1;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_10;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_11;                      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeIn_1;                       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeIn;                         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerVolume*                         CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue_1;         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0174(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue_12;                      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time_5;                         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_3;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time_4;                         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_4;      // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time_3;                         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_5;      // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_13;                      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_14;                      // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_15;                      // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time_2;                         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time_1;                         // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time;                           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeatherStateContainer*                 CallFunc_SaveWeatherValues_BP_Output;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue_1;        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue_2;        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeatherStateContainer*                 CallFunc_GetPreviousWeatherState_ReturnValue;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_3;         // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_4;         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue_1;    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetNormalizedTime_ReturnValue;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_16;                      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_17;                      // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_18;                      // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue_3;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue_4;        // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_2;        // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313[0x1];                                      // 0x0313(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue_5;        // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_5;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          CallFunc_Array_Get_Item_1;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x033E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F[0x1];                                      // 0x033F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_7;         // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue_6;        // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_8;         // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_6;         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue_2;    // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_19;                      // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_20;                      // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerVolume*                         CallFunc_Array_Get_Item_2;                         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD) == 0x000008, "Wrong alignment on BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD");
static_assert(sizeof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD) == 0x0003A8, "Wrong size on BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, EntryPoint) == 0x000000, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_1) == 0x000020, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_2) == 0x000024, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_3) == 0x000028, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_4) == 0x00002C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_5) == 0x000030, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_6) == 0x000034, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_7) == 0x000038, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_8) == 0x00003C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_9) == 0x000040, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_bool_True_if_break_was_hit_Variable) == 0x000044, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Not_PreBool_ReturnValue) == 0x000045, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_TimeBetweenUpdates) == 0x000054, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_TimeBetweenUpdates' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_UpdateLength) == 0x000058, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_UpdateLength' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Not_PreBool_ReturnValue_1) == 0x00005C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000060, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Less_FloatFloat_ReturnValue) == 0x000064, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000068, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetScalarParameterValue_ReturnValue_2) == 0x000070, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000074, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_int_Array_Index_Variable) == 0x000078, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_Wetness) == 0x00007C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_Wetness' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_OverlappedActor_1) == 0x000080, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_OverlappedActor_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_OtherActor_1) == 0x000088, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_Event_CurrentWeatherAmount_1) == 0x000090, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_Event_CurrentWeatherAmount_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_Event_CurrentMaterialWetness_1) == 0x000094, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_Event_CurrentMaterialWetness_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_Event_CurrentWeatherAmount) == 0x000098, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_Event_CurrentWeatherAmount' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_Event_CurrentMaterialWetness) == 0x00009C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_Event_CurrentMaterialWetness' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_OverlappedActor) == 0x0000A0, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_OtherActor) == 0x0000A8, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_IsOverlappingActor_ReturnValue) == 0x0000B0, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000B4, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetActorBounds_Origin) == 0x0000C0, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetActorBounds_BoxExtent) == 0x0000CC, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_BreakVector_X) == 0x0000D8, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_BreakVector_Y) == 0x0000DC, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000E4, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_MakeVector_ReturnValue) == 0x0000E8, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F4, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000100, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_TimeIn_3) == 0x000104, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_TimeIn_3' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_TimeIn_2) == 0x000108, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_TimeIn_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00010C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x00010D, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_K2_GetRawHour_ReturnValue) == 0x000110, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_K2_GetRawHour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_SelectFloat_ReturnValue) == 0x000114, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000118, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000119, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_int_Loop_Counter_Variable_1) == 0x00011C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_int_Array_Index_Variable_1) == 0x000124, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_K2_GetRawHour_ReturnValue_1) == 0x000128, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_K2_GetRawHour_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_10) == 0x00012C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_11) == 0x000130, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_TimeIn_1) == 0x000134, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_TimeIn_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x000138, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_TimeIn) == 0x00013C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_TimeIn' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000140, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000141, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Not_PreBool_ReturnValue_2) == 0x000142, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Array_Get_Item) == 0x000148, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000158, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_BooleanAND_ReturnValue_1) == 0x000161, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000168, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000170, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_IsOverlappingActor_ReturnValue_1) == 0x000171, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_IsOverlappingActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000174, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_12) == 0x0001FC, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000200, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_MakeVector_ReturnValue_1) == 0x000204, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_SwitchEnum_CmpSuccess) == 0x000210, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_MakeVector_ReturnValue_2) == 0x000214, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_RandomBoolWithWeight_ReturnValue_1) == 0x000220, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_RandomBoolWithWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_Time_5) == 0x000224, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_Time_5' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_EqualEqual_FloatFloat_ReturnValue_3) == 0x000228, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_EqualEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_RandomFloatInRange_ReturnValue) == 0x00022C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_Time_4) == 0x000230, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_Time_4' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_EqualEqual_FloatFloat_ReturnValue_4) == 0x000234, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_EqualEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Array_Length_ReturnValue_1) == 0x000238, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Less_IntInt_ReturnValue_1) == 0x00023C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x000240, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, K2Node_CustomEvent_Time_3) == 0x000248, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::K2Node_CustomEvent_Time_3' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_EqualEqual_FloatFloat_ReturnValue_5) == 0x00024C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_EqualEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000250, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, Temp_int_Loop_Counter_Variable_2) == 0x000254, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Add_IntInt_ReturnValue_2) == 0x000258, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00025C, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Add_FloatFloat_ReturnValue) == 0x000260, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD, CallFunc_Lerp_ReturnValue_13) == 0x000264, "Member 'BP_DynamicTOD_C_ExecuteUbergraph_BP_DynamicTOD::CallFunc_Lerp_ReturnValue_13' has a wrong offset!");
