#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENV_RES_Wallsconse_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ENV_RES_Wallsconse_01.BP_ENV_RES_Wallsconse_01_C
// 0x0010 (0x02D8 - 0x02C8)
class ABP_ENV_RES_Wallsconse_01_C final : public AStaticMeshActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewVar_0;                                          // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ENV_RES_Wallsconse_01_C">();
	}
	static class ABP_ENV_RES_Wallsconse_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ENV_RES_Wallsconse_01_C>();
	}
};
static_assert(alignof(ABP_ENV_RES_Wallsconse_01_C) == 0x000008, "Wrong alignment on ABP_ENV_RES_Wallsconse_01_C");
static_assert(sizeof(ABP_ENV_RES_Wallsconse_01_C) == 0x0002D8, "Wrong size on ABP_ENV_RES_Wallsconse_01_C");
static_assert(offsetof(ABP_ENV_RES_Wallsconse_01_C, PointLight) == 0x0002C8, "Member 'ABP_ENV_RES_Wallsconse_01_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_ENV_RES_Wallsconse_01_C, UseLight) == 0x0002D0, "Member 'ABP_ENV_RES_Wallsconse_01_C::UseLight' has a wrong offset!");
static_assert(offsetof(ABP_ENV_RES_Wallsconse_01_C, NewVar_0) == 0x0002D1, "Member 'ABP_ENV_RES_Wallsconse_01_C::NewVar_0' has a wrong offset!");

}

