#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENV_RES_Wallsconse_01_Stationary

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ENV_RES_Wallsconse_01_Stationary.BP_ENV_RES_Wallsconse_01_Stationary_C
// 0x0018 (0x02E0 - 0x02C8)
class ABP_ENV_RES_Wallsconse_01_Stationary_C final : public AStaticMeshActor
{
public:
	class UAkComponent*                           Emt_wallsconse_light;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ENV_RES_Wallsconse_01_Stationary_C">();
	}
	static class ABP_ENV_RES_Wallsconse_01_Stationary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ENV_RES_Wallsconse_01_Stationary_C>();
	}
};
static_assert(alignof(ABP_ENV_RES_Wallsconse_01_Stationary_C) == 0x000008, "Wrong alignment on ABP_ENV_RES_Wallsconse_01_Stationary_C");
static_assert(sizeof(ABP_ENV_RES_Wallsconse_01_Stationary_C) == 0x0002E0, "Wrong size on ABP_ENV_RES_Wallsconse_01_Stationary_C");
static_assert(offsetof(ABP_ENV_RES_Wallsconse_01_Stationary_C, Emt_wallsconse_light) == 0x0002C8, "Member 'ABP_ENV_RES_Wallsconse_01_Stationary_C::Emt_wallsconse_light' has a wrong offset!");
static_assert(offsetof(ABP_ENV_RES_Wallsconse_01_Stationary_C, PointLight) == 0x0002D0, "Member 'ABP_ENV_RES_Wallsconse_01_Stationary_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_ENV_RES_Wallsconse_01_Stationary_C, UseLight) == 0x0002D8, "Member 'ABP_ENV_RES_Wallsconse_01_Stationary_C::UseLight' has a wrong offset!");

}

