#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fill_Volume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Fill_Volume.BP_Fill_Volume_C.UserConstructionScript
// 0x0110 (0x0110 - 0x0000)
struct BP_Fill_Volume_C_UserConstructionScript final
{
public:
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      CallFunc_Array_Get_Item;                           // 0x0050(0x0080)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Fill_Volume_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Fill_Volume_C_UserConstructionScript");
static_assert(sizeof(BP_Fill_Volume_C_UserConstructionScript) == 0x000110, "Wrong size on BP_Fill_Volume_C_UserConstructionScript");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, NiagaraSystem) == 0x000000, "Member 'BP_Fill_Volume_C_UserConstructionScript::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Fill_Volume_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Vector_GetAbs_ReturnValue) == 0x000010, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x00001C, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_VSize_ReturnValue) == 0x000034, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000038, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000044, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_Fill_Volume_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000D8, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000E4, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F0, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000100, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_Contains_ReturnValue) == 0x000101, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fill_Volume_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000102, "Member 'BP_Fill_Volume_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

