#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlickeringLight

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FlickeringLight.BP_FlickeringLight_C.ExecuteUbergraph_BP_FlickeringLight
// 0x0020 (0x0020 - 0x0000)
struct BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_3; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight) == 0x000008, "Wrong alignment on BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight");
static_assert(sizeof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight) == 0x000020, "Wrong size on BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, EntryPoint) == 0x000000, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000010, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000014, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_K2_GetScalarParameterValue_ReturnValue_2) == 0x000018, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_K2_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight, CallFunc_K2_GetScalarParameterValue_ReturnValue_3) == 0x00001C, "Member 'BP_FlickeringLight_C_ExecuteUbergraph_BP_FlickeringLight::CallFunc_K2_GetScalarParameterValue_ReturnValue_3' has a wrong offset!");

}

