#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ground_Spawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Ground_Spawner.BP_Ground_Spawner_C.ExecuteUbergraph_BP_Ground_Spawner
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner) == 0x000010, "Wrong alignment on BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner");
static_assert(sizeof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner) == 0x0001D0, "Wrong size on BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, EntryPoint) == 0x000000, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, Temp_object_Variable) == 0x000008, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000074, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000078, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00007C, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000080, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000084, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_MakeVector_ReturnValue_1) == 0x000094, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000AC, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_LineTraceSingle_OutHit) == 0x0000B8, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_LineTraceSingle_ReturnValue) == 0x000140, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_bBlockingHit) == 0x000141, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x000142, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_Time) == 0x000144, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_Distance) == 0x000148, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_Location) == 0x00014C, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_ImpactPoint) == 0x000158, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_Normal) == 0x000164, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_PhysMat) == 0x000180, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_HitActor) == 0x000188, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_HitComponent) == 0x000190, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_HitBoneName) == 0x000198, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_HitItem) == 0x0001A0, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_ElementIndex) == 0x0001A4, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_FaceIndex) == 0x0001A8, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_TraceStart) == 0x0001AC, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_BreakHitResult_TraceEnd) == 0x0001B8, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001C8, "Member 'BP_Ground_Spawner_C_ExecuteUbergraph_BP_Ground_Spawner::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BP_Ground_Spawner.BP_Ground_Spawner_C.UserConstructionScript
// 0x00BC (0x00BC - 0x0000)
struct BP_Ground_Spawner_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ground_Spawner_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Ground_Spawner_C_UserConstructionScript");
static_assert(sizeof(BP_Ground_Spawner_C_UserConstructionScript) == 0x0000BC, "Wrong size on BP_Ground_Spawner_C_UserConstructionScript");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000000, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000004, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000010, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x000020, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000024, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000028, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Ground_Spawner_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000B0, "Member 'BP_Ground_Spawner_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

}

