#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Moon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Moon.BP_Moon_C
// 0x0028 (0x02F0 - 0x02C8)
class ABP_Moon_C final : public AStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Moon_Rings_A;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DynamicTOD_C*                       TimeOfDayBP;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            LightBrightnessCurve;                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Moon(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Moon_C">();
	}
	static class ABP_Moon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Moon_C>();
	}
};
static_assert(alignof(ABP_Moon_C) == 0x000008, "Wrong alignment on ABP_Moon_C");
static_assert(sizeof(ABP_Moon_C) == 0x0002F0, "Wrong size on ABP_Moon_C");
static_assert(offsetof(ABP_Moon_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_Moon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Moon_C, Moon_Rings_A) == 0x0002D0, "Member 'ABP_Moon_C::Moon_Rings_A' has a wrong offset!");
static_assert(offsetof(ABP_Moon_C, DynamicMaterial) == 0x0002D8, "Member 'ABP_Moon_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Moon_C, TimeOfDayBP) == 0x0002E0, "Member 'ABP_Moon_C::TimeOfDayBP' has a wrong offset!");
static_assert(offsetof(ABP_Moon_C, LightBrightnessCurve) == 0x0002E8, "Member 'ABP_Moon_C::LightBrightnessCurve' has a wrong offset!");

}

