#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Res_WallSeamA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Res_WallSeamA.BP_Res_WallSeamA_C
// 0x0040 (0x02F8 - 0x02B8)
class ABP_Res_WallSeamA_C final : public AActor
{
public:
	class UAkComponent*                           Ak;                                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttenuationRadius;                                 // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightOn;                                           // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LightColor;                                        // 0x02DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightTemperature;                                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Res_WallSeamA_C">();
	}
	static class ABP_Res_WallSeamA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Res_WallSeamA_C>();
	}
};
static_assert(alignof(ABP_Res_WallSeamA_C) == 0x000008, "Wrong alignment on ABP_Res_WallSeamA_C");
static_assert(sizeof(ABP_Res_WallSeamA_C) == 0x0002F8, "Wrong size on ABP_Res_WallSeamA_C");
static_assert(offsetof(ABP_Res_WallSeamA_C, Ak) == 0x0002B8, "Member 'ABP_Res_WallSeamA_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, PointLight) == 0x0002C0, "Member 'ABP_Res_WallSeamA_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, StaticMesh) == 0x0002C8, "Member 'ABP_Res_WallSeamA_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, LightIntensity) == 0x0002D0, "Member 'ABP_Res_WallSeamA_C::LightIntensity' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, AttenuationRadius) == 0x0002D4, "Member 'ABP_Res_WallSeamA_C::AttenuationRadius' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, LightOn) == 0x0002D8, "Member 'ABP_Res_WallSeamA_C::LightOn' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, LightColor) == 0x0002DC, "Member 'ABP_Res_WallSeamA_C::LightColor' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, LightTemperature) == 0x0002EC, "Member 'ABP_Res_WallSeamA_C::LightTemperature' has a wrong offset!");
static_assert(offsetof(ABP_Res_WallSeamA_C, UseLight) == 0x0002F0, "Member 'ABP_Res_WallSeamA_C::UseLight' has a wrong offset!");

}

