#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Res_UnderCabinet_Light

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Res_UnderCabinet_Light.BP_Res_UnderCabinet_Light_C
// 0x0018 (0x02D0 - 0x02B8)
class ABP_Res_UnderCabinet_Light_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Res_Int_Cabinet_AddOn;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Res_UnderCabinet_Light_C">();
	}
	static class ABP_Res_UnderCabinet_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Res_UnderCabinet_Light_C>();
	}
};
static_assert(alignof(ABP_Res_UnderCabinet_Light_C) == 0x000008, "Wrong alignment on ABP_Res_UnderCabinet_Light_C");
static_assert(sizeof(ABP_Res_UnderCabinet_Light_C) == 0x0002D0, "Wrong size on ABP_Res_UnderCabinet_Light_C");
static_assert(offsetof(ABP_Res_UnderCabinet_Light_C, PointLight) == 0x0002B8, "Member 'ABP_Res_UnderCabinet_Light_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Res_UnderCabinet_Light_C, Res_Int_Cabinet_AddOn) == 0x0002C0, "Member 'ABP_Res_UnderCabinet_Light_C::Res_Int_Cabinet_AddOn' has a wrong offset!");
static_assert(offsetof(ABP_Res_UnderCabinet_Light_C, UseLight) == 0x0002C8, "Member 'ABP_Res_UnderCabinet_Light_C::UseLight' has a wrong offset!");

}

