#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RectLightTurnOff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RectLightTurnOff.BP_RectLightTurnOff_C
// 0x0018 (0x02D0 - 0x02B8)
class ABP_RectLightTurnOff_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RectLightTurnOff(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void NewFunction_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RectLightTurnOff_C">();
	}
	static class ABP_RectLightTurnOff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RectLightTurnOff_C>();
	}
};
static_assert(alignof(ABP_RectLightTurnOff_C) == 0x000008, "Wrong alignment on ABP_RectLightTurnOff_C");
static_assert(sizeof(ABP_RectLightTurnOff_C) == 0x0002D0, "Wrong size on ABP_RectLightTurnOff_C");
static_assert(offsetof(ABP_RectLightTurnOff_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_RectLightTurnOff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RectLightTurnOff_C, RectLight) == 0x0002C0, "Member 'ABP_RectLightTurnOff_C::RectLight' has a wrong offset!");
static_assert(offsetof(ABP_RectLightTurnOff_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_RectLightTurnOff_C::DefaultSceneRoot' has a wrong offset!");

}

