#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SPC_INT_PS_Ramp_A_3m

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SPC_INT_PS_Ramp_A_3m.BP_SPC_INT_PS_Ramp_A_3m_C
// 0x0018 (0x02D0 - 0x02B8)
class ABP_SPC_INT_PS_Ramp_A_3m_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SPC_INT_PS_Ramp_A_3m;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SPC_INT_PS_Ramp_A_3m_C">();
	}
	static class ABP_SPC_INT_PS_Ramp_A_3m_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SPC_INT_PS_Ramp_A_3m_C>();
	}
};
static_assert(alignof(ABP_SPC_INT_PS_Ramp_A_3m_C) == 0x000008, "Wrong alignment on ABP_SPC_INT_PS_Ramp_A_3m_C");
static_assert(sizeof(ABP_SPC_INT_PS_Ramp_A_3m_C) == 0x0002D0, "Wrong size on ABP_SPC_INT_PS_Ramp_A_3m_C");
static_assert(offsetof(ABP_SPC_INT_PS_Ramp_A_3m_C, Box) == 0x0002B8, "Member 'ABP_SPC_INT_PS_Ramp_A_3m_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_SPC_INT_PS_Ramp_A_3m_C, SPC_INT_PS_Ramp_A_3m) == 0x0002C0, "Member 'ABP_SPC_INT_PS_Ramp_A_3m_C::SPC_INT_PS_Ramp_A_3m' has a wrong offset!");
static_assert(offsetof(ABP_SPC_INT_PS_Ramp_A_3m_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_SPC_INT_PS_Ramp_A_3m_C::DefaultSceneRoot' has a wrong offset!");

}

