#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Steam_Leak_Constant

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Steam_Leak_Constant.BP_Steam_Leak_Constant_C.ExecuteUbergraph_BP_Steam_Leak_Constant
// 0x0030 (0x0030 - 0x0000)
struct BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant) == 0x000008, "Wrong alignment on BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant");
static_assert(sizeof(BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant) == 0x000030, "Wrong size on BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant");
static_assert(offsetof(BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant, EntryPoint) == 0x000000, "Member 'BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant, Temp_struct_Variable) == 0x000008, "Member 'BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant, Temp_delegate_Variable) == 0x000018, "Member 'BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'BP_Steam_Leak_Constant_C_ExecuteUbergraph_BP_Steam_Leak_Constant::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

