#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TS_SPC_Ramp_A_1m4m

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TS_SPC_Ramp_A_1m4m.BP_TS_SPC_Ramp_A_1m4m_C
// 0x0018 (0x02D0 - 0x02B8)
class ABP_TS_SPC_Ramp_A_1m4m_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TS_SPC_Ramp_A_1m4m;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TS_SPC_Ramp_A_1m4m_C">();
	}
	static class ABP_TS_SPC_Ramp_A_1m4m_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TS_SPC_Ramp_A_1m4m_C>();
	}
};
static_assert(alignof(ABP_TS_SPC_Ramp_A_1m4m_C) == 0x000008, "Wrong alignment on ABP_TS_SPC_Ramp_A_1m4m_C");
static_assert(sizeof(ABP_TS_SPC_Ramp_A_1m4m_C) == 0x0002D0, "Wrong size on ABP_TS_SPC_Ramp_A_1m4m_C");
static_assert(offsetof(ABP_TS_SPC_Ramp_A_1m4m_C, Box) == 0x0002B8, "Member 'ABP_TS_SPC_Ramp_A_1m4m_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_TS_SPC_Ramp_A_1m4m_C, TS_SPC_Ramp_A_1m4m) == 0x0002C0, "Member 'ABP_TS_SPC_Ramp_A_1m4m_C::TS_SPC_Ramp_A_1m4m' has a wrong offset!");
static_assert(offsetof(ABP_TS_SPC_Ramp_A_1m4m_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_TS_SPC_Ramp_A_1m4m_C::DefaultSceneRoot' has a wrong offset!");

}

