#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Button_Ledger_Header_Container_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Button_Ledger_Header_Container_BP.Button_Ledger_Header_Container_BP_C
// 0x0018 (0x02C8 - 0x02B0)
class UButton_Ledger_Header_Container_BP_C final : public UButtonBaseContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bSelected;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TextAlpha;                                         // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLastActivatable;                                  // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Button_Ledger_Header_Container_BP(int32 EntryPoint);
	void Construct();
	void OnActivatableChange(bool bActivatable);
	void BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature(const struct FComponentEvent& Event);
	void BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature(const struct FButtonEvent& Event);
	void BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature(const struct FComponentEvent& Event);
	void BndEvt__Button_K2Node_ComponentBoundEvent_51_NoParamMCD__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_25_NoParamMCD__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Button_Ledger_Header_Container_BP_C">();
	}
	static class UButton_Ledger_Header_Container_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UButton_Ledger_Header_Container_BP_C>();
	}
};
static_assert(alignof(UButton_Ledger_Header_Container_BP_C) == 0x000008, "Wrong alignment on UButton_Ledger_Header_Container_BP_C");
static_assert(sizeof(UButton_Ledger_Header_Container_BP_C) == 0x0002C8, "Wrong size on UButton_Ledger_Header_Container_BP_C");
static_assert(offsetof(UButton_Ledger_Header_Container_BP_C, UberGraphFrame) == 0x0002B0, "Member 'UButton_Ledger_Header_Container_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UButton_Ledger_Header_Container_BP_C, bSelected) == 0x0002B8, "Member 'UButton_Ledger_Header_Container_BP_C::bSelected' has a wrong offset!");
static_assert(offsetof(UButton_Ledger_Header_Container_BP_C, TextAlpha) == 0x0002BC, "Member 'UButton_Ledger_Header_Container_BP_C::TextAlpha' has a wrong offset!");
static_assert(offsetof(UButton_Ledger_Header_Container_BP_C, bLastActivatable) == 0x0002C0, "Member 'UButton_Ledger_Header_Container_BP_C::bLastActivatable' has a wrong offset!");

}

