#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonWorkbenchHeaderContainer_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function ButtonWorkbenchHeaderContainer_BP.ButtonWorkbenchHeaderContainer_BP_C.ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP
// 0x00A8 (0x00A8 - 0x0000)
struct ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0008(0x0030)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonEvent                           K2Node_ComponentBoundEvent_Event_1;                // 0x0040(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x0070(0x0030)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_Event_bActivatable;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP) == 0x000008, "Wrong alignment on ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP");
static_assert(sizeof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP) == 0x0000A8, "Wrong size on ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, EntryPoint) == 0x000000, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, K2Node_ComponentBoundEvent_Event) == 0x000008, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, CallFunc_IsSelected_ReturnValue) == 0x000038, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, CallFunc_SelectFloat_ReturnValue) == 0x00003C, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, K2Node_ComponentBoundEvent_Event_1) == 0x000040, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, K2Node_ComponentBoundEvent_Event_2) == 0x000070, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP, K2Node_Event_bActivatable) == 0x0000A0, "Member 'ButtonWorkbenchHeaderContainer_BP_C_ExecuteUbergraph_ButtonWorkbenchHeaderContainer_BP::K2Node_Event_bActivatable' has a wrong offset!");

// Function ButtonWorkbenchHeaderContainer_BP.ButtonWorkbenchHeaderContainer_BP_C.OnActivatableChange
// 0x0001 (0x0001 - 0x0000)
struct ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange final
{
public:
	bool                                          bActivatable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange) == 0x000001, "Wrong alignment on ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange");
static_assert(sizeof(ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange) == 0x000001, "Wrong size on ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange, bActivatable) == 0x000000, "Member 'ButtonWorkbenchHeaderContainer_BP_C_OnActivatableChange::bActivatable' has a wrong offset!");

// Function ButtonWorkbenchHeaderContainer_BP.ButtonWorkbenchHeaderContainer_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_157_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function ButtonWorkbenchHeaderContainer_BP.ButtonWorkbenchHeaderContainer_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature final
{
public:
	struct FButtonEvent                           Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature");
static_assert(sizeof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature) == 0x000030, "Wrong size on ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature, Event) == 0x000000, "Member 'ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_132_ButtonEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function ButtonWorkbenchHeaderContainer_BP.ButtonWorkbenchHeaderContainer_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'ButtonWorkbenchHeaderContainer_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_96_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

