#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Canid_Melee_Weapon

#include "Basic.hpp"


namespace SDK::Params
{

// Function Canid_Melee_Weapon.Canid_Melee_Weapon_C.ExecuteUbergraph_Canid_Melee_Weapon
// 0x0010 (0x0010 - 0x0000)
struct Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon) == 0x000008, "Wrong alignment on Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon");
static_assert(sizeof(Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon) == 0x000010, "Wrong size on Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon");
static_assert(offsetof(Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon, EntryPoint) == 0x000000, "Member 'Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon, K2Node_Event_OtherActor) == 0x000008, "Member 'Canid_Melee_Weapon_C_ExecuteUbergraph_Canid_Melee_Weapon::K2Node_Event_OtherActor' has a wrong offset!");

// Function Canid_Melee_Weapon.Canid_Melee_Weapon_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Canid_Melee_Weapon_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Canid_Melee_Weapon_C_ReceiveTick) == 0x000004, "Wrong alignment on Canid_Melee_Weapon_C_ReceiveTick");
static_assert(sizeof(Canid_Melee_Weapon_C_ReceiveTick) == 0x000004, "Wrong size on Canid_Melee_Weapon_C_ReceiveTick");
static_assert(offsetof(Canid_Melee_Weapon_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Canid_Melee_Weapon_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Canid_Melee_Weapon.Canid_Melee_Weapon_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Canid_Melee_Weapon_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Canid_Melee_Weapon_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Canid_Melee_Weapon_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Canid_Melee_Weapon_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Canid_Melee_Weapon_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Canid_Melee_Weapon_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Canid_Melee_Weapon_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

