#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CashRegister_A_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MeshMaterialInstance_structs.hpp"
#include "TimelineMeshTransform_structs.hpp"


namespace SDK::Params
{

// Function CashRegister_A_BP.CashRegister_A_BP_C.ExecuteUbergraph_CashRegister_A_BP
// 0x0060 (0x0060 - 0x0000)
struct CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLightEnabled_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocked_IsLocked;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBarred_IsBarred;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSealed_IsSealed;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMeshMaterialInstance>          K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	struct FMeshMaterialInstance                  CallFunc_Array_Get_Item;                           // 0x0038(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLightEnabled_ReturnValue_1;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLightEnabled_ReturnValue_2;             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP) == 0x000008, "Wrong alignment on CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP");
static_assert(sizeof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP) == 0x000060, "Wrong size on CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, EntryPoint) == 0x000000, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsLightEnabled_ReturnValue) == 0x000010, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsLightEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_SelectFloat_ReturnValue) == 0x000014, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsLocked_IsLocked) == 0x000019, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_SelectFloat_ReturnValue_1) == 0x00001C, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsBarred_IsBarred) == 0x000020, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsBarred_IsBarred' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsSealed_IsSealed) == 0x000021, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsSealed_IsSealed' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, K2Node_MakeArray_Array) == 0x000028, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_Array_Get_Item) == 0x000038, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_SelectFloat_ReturnValue_2) == 0x000058, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsLightEnabled_ReturnValue_1) == 0x00005C, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsLightEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP, CallFunc_IsLightEnabled_ReturnValue_2) == 0x00005D, "Member 'CashRegister_A_BP_C_ExecuteUbergraph_CashRegister_A_BP::CallFunc_IsLightEnabled_ReturnValue_2' has a wrong offset!");

// Function CashRegister_A_BP.CashRegister_A_BP_C.GetLightingConfig
// 0x0010 (0x0010 - 0x0000)
struct CashRegister_A_BP_C_GetLightingConfig final
{
public:
	class UStaticMeshComponent*                   Mesh;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MaterialSlot;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CashRegister_A_BP_C_GetLightingConfig) == 0x000008, "Wrong alignment on CashRegister_A_BP_C_GetLightingConfig");
static_assert(sizeof(CashRegister_A_BP_C_GetLightingConfig) == 0x000010, "Wrong size on CashRegister_A_BP_C_GetLightingConfig");
static_assert(offsetof(CashRegister_A_BP_C_GetLightingConfig, Mesh) == 0x000000, "Member 'CashRegister_A_BP_C_GetLightingConfig::Mesh' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_GetLightingConfig, MaterialSlot) == 0x000008, "Member 'CashRegister_A_BP_C_GetLightingConfig::MaterialSlot' has a wrong offset!");

// Function CashRegister_A_BP.CashRegister_A_BP_C.UserConstructionScript
// 0x00B8 (0x00B8 - 0x0000)
struct CashRegister_A_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IOCL_Interactable_C>   K2Node_DynamicCast_AsOCL_Interactable;             // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocked_IsLocked;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_AssignMaterialInstanceBySlotName_Out;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetLightingConfig_Mesh;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLightingConfig_MaterialSlot;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshMaterialInstance                  K2Node_MakeStruct_MeshMaterialInstance;            // 0x0048(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMaterialSlotNameValid_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimelineMeshTransform                 K2Node_MakeStruct_TimelineMeshTransform;           // 0x0080(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CashRegister_A_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on CashRegister_A_BP_C_UserConstructionScript");
static_assert(sizeof(CashRegister_A_BP_C_UserConstructionScript) == 0x0000B8, "Wrong size on CashRegister_A_BP_C_UserConstructionScript");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, K2Node_DynamicCast_AsOCL_Interactable) == 0x000008, "Member 'CashRegister_A_BP_C_UserConstructionScript::K2Node_DynamicCast_AsOCL_Interactable' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CashRegister_A_BP_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_IsLocked_IsLocked) == 0x000019, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_IsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x00001C, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_AssignMaterialInstanceBySlotName_Out) == 0x000030, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_AssignMaterialInstanceBySlotName_Out' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_GetLightingConfig_Mesh) == 0x000038, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_GetLightingConfig_Mesh' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_GetLightingConfig_MaterialSlot) == 0x000040, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_GetLightingConfig_MaterialSlot' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, K2Node_MakeStruct_MeshMaterialInstance) == 0x000048, "Member 'CashRegister_A_BP_C_UserConstructionScript::K2Node_MakeStruct_MeshMaterialInstance' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_IsMaterialSlotNameValid_ReturnValue) == 0x000060, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_IsMaterialSlotNameValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_ComposeRotators_ReturnValue) == 0x000064, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'CashRegister_A_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CashRegister_A_BP_C_UserConstructionScript, K2Node_MakeStruct_TimelineMeshTransform) == 0x000080, "Member 'CashRegister_A_BP_C_UserConstructionScript::K2Node_MakeStruct_TimelineMeshTransform' has a wrong offset!");

}

