#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_Concuss

#include "Basic.hpp"


namespace SDK::Params
{

// Function CE_Concuss.CE_Concuss_C.ExecuteUbergraph_CE_Concuss
// 0x0078 (0x0078 - 0x0000)
struct CE_Concuss_C_ExecuteUbergraph_CE_Concuss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Ratio;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRestoredFromSave;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss) == 0x000008, "Wrong alignment on CE_Concuss_C_ExecuteUbergraph_CE_Concuss");
static_assert(sizeof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss) == 0x000078, "Wrong size on CE_Concuss_C_ExecuteUbergraph_CE_Concuss");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, EntryPoint) == 0x000000, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::EntryPoint' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, Temp_int_Variable) == 0x000004, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_Array_Get_Item) == 0x000018, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, K2Node_Event_Target_1) == 0x000020, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, K2Node_Event_Ratio) == 0x000028, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::K2Node_Event_Ratio' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, K2Node_Event_bRestoredFromSave) == 0x00002C, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::K2Node_Event_bRestoredFromSave' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, K2Node_Event_Target) == 0x000030, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_GetObjectClass_ReturnValue) == 0x000038, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000040, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_ClassIsChildOf_ReturnValue) == 0x000048, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000050, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_DoesSocketExist_ReturnValue) == 0x000058, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000060, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_Array_AddUnique_ReturnValue) == 0x00006C, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ExecuteUbergraph_CE_Concuss, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000070, "Member 'CE_Concuss_C_ExecuteUbergraph_CE_Concuss::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function CE_Concuss.CE_Concuss_C.ReceiveClearEffect
// 0x0008 (0x0008 - 0x0000)
struct CE_Concuss_C_ReceiveClearEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CE_Concuss_C_ReceiveClearEffect) == 0x000008, "Wrong alignment on CE_Concuss_C_ReceiveClearEffect");
static_assert(sizeof(CE_Concuss_C_ReceiveClearEffect) == 0x000008, "Wrong size on CE_Concuss_C_ReceiveClearEffect");
static_assert(offsetof(CE_Concuss_C_ReceiveClearEffect, Target) == 0x000000, "Member 'CE_Concuss_C_ReceiveClearEffect::Target' has a wrong offset!");

// Function CE_Concuss.CE_Concuss_C.ReceiveApplyEffect
// 0x0010 (0x0010 - 0x0000)
struct CE_Concuss_C_ReceiveApplyEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRestoredFromSave;                                 // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CE_Concuss_C_ReceiveApplyEffect) == 0x000008, "Wrong alignment on CE_Concuss_C_ReceiveApplyEffect");
static_assert(sizeof(CE_Concuss_C_ReceiveApplyEffect) == 0x000010, "Wrong size on CE_Concuss_C_ReceiveApplyEffect");
static_assert(offsetof(CE_Concuss_C_ReceiveApplyEffect, Target) == 0x000000, "Member 'CE_Concuss_C_ReceiveApplyEffect::Target' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ReceiveApplyEffect, Ratio) == 0x000008, "Member 'CE_Concuss_C_ReceiveApplyEffect::Ratio' has a wrong offset!");
static_assert(offsetof(CE_Concuss_C_ReceiveApplyEffect, bRestoredFromSave) == 0x00000C, "Member 'CE_Concuss_C_ReceiveApplyEffect::bRestoredFromSave' has a wrong offset!");

}

