#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_NRay_PostProcess

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CE_NRay_PostProcess.CE_NRay_PostProcess_C
// 0x0038 (0x0240 - 0x0208)
class UCE_NRay_PostProcess_C final : public UPostProcessStatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystem*                        CascadeTemplate;                                   // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseNiagara;                                        // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         NiagaraTemplate;                                   // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CascadeFX;                                         // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EventDone;                                         // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraFX;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CE_NRay_PostProcess(int32 EntryPoint);
	void ReceiveClearEffect(class AActor* Target);
	void ReceiveApplyEffect(class AActor* Target, float Ratio, bool bRestoredFromSave);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CE_NRay_PostProcess_C">();
	}
	static class UCE_NRay_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCE_NRay_PostProcess_C>();
	}
};
static_assert(alignof(UCE_NRay_PostProcess_C) == 0x000008, "Wrong alignment on UCE_NRay_PostProcess_C");
static_assert(sizeof(UCE_NRay_PostProcess_C) == 0x000240, "Wrong size on UCE_NRay_PostProcess_C");
static_assert(offsetof(UCE_NRay_PostProcess_C, UberGraphFrame) == 0x000208, "Member 'UCE_NRay_PostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCE_NRay_PostProcess_C, CascadeTemplate) == 0x000210, "Member 'UCE_NRay_PostProcess_C::CascadeTemplate' has a wrong offset!");
static_assert(offsetof(UCE_NRay_PostProcess_C, UseNiagara) == 0x000218, "Member 'UCE_NRay_PostProcess_C::UseNiagara' has a wrong offset!");
static_assert(offsetof(UCE_NRay_PostProcess_C, NiagaraTemplate) == 0x000220, "Member 'UCE_NRay_PostProcess_C::NiagaraTemplate' has a wrong offset!");
static_assert(offsetof(UCE_NRay_PostProcess_C, CascadeFX) == 0x000228, "Member 'UCE_NRay_PostProcess_C::CascadeFX' has a wrong offset!");
static_assert(offsetof(UCE_NRay_PostProcess_C, EventDone) == 0x000230, "Member 'UCE_NRay_PostProcess_C::EventDone' has a wrong offset!");
static_assert(offsetof(UCE_NRay_PostProcess_C, NiagaraFX) == 0x000238, "Member 'UCE_NRay_PostProcess_C::NiagaraFX' has a wrong offset!");

}

