#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_Weaken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CE_Weaken.CE_Weaken_C
// 0x0028 (0x01E0 - 0x01B8)
class UCE_Weaken_C final : public UMultiStatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           Sockets;                                           // 0x01C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UParticleSystemComponent*>       PSs;                                               // 0x01D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_CE_Weaken(int32 EntryPoint);
	void ReceiveClearEffect(class AActor* Target);
	void ReceiveApplyEffect(class AActor* Target, float Ratio, bool bRestoredFromSave);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CE_Weaken_C">();
	}
	static class UCE_Weaken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCE_Weaken_C>();
	}
};
static_assert(alignof(UCE_Weaken_C) == 0x000008, "Wrong alignment on UCE_Weaken_C");
static_assert(sizeof(UCE_Weaken_C) == 0x0001E0, "Wrong size on UCE_Weaken_C");
static_assert(offsetof(UCE_Weaken_C, UberGraphFrame) == 0x0001B8, "Member 'UCE_Weaken_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCE_Weaken_C, Sockets) == 0x0001C0, "Member 'UCE_Weaken_C::Sockets' has a wrong offset!");
static_assert(offsetof(UCE_Weaken_C, PSs) == 0x0001D0, "Member 'UCE_Weaken_C::PSs' has a wrong offset!");

}

