#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterOverview_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterOverview_BP.CharacterOverview_BP_C
// 0x0028 (0x0520 - 0x04F8)
class UCharacterOverview_BP_C final : public UCharacterOverviewWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TTDFrame;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 XPBacking;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               XPOverlay;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterOverview_BP_C">();
	}
	static class UCharacterOverview_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterOverview_BP_C>();
	}
};
static_assert(alignof(UCharacterOverview_BP_C) == 0x000008, "Wrong alignment on UCharacterOverview_BP_C");
static_assert(sizeof(UCharacterOverview_BP_C) == 0x000520, "Wrong size on UCharacterOverview_BP_C");
static_assert(offsetof(UCharacterOverview_BP_C, Image_0) == 0x0004F8, "Member 'UCharacterOverview_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCharacterOverview_BP_C, Image_1) == 0x000500, "Member 'UCharacterOverview_BP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCharacterOverview_BP_C, TTDFrame) == 0x000508, "Member 'UCharacterOverview_BP_C::TTDFrame' has a wrong offset!");
static_assert(offsetof(UCharacterOverview_BP_C, XPBacking) == 0x000510, "Member 'UCharacterOverview_BP_C::XPBacking' has a wrong offset!");
static_assert(offsetof(UCharacterOverview_BP_C, XPOverlay) == 0x000518, "Member 'UCharacterOverview_BP_C::XPOverlay' has a wrong offset!");

}

