#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterStatusEffectEntry_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Indiana_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CharacterStatusEffectEntry_BP.CharacterStatusEffectEntry_BP_C.ExecuteUbergraph_CharacterStatusEffectEntry_BP
// 0x00D8 (0x00D8 - 0x0000)
struct CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0008(0x0030)(ConstParm, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue_1;             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0028)()
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x00A8(0x0030)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP) == 0x000008, "Wrong alignment on CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP");
static_assert(sizeof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP) == 0x0000D8, "Wrong size on CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, EntryPoint) == 0x000000, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, K2Node_ComponentBoundEvent_Event) == 0x000008, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, CallFunc_GetColorByType_ReturnValue) == 0x000038, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, CallFunc_GetColorByType_ReturnValue_1) == 0x000048, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::CallFunc_GetColorByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, K2Node_MakeStruct_SlateColor_1) == 0x000080, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP, K2Node_ComponentBoundEvent_Event_1) == 0x0000A8, "Member 'CharacterStatusEffectEntry_BP_C_ExecuteUbergraph_CharacterStatusEffectEntry_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");

// Function CharacterStatusEffectEntry_BP.CharacterStatusEffectEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_56_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function CharacterStatusEffectEntry_BP.CharacterStatusEffectEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'CharacterStatusEffectEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_6_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

