#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterDetails_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterDetails_BP.CharacterDetails_BP_C
// 0x0020 (0x0358 - 0x0338)
class UCharacterDetails_BP_C final : public UCharacterDetailsWidget
{
public:
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget_0;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget_1;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget_C_0;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterDetails_BP_C">();
	}
	static class UCharacterDetails_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterDetails_BP_C>();
	}
};
static_assert(alignof(UCharacterDetails_BP_C) == 0x000008, "Wrong alignment on UCharacterDetails_BP_C");
static_assert(sizeof(UCharacterDetails_BP_C) == 0x000358, "Wrong size on UCharacterDetails_BP_C");
static_assert(offsetof(UCharacterDetails_BP_C, BackgroundPanelWidget) == 0x000338, "Member 'UCharacterDetails_BP_C::BackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(UCharacterDetails_BP_C, BackgroundPanelWidget_0) == 0x000340, "Member 'UCharacterDetails_BP_C::BackgroundPanelWidget_0' has a wrong offset!");
static_assert(offsetof(UCharacterDetails_BP_C, BackgroundPanelWidget_1) == 0x000348, "Member 'UCharacterDetails_BP_C::BackgroundPanelWidget_1' has a wrong offset!");
static_assert(offsetof(UCharacterDetails_BP_C, BackgroundPanelWidget_C_0) == 0x000350, "Member 'UCharacterDetails_BP_C::BackgroundPanelWidget_C_0' has a wrong offset!");

}

