#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloudNoiseSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CloudNoiseSettings.CloudNoiseSettings
// 0x000C (0x000C - 0x0000)
struct FCloudNoiseSettings final
{
public:
	float                                         NoiseTiling_6_A88C75CE41384502C2167BAFB165960A;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseIntensity_7_3C91204E44D26EDA1F226691E5DBA77C; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseSeed_8_8C33D00144BDE4547AD180A7CBD0EC4C;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCloudNoiseSettings) == 0x000004, "Wrong alignment on FCloudNoiseSettings");
static_assert(sizeof(FCloudNoiseSettings) == 0x00000C, "Wrong size on FCloudNoiseSettings");
static_assert(offsetof(FCloudNoiseSettings, NoiseTiling_6_A88C75CE41384502C2167BAFB165960A) == 0x000000, "Member 'FCloudNoiseSettings::NoiseTiling_6_A88C75CE41384502C2167BAFB165960A' has a wrong offset!");
static_assert(offsetof(FCloudNoiseSettings, NoiseIntensity_7_3C91204E44D26EDA1F226691E5DBA77C) == 0x000004, "Member 'FCloudNoiseSettings::NoiseIntensity_7_3C91204E44D26EDA1F226691E5DBA77C' has a wrong offset!");
static_assert(offsetof(FCloudNoiseSettings, NoiseSeed_8_8C33D00144BDE4547AD180A7CBD0EC4C) == 0x000008, "Member 'FCloudNoiseSettings::NoiseSeed_8_8C33D00144BDE4547AD180A7CBD0EC4C' has a wrong offset!");

}

