#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComputerBase_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function ComputerBase_BP.ComputerBase_BP_C.ExecuteUbergraph_ComputerBase_BP
// 0x00E8 (0x00E8 - 0x0000)
struct ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator, uint8 HackSeconds, uint8 HackNumResources)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_7;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Initiator)>      K2Node_CreateDelegate_OutputDelegate_8;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Initiator_8;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator_7;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator_6;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator_5;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator_4;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator_3;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator_2;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_HackSeconds;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_HackNumResources;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Initiator_1;                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Initiator;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP) == 0x000008, "Wrong alignment on ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP");
static_assert(sizeof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP) == 0x0000E8, "Wrong size on ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, EntryPoint) == 0x000000, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CreateDelegate_OutputDelegate_8) == 0x000088, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_8) == 0x000098, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_8' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_7) == 0x0000A0, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_7' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_6) == 0x0000A8, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_6' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_5) == 0x0000B0, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_5' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_4) == 0x0000B8, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_4' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_3) == 0x0000C0, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_3' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_2) == 0x0000C8, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_2' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_HackSeconds) == 0x0000D0, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_HackSeconds' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_HackNumResources) == 0x0000D1, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_HackNumResources' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator_1) == 0x0000D8, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator_1' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP, K2Node_CustomEvent_Initiator) == 0x0000E0, "Member 'ComputerBase_BP_C_ExecuteUbergraph_ComputerBase_BP::K2Node_CustomEvent_Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerHackLoopStop_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerHackLoopStop_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerHackLoopStop_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerHackLoopStop_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerHackLoopStop_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerHackLoopStop_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerHackLoopStop_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerHackLoopStop_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerHackInterrupted_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerHackInterrupted_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerHackInterrupted_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerHackInterrupted_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerHackInterrupted_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerHackInterrupted_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerHackInterrupted_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerHackInterrupted_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerHackStart_Event_0
// 0x0010 (0x0010 - 0x0000)
struct ComputerBase_BP_C_OnComputerHackStart_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         HackSeconds;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         HackNumResources;                                  // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerHackStart_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerHackStart_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerHackStart_Event_0) == 0x000010, "Wrong size on ComputerBase_BP_C_OnComputerHackStart_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerHackStart_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerHackStart_Event_0::Initiator' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_OnComputerHackStart_Event_0, HackSeconds) == 0x000008, "Member 'ComputerBase_BP_C_OnComputerHackStart_Event_0::HackSeconds' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_OnComputerHackStart_Event_0, HackNumResources) == 0x000009, "Member 'ComputerBase_BP_C_OnComputerHackStart_Event_0::HackNumResources' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerHackSuccess_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerHackSuccess_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerHackSuccess_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerHackSuccess_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerHackSuccess_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerHackSuccess_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerHackSuccess_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerHackSuccess_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerInsufficientSkill_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerInsufficientSkill_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerLocked_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerLocked_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerLocked_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerLocked_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerLocked_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerLocked_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerLocked_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerLocked_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerUnlockAttemptedLocked_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerUnlockAttemptedLocked_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerUnlocked_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerUnlocked_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerUnlocked_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerUnlocked_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerUnlocked_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerUnlocked_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerUnlocked_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerUnlocked_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.OnComputerUse_Event_0
// 0x0008 (0x0008 - 0x0000)
struct ComputerBase_BP_C_OnComputerUse_Event_0 final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComputerBase_BP_C_OnComputerUse_Event_0) == 0x000008, "Wrong alignment on ComputerBase_BP_C_OnComputerUse_Event_0");
static_assert(sizeof(ComputerBase_BP_C_OnComputerUse_Event_0) == 0x000008, "Wrong size on ComputerBase_BP_C_OnComputerUse_Event_0");
static_assert(offsetof(ComputerBase_BP_C_OnComputerUse_Event_0, Initiator) == 0x000000, "Member 'ComputerBase_BP_C_OnComputerUse_Event_0::Initiator' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct ComputerBase_BP_C_UserConstructionScript final
{
public:
	ECheckBranches                                CallFunc_ConstructComponentByClass_Branches;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_ConstructComponentByClass_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UComputerTerminalAudioComponent*        K2Node_DynamicCast_AsComputer_Terminal_Audio_Component; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ComputerBase_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on ComputerBase_BP_C_UserConstructionScript");
static_assert(sizeof(ComputerBase_BP_C_UserConstructionScript) == 0x000028, "Wrong size on ComputerBase_BP_C_UserConstructionScript");
static_assert(offsetof(ComputerBase_BP_C_UserConstructionScript, CallFunc_ConstructComponentByClass_Branches) == 0x000000, "Member 'ComputerBase_BP_C_UserConstructionScript::CallFunc_ConstructComponentByClass_Branches' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_UserConstructionScript, CallFunc_ConstructComponentByClass_ReturnValue) == 0x000008, "Member 'ComputerBase_BP_C_UserConstructionScript::CallFunc_ConstructComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'ComputerBase_BP_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_UserConstructionScript, K2Node_DynamicCast_AsComputer_Terminal_Audio_Component) == 0x000018, "Member 'ComputerBase_BP_C_UserConstructionScript::K2Node_DynamicCast_AsComputer_Terminal_Audio_Component' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ComputerBase_BP_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ComputerBase_BP.ComputerBase_BP_C.IsLocked
// 0x0003 (0x0003 - 0x0000)
struct ComputerBase_BP_C_IsLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EComputerLockState                            CallFunc_GetCurrentState_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ComputerBase_BP_C_IsLocked) == 0x000001, "Wrong alignment on ComputerBase_BP_C_IsLocked");
static_assert(sizeof(ComputerBase_BP_C_IsLocked) == 0x000003, "Wrong size on ComputerBase_BP_C_IsLocked");
static_assert(offsetof(ComputerBase_BP_C_IsLocked, ReturnValue) == 0x000000, "Member 'ComputerBase_BP_C_IsLocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_IsLocked, CallFunc_GetCurrentState_ReturnValue) == 0x000001, "Member 'ComputerBase_BP_C_IsLocked::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComputerBase_BP_C_IsLocked, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ComputerBase_BP_C_IsLocked::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

