#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompassEntry_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CompassEntry_BP.CompassEntry_BP_C
// 0x0020 (0x02C0 - 0x02A0)
class UCompassEntry_BP_C final : public UCompassEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         AbsoluteOrientation;                               // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SignMultiplier;                                    // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustedOrientation;                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CompassEntry_BP(int32 EntryPoint);
	void InitProperties(const struct FEntryData& EntryData);
	void Construct();
	void SetDistanceValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CompassEntry_BP_C">();
	}
	static class UCompassEntry_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompassEntry_BP_C>();
	}
};
static_assert(alignof(UCompassEntry_BP_C) == 0x000008, "Wrong alignment on UCompassEntry_BP_C");
static_assert(sizeof(UCompassEntry_BP_C) == 0x0002C0, "Wrong size on UCompassEntry_BP_C");
static_assert(offsetof(UCompassEntry_BP_C, UberGraphFrame) == 0x0002A0, "Member 'UCompassEntry_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCompassEntry_BP_C, InvalidationBox_0) == 0x0002A8, "Member 'UCompassEntry_BP_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UCompassEntry_BP_C, AbsoluteOrientation) == 0x0002B0, "Member 'UCompassEntry_BP_C::AbsoluteOrientation' has a wrong offset!");
static_assert(offsetof(UCompassEntry_BP_C, SignMultiplier) == 0x0002B4, "Member 'UCompassEntry_BP_C::SignMultiplier' has a wrong offset!");
static_assert(offsetof(UCompassEntry_BP_C, AdjustedOrientation) == 0x0002B8, "Member 'UCompassEntry_BP_C::AdjustedOrientation' has a wrong offset!");

}

