#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompanionMoveTo_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CompanionMoveTo_BP.CompanionMoveTo_BP_C
// 0x0020 (0x0328 - 0x0308)
class UCompanionMoveTo_BP_C final : public UCompanionMoveToWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroOutro;                                        // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle;                                              // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MoveToImage;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CompanionMoveTo_BP(int32 EntryPoint);
	void OnMoveToCancelled();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnNewLocation();
	void OnAnimationEnd();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CompanionMoveTo_BP_C">();
	}
	static class UCompanionMoveTo_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionMoveTo_BP_C>();
	}
};
static_assert(alignof(UCompanionMoveTo_BP_C) == 0x000008, "Wrong alignment on UCompanionMoveTo_BP_C");
static_assert(sizeof(UCompanionMoveTo_BP_C) == 0x000328, "Wrong size on UCompanionMoveTo_BP_C");
static_assert(offsetof(UCompanionMoveTo_BP_C, UberGraphFrame) == 0x000308, "Member 'UCompanionMoveTo_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCompanionMoveTo_BP_C, IntroOutro) == 0x000310, "Member 'UCompanionMoveTo_BP_C::IntroOutro' has a wrong offset!");
static_assert(offsetof(UCompanionMoveTo_BP_C, Idle) == 0x000318, "Member 'UCompanionMoveTo_BP_C::Idle' has a wrong offset!");
static_assert(offsetof(UCompanionMoveTo_BP_C, MoveToImage) == 0x000320, "Member 'UCompanionMoveTo_BP_C::MoveToImage' has a wrong offset!");

}

