#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConversationLighting_EV

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ConversationLighting_EV.ConversationLighting_EV_C
// 0x0018 (0x0378 - 0x0360)
class AConversationLighting_EV_C final : public AConversationLighting
{
public:
	class USpotLightComponent*                    SpeakerLight_2;                                    // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpeakerLight_1;                                    // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConversationLighting_EV_C">();
	}
	static class AConversationLighting_EV_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConversationLighting_EV_C>();
	}
};
static_assert(alignof(AConversationLighting_EV_C) == 0x000008, "Wrong alignment on AConversationLighting_EV_C");
static_assert(sizeof(AConversationLighting_EV_C) == 0x000378, "Wrong size on AConversationLighting_EV_C");
static_assert(offsetof(AConversationLighting_EV_C, SpeakerLight_2) == 0x000360, "Member 'AConversationLighting_EV_C::SpeakerLight_2' has a wrong offset!");
static_assert(offsetof(AConversationLighting_EV_C, SpeakerLight_1) == 0x000368, "Member 'AConversationLighting_EV_C::SpeakerLight_1' has a wrong offset!");
static_assert(offsetof(AConversationLighting_EV_C, DefaultSceneRoot) == 0x000370, "Member 'AConversationLighting_EV_C::DefaultSceneRoot' has a wrong offset!");

}

