#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConversationWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConversationWidget_BP.ConversationWidget_BP_C
// 0x0068 (0x0588 - 0x0520)
class UConversationWidget_BP_C final : public UConversationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutContent;                                    // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInContent;                                     // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ConversationBackingBot;                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConversationBackingTop;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HistoryBackingBot;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HistoryBackingTop;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PlaybackMultiplier;                                // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ConversationBackingTopInst;                        // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ConversationBackingBotInst;                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HistoryBackingTopInst;                             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HistoryBackingBotInst;                             // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ConversationWidget_BP(int32 EntryPoint);
	void Construct();
	void SetHistoryBackingFillRatio(float DesiredHistoryHeight);
	void SetConversationBackingFillRatio(float DesiredOverlayHeight);
	ESlateVisibility Get_Line1_Visibility_0();
	ESlateVisibility Get_Line0_Visibility_0();
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConversationWidget_BP_C">();
	}
	static class UConversationWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationWidget_BP_C>();
	}
};
static_assert(alignof(UConversationWidget_BP_C) == 0x000008, "Wrong alignment on UConversationWidget_BP_C");
static_assert(sizeof(UConversationWidget_BP_C) == 0x000588, "Wrong size on UConversationWidget_BP_C");
static_assert(offsetof(UConversationWidget_BP_C, UberGraphFrame) == 0x000520, "Member 'UConversationWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, FadeOutContent) == 0x000528, "Member 'UConversationWidget_BP_C::FadeOutContent' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, FadeInContent) == 0x000530, "Member 'UConversationWidget_BP_C::FadeInContent' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, ConversationBackingBot) == 0x000538, "Member 'UConversationWidget_BP_C::ConversationBackingBot' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, ConversationBackingTop) == 0x000540, "Member 'UConversationWidget_BP_C::ConversationBackingTop' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, HistoryBackingBot) == 0x000548, "Member 'UConversationWidget_BP_C::HistoryBackingBot' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, HistoryBackingTop) == 0x000550, "Member 'UConversationWidget_BP_C::HistoryBackingTop' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, Image_0) == 0x000558, "Member 'UConversationWidget_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, PlaybackMultiplier) == 0x000560, "Member 'UConversationWidget_BP_C::PlaybackMultiplier' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, ConversationBackingTopInst) == 0x000568, "Member 'UConversationWidget_BP_C::ConversationBackingTopInst' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, ConversationBackingBotInst) == 0x000570, "Member 'UConversationWidget_BP_C::ConversationBackingBotInst' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, HistoryBackingTopInst) == 0x000578, "Member 'UConversationWidget_BP_C::HistoryBackingTopInst' has a wrong offset!");
static_assert(offsetof(UConversationWidget_BP_C, HistoryBackingBotInst) == 0x000580, "Member 'UConversationWidget_BP_C::HistoryBackingBotInst' has a wrong offset!");

}

