#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CREA_Pteroray_AnimBP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CombatEnum_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CREA_Pteroray_AnimBP.CREA_Pteroray_AnimBP_C
// 0x18C0 (0x2210 - 0x0950)
class UCREA_Pteroray_AnimBP_C final : public UTPVAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0958(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0988(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x09D0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0A18(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0A60(0x00A0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0B00(0x0018)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x0B18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x0B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0B90(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0BB8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x0C38(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0C68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0C90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0CB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0CE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0D30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0D58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0D80(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0DA8(0x0198)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0F40(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0FC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0FF0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x1070(0x0030)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_1;                    // 0x10A0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x1130(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1160(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x11E0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x1210(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x12C0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x12F0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x1370(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x13A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x13C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x13F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x14B8(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay;                      // 0x14E0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1570(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x15A0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1620(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x1650(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1700(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1730(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x17B0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x17E0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1890(0x0030)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x18C0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1940(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1970(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1A20(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1AC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1AE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1B10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1B38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1B60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1B88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1BB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1BD8(0x0028)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_2;               // 0x1C00(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1C88(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_1;               // 0x1CB8(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1D40(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed;                 // 0x1D70(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1DF8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1E28(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1ED8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1F08(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1FB8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2000(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2048(0x00A0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x20E8(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2178(0x0048)()
	class UCREA_Pteroray_WeaponAnimations_BP_C*   WeaponAnimationBP;                                 // 0x21C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECombatEnum                                   CombatEnum;                                        // 0x21C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomIdle;                                        // 0x21C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21CA[0x2];                                     // 0x21CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitFlinchActive;                                   // 0x21CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionDirection;                              // 0x21D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionRate;                                   // 0x21D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHitReactType                                 HitReactionType;                                   // 0x21D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D9[0x7];                                     // 0x21D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRandomPlayerSequenceEntryNamed> RandomIdleStart;                                   // 0x21E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRandomPlayerSequenceEntryNamed> RandomCombatIdle;                                  // 0x21F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsAttacking;                                       // 0x2200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CREA_Pteroray_AnimBP(int32 EntryPoint);
	void OnNewWeaponAnimations(class UWeaponAnimations* NewWeaponAnimations);
	void AnimNotify_TurnOffRandomIdle();
	void AnimNotify_RandomIdle();
	void OnRebuildAnimationSetData();
	void NeutralTransition();
	void CombatTransition();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CREA_Pteroray_AnimBP_AnimGraphNode_TransitionResult_95D5644F41421A0DFB8BECA5E7A80CBC();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CREA_Pteroray_AnimBP_C">();
	}
	static class UCREA_Pteroray_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCREA_Pteroray_AnimBP_C>();
	}
};
static_assert(alignof(UCREA_Pteroray_AnimBP_C) == 0x000010, "Wrong alignment on UCREA_Pteroray_AnimBP_C");
static_assert(sizeof(UCREA_Pteroray_AnimBP_C) == 0x002210, "Wrong size on UCREA_Pteroray_AnimBP_C");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, UberGraphFrame) == 0x000950, "Member 'UCREA_Pteroray_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Root) == 0x000958, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Slot_5) == 0x000988, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Slot_4) == 0x0009D0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Slot_3) == 0x000A18, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000A60, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x000B00, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_27) == 0x000B18, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_27' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_26) == 0x000B40, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_26' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_25) == 0x000B68, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_24) == 0x000B90, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000BB8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_16) == 0x000C38, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_16' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_23) == 0x000C68, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_22) == 0x000C90, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_21) == 0x000CB8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_20) == 0x000CE0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_19) == 0x000D08, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_18) == 0x000D30, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_17) == 0x000D58, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x000D80, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000DA8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000F40, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_15) == 0x000FC0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_15' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000FF0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_14) == 0x001070, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_14' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_LocomotionPlay_1) == 0x0010A0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_LocomotionPlay_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_13) == 0x001130, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_13' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001160, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_12) == 0x0011E0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_12' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateMachine_5) == 0x001210, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateMachine_5' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_11) == 0x0012C0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0012F0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_10) == 0x001370, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x0013A0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x0013C8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x0013F0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x001418, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x001440, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x001468, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x001490, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x0014B8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_LocomotionPlay) == 0x0014E0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_LocomotionPlay' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_9) == 0x001570, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0015A0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_8) == 0x001620, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateMachine_4) == 0x001650, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateMachine_4' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_7) == 0x001700, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001730, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_6) == 0x0017B0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateMachine_3) == 0x0017E0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001890, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_RandomPlayer) == 0x0018C0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_RandomPlayer' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_4) == 0x001940, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x001970, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001A20, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x001AC0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x001AE8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x001B10, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x001B38, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x001B60, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x001B88, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001BB0, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_TransitionResult) == 0x001BD8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_RandomSequenceNamed_2) == 0x001C00, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_RandomSequenceNamed_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_3) == 0x001C88, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_RandomSequenceNamed_1) == 0x001CB8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_RandomSequenceNamed_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_2) == 0x001D40, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_RandomSequenceNamed) == 0x001D70, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_RandomSequenceNamed' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult_1) == 0x001DF8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x001E28, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateResult) == 0x001ED8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_StateMachine) == 0x001F08, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Slot_2) == 0x001FB8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Slot_1) == 0x002000, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002048, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_PoseSnapshot) == 0x0020E8, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, AnimGraphNode_Slot) == 0x002178, "Member 'UCREA_Pteroray_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, WeaponAnimationBP) == 0x0021C0, "Member 'UCREA_Pteroray_AnimBP_C::WeaponAnimationBP' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, CombatEnum) == 0x0021C8, "Member 'UCREA_Pteroray_AnimBP_C::CombatEnum' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, RandomIdle) == 0x0021C9, "Member 'UCREA_Pteroray_AnimBP_C::RandomIdle' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, HitFlinchActive) == 0x0021CC, "Member 'UCREA_Pteroray_AnimBP_C::HitFlinchActive' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, HitReactionDirection) == 0x0021D0, "Member 'UCREA_Pteroray_AnimBP_C::HitReactionDirection' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, HitReactionRate) == 0x0021D4, "Member 'UCREA_Pteroray_AnimBP_C::HitReactionRate' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, HitReactionType) == 0x0021D8, "Member 'UCREA_Pteroray_AnimBP_C::HitReactionType' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, RandomIdleStart) == 0x0021E0, "Member 'UCREA_Pteroray_AnimBP_C::RandomIdleStart' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, RandomCombatIdle) == 0x0021F0, "Member 'UCREA_Pteroray_AnimBP_C::RandomCombatIdle' has a wrong offset!");
static_assert(offsetof(UCREA_Pteroray_AnimBP_C, IsAttacking) == 0x002200, "Member 'UCREA_Pteroray_AnimBP_C::IsAttacking' has a wrong offset!");

}

