#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeathMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DeathMenu.DeathMenu_C
// 0x0040 (0x03A0 - 0x0360)
class UDeathMenu_C final : public UDeathMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackground1_BP_C*                      Background1_BP;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         ContinueText;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         LoadText;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         MainMenuText;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         QuitText;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         ResurrectText;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         SettingsText;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DeathMenu(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeathMenu_C">();
	}
	static class UDeathMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathMenu_C>();
	}
};
static_assert(alignof(UDeathMenu_C) == 0x000008, "Wrong alignment on UDeathMenu_C");
static_assert(sizeof(UDeathMenu_C) == 0x0003A0, "Wrong size on UDeathMenu_C");
static_assert(offsetof(UDeathMenu_C, UberGraphFrame) == 0x000360, "Member 'UDeathMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, Background1_BP) == 0x000368, "Member 'UDeathMenu_C::Background1_BP' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, ContinueText) == 0x000370, "Member 'UDeathMenu_C::ContinueText' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, LoadText) == 0x000378, "Member 'UDeathMenu_C::LoadText' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, MainMenuText) == 0x000380, "Member 'UDeathMenu_C::MainMenuText' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, QuitText) == 0x000388, "Member 'UDeathMenu_C::QuitText' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, ResurrectText) == 0x000390, "Member 'UDeathMenu_C::ResurrectText' has a wrong offset!");
static_assert(offsetof(UDeathMenu_C, SettingsText) == 0x000398, "Member 'UDeathMenu_C::SettingsText' has a wrong offset!");

}

