#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogBoxRespec_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DialogBoxRespec_BP.DialogBoxRespec_BP_C
// 0x0038 (0x0408 - 0x03D0)
class UDialogBoxRespec_BP_C final : public UDialogBoxRespecWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackground1_BP_C*                      Background1_BP;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingBot;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingTop;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackingBotInst;                                    // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DialogBoxRespec_BP(int32 EntryPoint);
	void SetNewBackingMaterialHeight(float NewHeight);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DialogBoxRespec_BP_C">();
	}
	static class UDialogBoxRespec_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDialogBoxRespec_BP_C>();
	}
};
static_assert(alignof(UDialogBoxRespec_BP_C) == 0x000008, "Wrong alignment on UDialogBoxRespec_BP_C");
static_assert(sizeof(UDialogBoxRespec_BP_C) == 0x000408, "Wrong size on UDialogBoxRespec_BP_C");
static_assert(offsetof(UDialogBoxRespec_BP_C, UberGraphFrame) == 0x0003D0, "Member 'UDialogBoxRespec_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDialogBoxRespec_BP_C, FadeIn) == 0x0003D8, "Member 'UDialogBoxRespec_BP_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UDialogBoxRespec_BP_C, Background1_BP) == 0x0003E0, "Member 'UDialogBoxRespec_BP_C::Background1_BP' has a wrong offset!");
static_assert(offsetof(UDialogBoxRespec_BP_C, BackingBot) == 0x0003E8, "Member 'UDialogBoxRespec_BP_C::BackingBot' has a wrong offset!");
static_assert(offsetof(UDialogBoxRespec_BP_C, BackingTop) == 0x0003F0, "Member 'UDialogBoxRespec_BP_C::BackingTop' has a wrong offset!");
static_assert(offsetof(UDialogBoxRespec_BP_C, Frame) == 0x0003F8, "Member 'UDialogBoxRespec_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(UDialogBoxRespec_BP_C, BackingBotInst) == 0x000400, "Member 'UDialogBoxRespec_BP_C::BackingBotInst' has a wrong offset!");

}

