#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogBox1_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DialogBox1_BP.DialogBox1_BP_C
// 0x0030 (0x03E8 - 0x03B8)
class UDialogBox1_BP_C final : public UDialogBoxWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackingBot;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingTop;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackingBotInst;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DialogBox1_BP(int32 EntryPoint);
	void SetNewBackingMaterialHeight(float NewHeight);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DialogBox1_BP_C">();
	}
	static class UDialogBox1_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDialogBox1_BP_C>();
	}
};
static_assert(alignof(UDialogBox1_BP_C) == 0x000008, "Wrong alignment on UDialogBox1_BP_C");
static_assert(sizeof(UDialogBox1_BP_C) == 0x0003E8, "Wrong size on UDialogBox1_BP_C");
static_assert(offsetof(UDialogBox1_BP_C, UberGraphFrame) == 0x0003B8, "Member 'UDialogBox1_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDialogBox1_BP_C, FadeIn) == 0x0003C0, "Member 'UDialogBox1_BP_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UDialogBox1_BP_C, BackingBot) == 0x0003C8, "Member 'UDialogBox1_BP_C::BackingBot' has a wrong offset!");
static_assert(offsetof(UDialogBox1_BP_C, BackingTop) == 0x0003D0, "Member 'UDialogBox1_BP_C::BackingTop' has a wrong offset!");
static_assert(offsetof(UDialogBox1_BP_C, Frame) == 0x0003D8, "Member 'UDialogBox1_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(UDialogBox1_BP_C, BackingBotInst) == 0x0003E0, "Member 'UDialogBox1_BP_C::BackingBotInst' has a wrong offset!");

}

