#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisguiseWidget_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function DisguiseWidget_BP.DisguiseWidget_BP_C.ExecuteUbergraph_DisguiseWidget_BP
// 0x0050 (0x0050 - 0x0000)
struct DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentFrame;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_StartTime_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_StartTime;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP) == 0x000008, "Wrong alignment on DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP");
static_assert(sizeof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP) == 0x000050, "Wrong size on DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, EntryPoint) == 0x000000, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, K2Node_Event_NewValue) == 0x000028, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, K2Node_Event_CurrentFrame) == 0x00002C, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::K2Node_Event_CurrentFrame' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, K2Node_Event_StartTime_1) == 0x000034, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::K2Node_Event_StartTime_1' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, K2Node_Event_StartTime) == 0x000038, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::K2Node_Event_StartTime' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_PlayAnimation_ReturnValue_3) == 0x000040, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP, CallFunc_PlayAnimation_ReturnValue_4) == 0x000048, "Member 'DisguiseWidget_BP_C_ExecuteUbergraph_DisguiseWidget_BP::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");

// Function DisguiseWidget_BP.DisguiseWidget_BP_C.HideDisguiseMeterTip
// 0x0004 (0x0004 - 0x0000)
struct DisguiseWidget_BP_C_HideDisguiseMeterTip final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisguiseWidget_BP_C_HideDisguiseMeterTip) == 0x000004, "Wrong alignment on DisguiseWidget_BP_C_HideDisguiseMeterTip");
static_assert(sizeof(DisguiseWidget_BP_C_HideDisguiseMeterTip) == 0x000004, "Wrong size on DisguiseWidget_BP_C_HideDisguiseMeterTip");
static_assert(offsetof(DisguiseWidget_BP_C_HideDisguiseMeterTip, StartTime) == 0x000000, "Member 'DisguiseWidget_BP_C_HideDisguiseMeterTip::StartTime' has a wrong offset!");

// Function DisguiseWidget_BP.DisguiseWidget_BP_C.ShowDisguiseMeterTip
// 0x0004 (0x0004 - 0x0000)
struct DisguiseWidget_BP_C_ShowDisguiseMeterTip final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisguiseWidget_BP_C_ShowDisguiseMeterTip) == 0x000004, "Wrong alignment on DisguiseWidget_BP_C_ShowDisguiseMeterTip");
static_assert(sizeof(DisguiseWidget_BP_C_ShowDisguiseMeterTip) == 0x000004, "Wrong size on DisguiseWidget_BP_C_ShowDisguiseMeterTip");
static_assert(offsetof(DisguiseWidget_BP_C_ShowDisguiseMeterTip, StartTime) == 0x000000, "Member 'DisguiseWidget_BP_C_ShowDisguiseMeterTip::StartTime' has a wrong offset!");

// Function DisguiseWidget_BP.DisguiseWidget_BP_C.UpdateDisguiseMeterInnerAnim
// 0x0004 (0x0004 - 0x0000)
struct DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim final
{
public:
	int32                                         CurrentFrame;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim) == 0x000004, "Wrong alignment on DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim");
static_assert(sizeof(DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim) == 0x000004, "Wrong size on DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim");
static_assert(offsetof(DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim, CurrentFrame) == 0x000000, "Member 'DisguiseWidget_BP_C_UpdateDisguiseMeterInnerAnim::CurrentFrame' has a wrong offset!");

// Function DisguiseWidget_BP.DisguiseWidget_BP_C.UpdateDisguiseMeterFill
// 0x0004 (0x0004 - 0x0000)
struct DisguiseWidget_BP_C_UpdateDisguiseMeterFill final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisguiseWidget_BP_C_UpdateDisguiseMeterFill) == 0x000004, "Wrong alignment on DisguiseWidget_BP_C_UpdateDisguiseMeterFill");
static_assert(sizeof(DisguiseWidget_BP_C_UpdateDisguiseMeterFill) == 0x000004, "Wrong size on DisguiseWidget_BP_C_UpdateDisguiseMeterFill");
static_assert(offsetof(DisguiseWidget_BP_C_UpdateDisguiseMeterFill, NewValue) == 0x000000, "Member 'DisguiseWidget_BP_C_UpdateDisguiseMeterFill::NewValue' has a wrong offset!");

}

