#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DST_Barrel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Destructible_Abstract_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DST_Barrel.DST_Barrel_C
// 0x00D0 (0x0570 - 0x04A0)
class ADST_Barrel_C : public ADestructible_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DST_Barrel_C;                       // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RadialMask_RadialMask_3C22CD6249A35083D6996EA7F4169F2D; // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RadialMask__Direction_3C22CD6249A35083D6996EA7F4169F2D; // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RadialMask;                                        // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ExplosionFX;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParticleSysParam>              BaseParams;                                        // 0x04D0(0x0010)(Edit, BlueprintVisible)
	class UParticleSystem*                        ExplosionFXDamageType;                             // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParticleSysParam>              DamageTypeParams;                                  // 0x04E8(0x0010)(Edit, BlueprintVisible)
	struct FColor                                 LightColor;                                        // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_intensity;                                   // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDestroyed;                                        // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temperature;                                       // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNiagara;                                         // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         NiagaraFX;                                         // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDecals;                                         // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Decal_Material;                                    // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Decal_Size;                                        // 0x0528(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSecondaryDecals;                                // 0x0534(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SecondaryDecalMaterial;                            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SecondaryDecalSize;                                // 0x0540(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondaryDecalLifetime;                            // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondaryDecalFadeOut;                             // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondaryDecalSorting;                             // 0x0554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        MainDecal;                                         // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        SecondaryDecal;                                    // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DynamicDecals;                                     // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DST_Barrel(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnDestructibleDestroyed_Event_0(class AActor* Instigator_0);
	void RadialMask__UpdateFunc();
	void RadialMask__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DST_Barrel_C">();
	}
	static class ADST_Barrel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADST_Barrel_C>();
	}
};
static_assert(alignof(ADST_Barrel_C) == 0x000008, "Wrong alignment on ADST_Barrel_C");
static_assert(sizeof(ADST_Barrel_C) == 0x000570, "Wrong size on ADST_Barrel_C");
static_assert(offsetof(ADST_Barrel_C, UberGraphFrame_DST_Barrel_C) == 0x0004A0, "Member 'ADST_Barrel_C::UberGraphFrame_DST_Barrel_C' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, PointLight) == 0x0004A8, "Member 'ADST_Barrel_C::PointLight' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, TextRender) == 0x0004B0, "Member 'ADST_Barrel_C::TextRender' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, RadialMask_RadialMask_3C22CD6249A35083D6996EA7F4169F2D) == 0x0004B8, "Member 'ADST_Barrel_C::RadialMask_RadialMask_3C22CD6249A35083D6996EA7F4169F2D' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, RadialMask__Direction_3C22CD6249A35083D6996EA7F4169F2D) == 0x0004BC, "Member 'ADST_Barrel_C::RadialMask__Direction_3C22CD6249A35083D6996EA7F4169F2D' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, RadialMask) == 0x0004C0, "Member 'ADST_Barrel_C::RadialMask' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, ExplosionFX) == 0x0004C8, "Member 'ADST_Barrel_C::ExplosionFX' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, BaseParams) == 0x0004D0, "Member 'ADST_Barrel_C::BaseParams' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, ExplosionFXDamageType) == 0x0004E0, "Member 'ADST_Barrel_C::ExplosionFXDamageType' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, DamageTypeParams) == 0x0004E8, "Member 'ADST_Barrel_C::DamageTypeParams' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, LightColor) == 0x0004F8, "Member 'ADST_Barrel_C::LightColor' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, Light_intensity) == 0x0004FC, "Member 'ADST_Barrel_C::Light_intensity' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, bDestroyed) == 0x000500, "Member 'ADST_Barrel_C::bDestroyed' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, Temperature) == 0x000504, "Member 'ADST_Barrel_C::Temperature' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, IsNiagara) == 0x000508, "Member 'ADST_Barrel_C::IsNiagara' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, NiagaraFX) == 0x000510, "Member 'ADST_Barrel_C::NiagaraFX' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, UseDecals) == 0x000518, "Member 'ADST_Barrel_C::UseDecals' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, Decal_Material) == 0x000520, "Member 'ADST_Barrel_C::Decal_Material' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, Decal_Size) == 0x000528, "Member 'ADST_Barrel_C::Decal_Size' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, UseSecondaryDecals) == 0x000534, "Member 'ADST_Barrel_C::UseSecondaryDecals' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, SecondaryDecalMaterial) == 0x000538, "Member 'ADST_Barrel_C::SecondaryDecalMaterial' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, SecondaryDecalSize) == 0x000540, "Member 'ADST_Barrel_C::SecondaryDecalSize' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, SecondaryDecalLifetime) == 0x00054C, "Member 'ADST_Barrel_C::SecondaryDecalLifetime' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, SecondaryDecalFadeOut) == 0x000550, "Member 'ADST_Barrel_C::SecondaryDecalFadeOut' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, SecondaryDecalSorting) == 0x000554, "Member 'ADST_Barrel_C::SecondaryDecalSorting' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, MainDecal) == 0x000558, "Member 'ADST_Barrel_C::MainDecal' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, SecondaryDecal) == 0x000560, "Member 'ADST_Barrel_C::SecondaryDecal' has a wrong offset!");
static_assert(offsetof(ADST_Barrel_C, DynamicDecals) == 0x000568, "Member 'ADST_Barrel_C::DynamicDecals' has a wrong offset!");

}

