#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Energy_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Energy_Projectile.Energy_Projectile_C
// 0x00E0 (0x0678 - 0x0598)
class AEnergy_Projectile_C : public AProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Plasma_Ball;                                    // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Plasma_Ball;                                    // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_RadialMask_A4B5E7B7458A006F14ED4297361E0369; // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_A4B5E7B7458A006F14ED4297361E0369; // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Secondary_Decal;                                   // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNiagara;                                         // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsGround;                                          // 0x05D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D2[0x2];                                      // 0x05D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Hit_Location;                                      // 0x05D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Normal;                                        // 0x05E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EIndianaDamageType                            DamageType;                                        // 0x05EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED[0x3];                                      // 0x05ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BulletColor;                                       // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraImpactEffect;                               // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraGroundEffect;                               // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impact_Size;                                       // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ImpactRotation;                                    // 0x0614(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Decal_Rotation;                                    // 0x0620(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Decal_Random_Rotation;                             // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Decal_Material;                                    // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Decal_Size;                                        // 0x0638(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Lifetime;                                    // 0x0644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Fade;                                        // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Secondary_Decal;                               // 0x064C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Secondary_Decal_Material;                          // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Secondary_Decal_Size;                              // 0x0658(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Secondary_Decal_Lifetime;                          // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Secondary_Decal_Fade;                              // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Dynamic_Decal;                                 // 0x066C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66D[0x3];                                      // 0x066D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Weapon_Damage_Radius;                              // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Energy_Projectile(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Energy_Projectile_C">();
	}
	static class AEnergy_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnergy_Projectile_C>();
	}
};
static_assert(alignof(AEnergy_Projectile_C) == 0x000008, "Wrong alignment on AEnergy_Projectile_C");
static_assert(sizeof(AEnergy_Projectile_C) == 0x000678, "Wrong size on AEnergy_Projectile_C");
static_assert(offsetof(AEnergy_Projectile_C, UberGraphFrame) == 0x000598, "Member 'AEnergy_Projectile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, NS_Plasma_Ball) == 0x0005A0, "Member 'AEnergy_Projectile_C::NS_Plasma_Ball' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, PS_Plasma_Ball) == 0x0005A8, "Member 'AEnergy_Projectile_C::PS_Plasma_Ball' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Timeline_0_RadialMask_A4B5E7B7458A006F14ED4297361E0369) == 0x0005B0, "Member 'AEnergy_Projectile_C::Timeline_0_RadialMask_A4B5E7B7458A006F14ED4297361E0369' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Timeline_0__Direction_A4B5E7B7458A006F14ED4297361E0369) == 0x0005B4, "Member 'AEnergy_Projectile_C::Timeline_0__Direction_A4B5E7B7458A006F14ED4297361E0369' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Timeline_0) == 0x0005B8, "Member 'AEnergy_Projectile_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal) == 0x0005C0, "Member 'AEnergy_Projectile_C::Decal' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Secondary_Decal) == 0x0005C8, "Member 'AEnergy_Projectile_C::Secondary_Decal' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, IsNiagara) == 0x0005D0, "Member 'AEnergy_Projectile_C::IsNiagara' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, IsGround) == 0x0005D1, "Member 'AEnergy_Projectile_C::IsGround' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Hit_Location) == 0x0005D4, "Member 'AEnergy_Projectile_C::Hit_Location' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Hit_Normal) == 0x0005E0, "Member 'AEnergy_Projectile_C::Hit_Normal' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, DamageType) == 0x0005EC, "Member 'AEnergy_Projectile_C::DamageType' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, BulletColor) == 0x0005F0, "Member 'AEnergy_Projectile_C::BulletColor' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, NiagaraImpactEffect) == 0x000600, "Member 'AEnergy_Projectile_C::NiagaraImpactEffect' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, NiagaraGroundEffect) == 0x000608, "Member 'AEnergy_Projectile_C::NiagaraGroundEffect' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Impact_Size) == 0x000610, "Member 'AEnergy_Projectile_C::Impact_Size' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, ImpactRotation) == 0x000614, "Member 'AEnergy_Projectile_C::ImpactRotation' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal_Rotation) == 0x000620, "Member 'AEnergy_Projectile_C::Decal_Rotation' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal_Random_Rotation) == 0x00062C, "Member 'AEnergy_Projectile_C::Decal_Random_Rotation' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal_Material) == 0x000630, "Member 'AEnergy_Projectile_C::Decal_Material' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal_Size) == 0x000638, "Member 'AEnergy_Projectile_C::Decal_Size' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal_Lifetime) == 0x000644, "Member 'AEnergy_Projectile_C::Decal_Lifetime' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Decal_Fade) == 0x000648, "Member 'AEnergy_Projectile_C::Decal_Fade' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Use_Secondary_Decal) == 0x00064C, "Member 'AEnergy_Projectile_C::Use_Secondary_Decal' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Secondary_Decal_Material) == 0x000650, "Member 'AEnergy_Projectile_C::Secondary_Decal_Material' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Secondary_Decal_Size) == 0x000658, "Member 'AEnergy_Projectile_C::Secondary_Decal_Size' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Secondary_Decal_Lifetime) == 0x000664, "Member 'AEnergy_Projectile_C::Secondary_Decal_Lifetime' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Secondary_Decal_Fade) == 0x000668, "Member 'AEnergy_Projectile_C::Secondary_Decal_Fade' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Use_Dynamic_Decal) == 0x00066C, "Member 'AEnergy_Projectile_C::Use_Dynamic_Decal' has a wrong offset!");
static_assert(offsetof(AEnergy_Projectile_C, Weapon_Damage_Radius) == 0x000670, "Member 'AEnergy_Projectile_C::Weapon_Damage_Radius' has a wrong offset!");

}

