#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ENV_CMN_LabSigns_Exit_2_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ENV_CMN_LabSigns_Exit_2_BP.ENV_CMN_LabSigns_Exit_2_BP_C
// 0x0038 (0x02F0 - 0x02B8)
class AENV_CMN_LabSigns_Exit_2_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ENV_CMN_LabSigns_Exit_01_hologram;                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ENV_CMN_LabSigns_Exit_2_BP(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ENV_CMN_LabSigns_Exit_2_BP_C">();
	}
	static class AENV_CMN_LabSigns_Exit_2_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AENV_CMN_LabSigns_Exit_2_BP_C>();
	}
};
static_assert(alignof(AENV_CMN_LabSigns_Exit_2_BP_C) == 0x000008, "Wrong alignment on AENV_CMN_LabSigns_Exit_2_BP_C");
static_assert(sizeof(AENV_CMN_LabSigns_Exit_2_BP_C) == 0x0002F0, "Wrong size on AENV_CMN_LabSigns_Exit_2_BP_C");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, UberGraphFrame) == 0x0002B8, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, ENV_CMN_LabSigns_Exit_01_hologram) == 0x0002C0, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::ENV_CMN_LabSigns_Exit_01_hologram' has a wrong offset!");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, StaticMesh8) == 0x0002C8, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, StaticMesh7) == 0x0002D0, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, StaticMesh4) == 0x0002D8, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, StaticMesh2) == 0x0002E0, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AENV_CMN_LabSigns_Exit_2_BP_C, StaticMeshComponent0) == 0x0002E8, "Member 'AENV_CMN_LabSigns_Exit_2_BP_C::StaticMeshComponent0' has a wrong offset!");

}

