#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ex_0015_ShipInt_EngineRoom

#include "Basic.hpp"


namespace SDK::Params
{

// Function Ex_0015_ShipInt_EngineRoom.Ex_0015_ShipInt_EngineRoom_C.ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom
// 0x0088 (0x0088 - 0x0000)
struct Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALight*                                 K2Node_DynamicCast_AsLight;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 K2Node_DynamicCast_AsLight_1;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom) == 0x000008, "Wrong alignment on Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom");
static_assert(sizeof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom) == 0x000088, "Wrong size on Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, EntryPoint) == 0x000000, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_GetMaterial_ReturnValue) == 0x000018, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000028, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000030, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_GetAllActorsWithTag_OutActors) == 0x000038, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Array_Get_Item) == 0x000048, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, K2Node_DynamicCast_AsLight) == 0x000058, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::K2Node_DynamicCast_AsLight' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, K2Node_DynamicCast_AsLight_1) == 0x000068, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::K2Node_DynamicCast_AsLight_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_IsVisible_ReturnValue) == 0x000071, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Not_PreBool_ReturnValue) == 0x000072, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, Temp_int_Loop_Counter_Variable_1) == 0x00007C, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Less_IntInt_ReturnValue_1) == 0x000081, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'Ex_0015_ShipInt_EngineRoom_C_ExecuteUbergraph_Ex_0015_ShipInt_EngineRoom::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

