#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ex_0015_ShipInt_Scr

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function Ex_0015_ShipInt_Scr.Ex_0015_ShipInt_Scr_C.ExecuteUbergraph_Ex_0015_ShipInt_Scr
// 0x03A8 (0x03A8 - 0x0000)
struct Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FInteractionDescription& Description)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_17;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_17;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_16;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_16;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_Actor_2;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_1;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_1;              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_2;                // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSkipped;                       // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestComplete_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_2;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_2;              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_3;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_3;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches;               // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_3;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_4;                   // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_4;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_Actor_1;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemStack                             K2Node_ActorBoundEvent_Item_2;                     // 0x0088(0x0010)(ConstParm, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_ActorBoundEvent_Initiator_4;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_Initiator_3;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_Initiator_2;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemStack                             K2Node_ActorBoundEvent_Item_1;                     // 0x00B0(0x0010)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FItemStack                             K2Node_ActorBoundEvent_Item;                       // 0x00C0(0x0010)(ConstParm, NoDestructor, ContainsInstancedReference)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_5;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_5;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_6;                   // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_6;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestStateActive_ReturnValue;           // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_GetIndianaUI_Branches;                    // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaUI*                             CallFunc_GetIndianaUI_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_15;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_15;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCinematicPlayerWidget*                 CallFunc_CreateCinematicPlayer_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_14;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_14;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_13;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_13;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_12;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_12;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_11;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_11;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_10;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_10;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_9;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_9;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_8;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_8;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_7;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_7;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_6;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_6;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_5;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_5;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_Initiator_1;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue_1;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_Actor;                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBranches                                CallFunc_StartConversation_Branches_1;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_1;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_1;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_2;             // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_2;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_2;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_9;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_10;                   // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_3;             // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID_3;           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_3;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_4;             // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_4;           // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_4;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_11;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_12;                   // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_5;             // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID_5;           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_5;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_6;             // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_6;           // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_6;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_13;                   // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_14;                   // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_7;             // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID_7;           // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_7;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_8;             // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_8;           // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_8;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_15;                   // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_16;                   // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_7;                   // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_7;              // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_8;                   // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_8;              // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_17;                   // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_18;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_9;                   // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_9;              // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_19;                   // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_10;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_10;             // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_9;             // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x1];                                      // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_9;           // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_9;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_20;                   // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_21;                   // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_10;            // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID_10;          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_10;         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_11;                  // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_11;             // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_22;                   // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_23;                   // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_11;            // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_11;          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_11;         // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_12;            // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_12;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_12;         // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_EndConversation_ReturnValue;              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_24;                   // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_25;                   // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_12;                  // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_12;             // 0x023F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_26;                   // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_13;            // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_13;          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_13;         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_13;                  // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_13;             // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_27;                   // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_28;                   // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_14;            // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_14;          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_14;         // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_14;                  // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_14;             // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_29;                   // 0x0257(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_30;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_15;            // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_15;          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_15;         // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_15;                  // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_15;             // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_31;                   // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_32;                   // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_16;                  // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_16;             // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_17;                  // 0x0267(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_17;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_33;                   // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_34;                   // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_16;            // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID_16;          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_16;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_35;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_17;            // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_273[0x1];                                      // 0x0273(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_17;          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_17;         // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_18;                  // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_18;             // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_36;                   // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_37;                   // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent2D_ReturnValue;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSkipped)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_19;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_19;             // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_38;                   // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_4;                // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue_2;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveItemFromActor_ReturnValue;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_4;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_4;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerCharacter*                K2Node_DynamicCast_AsIndiana_Player_Character;     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_1; // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_2; // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_3; // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_4; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_5; // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_6; // 0x02CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_7; // 0x02CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_8; // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_9; // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_10; // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_11; // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_12; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_13; // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_14; // 0x02D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_15; // 0x02D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterInAnyBarkConversation_ReturnValue_16; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_20;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_20;             // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_39;                   // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_21;                  // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_21;             // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_22;                  // 0x02DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_22;             // 0x02DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_40;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_41;                   // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_23;                  // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_23;             // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_24;                  // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_24;             // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_42;                   // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_43;                   // 0x02E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_25;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_25;             // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_26;                  // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_26;             // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_44;                   // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_45;                   // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_27;                  // 0x02EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_27;             // 0x02EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_28;                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_28;             // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_46;                   // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_47;                   // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_Initiator;                  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_3;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_3;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInteractionDescription                K2Node_CustomEvent_Description;                    // 0x0310(0x0028)(ConstParm, NoDestructor, ContainsInstancedReference)
	class UInteractableComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_2;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_2;               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerCharacter*                K2Node_DynamicCast_AsIndiana_Player_Character_1;   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_1;          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_1;               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_29;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_29;             // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_5;                // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_48;                   // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_30;                  // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_30;             // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_31;                  // 0x0376(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_31;             // 0x0377(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_49;                   // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_50;                   // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_6;                // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor;            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor;                 // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue_7;                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_8;                // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_32;                  // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_32;             // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_51;                   // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue;     // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_33;                  // 0x039E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_33;             // 0x039F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_52;                   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_34;                  // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_34;             // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_53;                   // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr) == 0x000008, "Wrong alignment on Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr");
static_assert(sizeof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr) == 0x0003A8, "Wrong size on Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, EntryPoint) == 0x000000, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_RemoteEvent_ReturnValue) == 0x000004, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_RemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_ActorBoundEvent_OverlappedActor_17) == 0x000028, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_ActorBoundEvent_OverlappedActor_17' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_ActorBoundEvent_OtherActor_17) == 0x000030, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_ActorBoundEvent_OtherActor_17' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_ActorBoundEvent_OverlappedActor_16) == 0x000038, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_ActorBoundEvent_OverlappedActor_16' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_ActorBoundEvent_OtherActor_16) == 0x000040, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_ActorBoundEvent_OtherActor_16' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_ActorBoundEvent_Actor_2) == 0x000048, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_ActorBoundEvent_Actor_2' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_RemoteEvent_ReturnValue_1) == 0x000050, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_RemoteEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_GetIndianaPC_ReturnValue) == 0x000058, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_GetIndianaPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_Result) == 0x000060, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_Result' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_ReturnValue) == 0x000061, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_Result_1) == 0x000062, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_Result_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_ReturnValue_1) == 0x000063, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_SwitchEnum_CmpSuccess) == 0x000064, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_SwitchEnum_CmpSuccess_1) == 0x000065, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_RemoteEvent_ReturnValue_2) == 0x000066, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_RemoteEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_CustomEvent_bSkipped) == 0x000067, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_CustomEvent_bSkipped' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsQuestComplete_ReturnValue) == 0x000068, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsQuestComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_Result_2) == 0x000069, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_Result_2' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_ReturnValue_2) == 0x00006A, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_Result_3) == 0x00006B, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_Result_3' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_IsGlobalValue_ReturnValue_3) == 0x00006C, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_IsGlobalValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_SwitchEnum_CmpSuccess_2) == 0x00006D, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, K2Node_SwitchEnum_CmpSuccess_3) == 0x00006E, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr, CallFunc_StartConversation_Branches) == 0x00006F, "Member 'Ex_0015_ShipInt_Scr_C_ExecuteUbergraph_Ex_0015_ShipInt_Scr::CallFunc_StartConversation_Branches' has a wrong offset!");
