#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EXAM_Power_Regulator_Housing

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function EXAM_Power_Regulator_Housing.EXAM_Power_Regulator_Housing_C.GetInteractLocString
// 0x0018 (0x0018 - 0x0000)
struct EXAM_Power_Regulator_Housing_C_GetInteractLocString final
{
public:
	struct FLocString                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemCountOnActor_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EXAM_Power_Regulator_Housing_C_GetInteractLocString) == 0x000008, "Wrong alignment on EXAM_Power_Regulator_Housing_C_GetInteractLocString");
static_assert(sizeof(EXAM_Power_Regulator_Housing_C_GetInteractLocString) == 0x000018, "Wrong size on EXAM_Power_Regulator_Housing_C_GetInteractLocString");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteractLocString, ReturnValue) == 0x000000, "Member 'EXAM_Power_Regulator_Housing_C_GetInteractLocString::ReturnValue' has a wrong offset!");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteractLocString, CallFunc_GetIndianaPC_ReturnValue) == 0x000008, "Member 'EXAM_Power_Regulator_Housing_C_GetInteractLocString::CallFunc_GetIndianaPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteractLocString, CallFunc_HasItemCountOnActor_ReturnValue) == 0x000010, "Member 'EXAM_Power_Regulator_Housing_C_GetInteractLocString::CallFunc_HasItemCountOnActor_ReturnValue' has a wrong offset!");

// Function EXAM_Power_Regulator_Housing.EXAM_Power_Regulator_Housing_C.GetInteraction
// 0x0048 (0x0048 - 0x0000)
struct EXAM_Power_Regulator_Housing_C_GetInteraction final
{
public:
	struct FInteractionDescription                Description;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FInteractPayload                       Payload;                                           // 0x0028(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InteractDistance;                                  // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionType                              ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EXAM_Power_Regulator_Housing_C_GetInteraction) == 0x000008, "Wrong alignment on EXAM_Power_Regulator_Housing_C_GetInteraction");
static_assert(sizeof(EXAM_Power_Regulator_Housing_C_GetInteraction) == 0x000048, "Wrong size on EXAM_Power_Regulator_Housing_C_GetInteraction");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteraction, Description) == 0x000000, "Member 'EXAM_Power_Regulator_Housing_C_GetInteraction::Description' has a wrong offset!");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteraction, Payload) == 0x000028, "Member 'EXAM_Power_Regulator_Housing_C_GetInteraction::Payload' has a wrong offset!");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteraction, InteractDistance) == 0x000040, "Member 'EXAM_Power_Regulator_Housing_C_GetInteraction::InteractDistance' has a wrong offset!");
static_assert(offsetof(EXAM_Power_Regulator_Housing_C_GetInteraction, ReturnValue) == 0x000044, "Member 'EXAM_Power_Regulator_Housing_C_GetInteraction::ReturnValue' has a wrong offset!");

}

