#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FakePlayerShip_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass FakePlayerShip_BP.FakePlayerShip_BP_C
// 0x00B8 (0x03E8 - 0x0330)
class AFakePlayerShip_BP_C final : public AShipLocation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshDoor;                                    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshShip;                                    // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ShipQualitySwapDistance;                           // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             ShipHighQualityMesh;                               // 0x0350(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             DoorHighQualityMesh;                               // 0x0378(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShipHighQuality;                                   // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShipDesiresHighQuality;                            // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShipLoadAssetHandle;                               // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DoorLoadAssetHandle;                               // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ShipLowQualityMesh;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        VFXThrustersLocation;                              // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRotator>                       VFXThrustersRotation;                              // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTransform>                     VFXThrustersTransform;                             // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_FakePlayerShip_BP(int32 EntryPoint);
	void ShipLocationDeactivated();
	void ShipLocationActivated();
	void ReceiveBeginPlay();
	void OnShipDoorLoaded(class UObject* LoadedObject);
	void ReceiveTick(float DeltaSeconds);
	void OnShipMeshLoaded(class UObject* LoadedObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FakePlayerShip_BP_C">();
	}
	static class AFakePlayerShip_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFakePlayerShip_BP_C>();
	}
};
static_assert(alignof(AFakePlayerShip_BP_C) == 0x000008, "Wrong alignment on AFakePlayerShip_BP_C");
static_assert(sizeof(AFakePlayerShip_BP_C) == 0x0003E8, "Wrong size on AFakePlayerShip_BP_C");
static_assert(offsetof(AFakePlayerShip_BP_C, UberGraphFrame) == 0x000330, "Member 'AFakePlayerShip_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, StaticMeshDoor) == 0x000338, "Member 'AFakePlayerShip_BP_C::StaticMeshDoor' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, StaticMeshShip) == 0x000340, "Member 'AFakePlayerShip_BP_C::StaticMeshShip' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, ShipQualitySwapDistance) == 0x000348, "Member 'AFakePlayerShip_BP_C::ShipQualitySwapDistance' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, ShipHighQualityMesh) == 0x000350, "Member 'AFakePlayerShip_BP_C::ShipHighQualityMesh' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, DoorHighQualityMesh) == 0x000378, "Member 'AFakePlayerShip_BP_C::DoorHighQualityMesh' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, ShipHighQuality) == 0x0003A0, "Member 'AFakePlayerShip_BP_C::ShipHighQuality' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, ShipDesiresHighQuality) == 0x0003A1, "Member 'AFakePlayerShip_BP_C::ShipDesiresHighQuality' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, ShipLoadAssetHandle) == 0x0003A4, "Member 'AFakePlayerShip_BP_C::ShipLoadAssetHandle' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, DoorLoadAssetHandle) == 0x0003A8, "Member 'AFakePlayerShip_BP_C::DoorLoadAssetHandle' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, ShipLowQualityMesh) == 0x0003B0, "Member 'AFakePlayerShip_BP_C::ShipLowQualityMesh' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, VFXThrustersLocation) == 0x0003B8, "Member 'AFakePlayerShip_BP_C::VFXThrustersLocation' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, VFXThrustersRotation) == 0x0003C8, "Member 'AFakePlayerShip_BP_C::VFXThrustersRotation' has a wrong offset!");
static_assert(offsetof(AFakePlayerShip_BP_C, VFXThrustersTransform) == 0x0003D8, "Member 'AFakePlayerShip_BP_C::VFXThrustersTransform' has a wrong offset!");

}

