#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Furniture_Chair_Base

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function Furniture_Chair_Base.Furniture_Chair_Base_C.CanInteract
// 0x0028 (0x0028 - 0x0000)
struct Furniture_Chair_Base_C_CanInteract final
{
public:
	class AIndianaCharacter*                      Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInteractPayload                       Payload;                                           // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Furniture_Chair_Base_C_CanInteract) == 0x000008, "Wrong alignment on Furniture_Chair_Base_C_CanInteract");
static_assert(sizeof(Furniture_Chair_Base_C_CanInteract) == 0x000028, "Wrong size on Furniture_Chair_Base_C_CanInteract");
static_assert(offsetof(Furniture_Chair_Base_C_CanInteract, Initiator) == 0x000000, "Member 'Furniture_Chair_Base_C_CanInteract::Initiator' has a wrong offset!");
static_assert(offsetof(Furniture_Chair_Base_C_CanInteract, Payload) == 0x000008, "Member 'Furniture_Chair_Base_C_CanInteract::Payload' has a wrong offset!");
static_assert(offsetof(Furniture_Chair_Base_C_CanInteract, ReturnValue) == 0x000020, "Member 'Furniture_Chair_Base_C_CanInteract::ReturnValue' has a wrong offset!");

}

