#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericListEntry_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function GenericListEntry_BP.GenericListEntry_BP_C.ExecuteUbergraph_GenericListEntry_BP
// 0x0158 (0x0158 - 0x0000)
struct GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_3;                // 0x0018(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x0048(0x0030)(ConstParm, ContainsInstancedReference)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x0088(0x0030)(ConstParm, ContainsInstancedReference)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B8(0x0028)()
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x00E0(0x0030)(ConstParm, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue_1;             // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0130(0x0028)()
};
static_assert(alignof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP) == 0x000008, "Wrong alignment on GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP");
static_assert(sizeof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP) == 0x000158, "Wrong size on GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, EntryPoint) == 0x000000, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, CallFunc_GetColorByType_ReturnValue) == 0x000004, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_ComponentBoundEvent_Event_3) == 0x000018, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_ComponentBoundEvent_Event_3' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_ComponentBoundEvent_Event_2) == 0x000048, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_MakeStruct_LinearColor) == 0x000078, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_ComponentBoundEvent_Event_1) == 0x000088, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_MakeStruct_SlateColor) == 0x0000B8, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_ComponentBoundEvent_Event) == 0x0000E0, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, CallFunc_GetColorByType_ReturnValue_1) == 0x000110, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::CallFunc_GetColorByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_MakeStruct_LinearColor_1) == 0x000120, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP, K2Node_MakeStruct_SlateColor_1) == 0x000130, "Member 'GenericListEntry_BP_C_ExecuteUbergraph_GenericListEntry_BP::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function GenericListEntry_BP.GenericListEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_228_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntry_BP.GenericListEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_206_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntry_BP.GenericListEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_182_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntry_BP.GenericListEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_153_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntry_BP.GenericListEntry_BP_C.SetFocusChanged
// 0x0068 (0x0068 - 0x0000)
struct GenericListEntry_BP_C_SetFocusChanged final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColorAndOpacity_ReturnValue;           // 0x0008(0x0028)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
};
static_assert(alignof(GenericListEntry_BP_C_SetFocusChanged) == 0x000008, "Wrong alignment on GenericListEntry_BP_C_SetFocusChanged");
static_assert(sizeof(GenericListEntry_BP_C_SetFocusChanged) == 0x000068, "Wrong size on GenericListEntry_BP_C_SetFocusChanged");
static_assert(offsetof(GenericListEntry_BP_C_SetFocusChanged, IsFocused) == 0x000000, "Member 'GenericListEntry_BP_C_SetFocusChanged::IsFocused' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_SetFocusChanged, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'GenericListEntry_BP_C_SetFocusChanged::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_SetFocusChanged, CallFunc_GetColorAndOpacity_ReturnValue) == 0x000008, "Member 'GenericListEntry_BP_C_SetFocusChanged::CallFunc_GetColorAndOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_SetFocusChanged, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'GenericListEntry_BP_C_SetFocusChanged::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(GenericListEntry_BP_C_SetFocusChanged, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'GenericListEntry_BP_C_SetFocusChanged::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

