#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericNotificationEntry_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function GenericNotificationEntry_BP.GenericNotificationEntry_BP_C.ExecuteUbergraph_GenericNotificationEntry_BP
// 0x0038 (0x0038 - 0x0000)
struct GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP) == 0x000008, "Wrong alignment on GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP");
static_assert(sizeof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP) == 0x000038, "Wrong size on GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP");
static_assert(offsetof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP, EntryPoint) == 0x000000, "Member 'GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'GenericNotificationEntry_BP_C_ExecuteUbergraph_GenericNotificationEntry_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

