#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GibCharacterDeath

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function GibCharacterDeath.GibCharacterDeath_C.ExecuteUbergraph_GibCharacterDeath
// 0x00A8 (0x00A8 - 0x0000)
struct GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2; // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppearanceComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBodyPart>                      CallFunc_GetBodyPartsArray_ReturnValue;            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	struct FBodyPart                              CallFunc_Array_Get_Item;                           // 0x0038(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3; // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaAiCharacter*                    K2Node_DynamicCast_AsIndiana_Ai_Character;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath) == 0x000008, "Wrong alignment on GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath");
static_assert(sizeof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath) == 0x0000A8, "Wrong size on GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, EntryPoint) == 0x000000, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, K2Node_Event_InDeathComponent) == 0x000010, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::K2Node_Event_InDeathComponent' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000018, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x00001A, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2) == 0x00001B, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_GetBodyPartsArray_ReturnValue) == 0x000028, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_GetBodyPartsArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_Array_Get_Item) == 0x000038, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3) == 0x00008D, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, K2Node_DynamicCast_AsIndiana_Ai_Character) == 0x000098, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::K2Node_DynamicCast_AsIndiana_Ai_Character' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A1, "Member 'GibCharacterDeath_C_ExecuteUbergraph_GibCharacterDeath::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function GibCharacterDeath.GibCharacterDeath_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct GibCharacterDeath_C_Execute final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GibCharacterDeath_C_Execute) == 0x000008, "Wrong alignment on GibCharacterDeath_C_Execute");
static_assert(sizeof(GibCharacterDeath_C_Execute) == 0x000008, "Wrong size on GibCharacterDeath_C_Execute");
static_assert(offsetof(GibCharacterDeath_C_Execute, InDeathComponent) == 0x000000, "Member 'GibCharacterDeath_C_Execute::InDeathComponent' has a wrong offset!");

}

