#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_BP.HUD_BP_C
// 0x0020 (0x0410 - 0x03F0)
class UHUD_BP_C final : public UHUDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBossBar_BP_C*                          BossBar;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavingWidget_BP_C*                     SavingWidget_BP;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                DialogCombatSkillComponent;                        // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUD_BP(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_BP_C">();
	}
	static class UHUD_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_BP_C>();
	}
};
static_assert(alignof(UHUD_BP_C) == 0x000008, "Wrong alignment on UHUD_BP_C");
static_assert(sizeof(UHUD_BP_C) == 0x000410, "Wrong size on UHUD_BP_C");
static_assert(offsetof(UHUD_BP_C, UberGraphFrame) == 0x0003F0, "Member 'UHUD_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_BP_C, BossBar) == 0x0003F8, "Member 'UHUD_BP_C::BossBar' has a wrong offset!");
static_assert(offsetof(UHUD_BP_C, SavingWidget_BP) == 0x000400, "Member 'UHUD_BP_C::SavingWidget_BP' has a wrong offset!");
static_assert(offsetof(UHUD_BP_C, DialogCombatSkillComponent) == 0x000408, "Member 'UHUD_BP_C::DialogCombatSkillComponent' has a wrong offset!");

}

