#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HumanDummy_UI_Animation

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HumanDummy_UI_Animation.HumanDummy_UI_Animation_C
// 0x1160 (0x16E0 - 0x0580)
class UHumanDummy_UI_Animation_C final : public UPreviewCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0588(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_1;               // 0x05B8(0x0088)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0640(0x0020)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed;                 // 0x0660(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x06E8(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0788(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x07A8(0x0048)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x07F0(0x01E0)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x09D0(0x00F8)()
	uint8                                         Pad_AC8[0x8];                                      // 0x0AC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0AD0(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0CB0(0x01E0)()
	struct FAnimNode_BatchJointDriver             AnimGraphNode_BatchJointDriver;                    // 0x0E90(0x01E0)()
	struct FAnimNode_BatchModify                  AnimGraphNode_BatchModify;                         // 0x1070(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1148(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1170(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1198(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x11C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x11E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1268(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1298(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1318(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1348(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x13C8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13F8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x14A8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1600(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1628(0x00B0)()

public:
	void ExecuteUbergraph_HumanDummy_UI_Animation(int32 EntryPoint);
	void AnimNotify_ExitSelection();
	void AnimNotify_EnterLoop();
	void AnimNotify_DisableLeftHandIK();
	void AnimNotify_EnableLeftHandIK();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumanDummy_UI_Animation_AnimGraphNode_TransitionResult_A228801F4CE1186319E3F383A9F7387C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumanDummy_UI_Animation_AnimGraphNode_TransitionResult_7845FE2F4A175870A5356FBA34251810();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumanDummy_UI_Animation_AnimGraphNode_TransitionResult_1644307246BF863ADB174885D2A5AF89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumanDummy_UI_Animation_AnimGraphNode_SequencePlayer_4503926B4668B1C18AC8D9A7D983D6F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumanDummy_UI_Animation_AnimGraphNode_SequencePlayer_B24C9C0A43C943C7EC13BE86060807C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HumanDummy_UI_Animation_AnimGraphNode_SequencePlayer_C6950AEC46E7B28CD017E6A9F3858605();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HumanDummy_UI_Animation_C">();
	}
	static class UHumanDummy_UI_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHumanDummy_UI_Animation_C>();
	}
};
static_assert(alignof(UHumanDummy_UI_Animation_C) == 0x000010, "Wrong alignment on UHumanDummy_UI_Animation_C");
static_assert(sizeof(UHumanDummy_UI_Animation_C) == 0x0016E0, "Wrong size on UHumanDummy_UI_Animation_C");
static_assert(offsetof(UHumanDummy_UI_Animation_C, UberGraphFrame) == 0x000580, "Member 'UHumanDummy_UI_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_Root) == 0x000588, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_RandomSequenceNamed_1) == 0x0005B8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_RandomSequenceNamed_1' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_ComponentToLocalSpace) == 0x000640, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_RandomSequenceNamed) == 0x000660, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_RandomSequenceNamed' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_BlendListByBool) == 0x0006E8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_LocalToComponentSpace) == 0x000788, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_Slot) == 0x0007A8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TwoBoneIK_2) == 0x0007F0, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TwoBoneIK_2' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_LegIK) == 0x0009D0, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_LegIK' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TwoBoneIK_1) == 0x000AD0, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TwoBoneIK) == 0x000CB0, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_BatchJointDriver) == 0x000E90, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_BatchJointDriver' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_BatchModify) == 0x001070, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_BatchModify' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TransitionResult_3) == 0x001148, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TransitionResult_2) == 0x001170, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TransitionResult_1) == 0x001198, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_TransitionResult) == 0x0011C0, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_SequencePlayer_2) == 0x0011E8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_StateResult_2) == 0x001268, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_SequencePlayer_1) == 0x001298, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_StateResult_1) == 0x001318, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_SequencePlayer) == 0x001348, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_StateResult) == 0x0013C8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_StateMachine) == 0x0013F8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_SaveCachedPose) == 0x0014A8, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_UseCachedPose) == 0x001600, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UHumanDummy_UI_Animation_C, AnimGraphNode_BlendListByEnum) == 0x001628, "Member 'UHumanDummy_UI_Animation_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");

}

