#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HumanDummy_UI_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function HumanDummy_UI_Animation.HumanDummy_UI_Animation_C.ExecuteUbergraph_HumanDummy_UI_Animation
// 0x0038 (0x0038 - 0x0000)
struct HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUISelectionState                             Temp_byte_Variable;                                // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUISelectionState                             Temp_byte_Variable_1;                              // 0x0011(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUISelectionState                             Temp_byte_Variable_2;                              // 0x0021(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_2;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation) == 0x000008, "Wrong alignment on HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation");
static_assert(sizeof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation) == 0x000038, "Wrong size on HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, EntryPoint) == 0x000000, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, Temp_byte_Variable) == 0x000004, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_Map_Find_Value) == 0x000008, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, Temp_byte_Variable_1) == 0x000011, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000012, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000013, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_Map_Find_Value_1) == 0x000018, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_Map_Find_ReturnValue_1) == 0x000020, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, Temp_byte_Variable_2) == 0x000021, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_Map_Find_Value_2) == 0x000028, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation, CallFunc_Map_Find_ReturnValue_2) == 0x000030, "Member 'HumanDummy_UI_Animation_C_ExecuteUbergraph_HumanDummy_UI_Animation::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");

// Function HumanDummy_UI_Animation.HumanDummy_UI_Animation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct HumanDummy_UI_Animation_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(HumanDummy_UI_Animation_C_AnimGraph) == 0x000008, "Wrong alignment on HumanDummy_UI_Animation_C_AnimGraph");
static_assert(sizeof(HumanDummy_UI_Animation_C_AnimGraph) == 0x000010, "Wrong size on HumanDummy_UI_Animation_C_AnimGraph");
static_assert(offsetof(HumanDummy_UI_Animation_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'HumanDummy_UI_Animation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

