#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IndianaFormulas_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickToughness
// 0x0014 (0x0014 - 0x0000)
struct IndianaFormulas_BP_C_LockpickToughness final
{
public:
	uint8                                         ExactLockpickDifficulty;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerLockpickSkill;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_OCLToughness_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickToughness) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_LockpickToughness");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickToughness) == 0x000014, "Wrong size on IndianaFormulas_BP_C_LockpickToughness");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickToughness, ExactLockpickDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickToughness::ExactLockpickDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickToughness, PlayerLockpickSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_LockpickToughness::PlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickToughness, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_LockpickToughness::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickToughness, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_LockpickToughness::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickToughness, CallFunc_OCLToughness_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_LockpickToughness::CallFunc_OCLToughness_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickTime
// 0x0024 (0x0024 - 0x0000)
struct IndianaFormulas_BP_C_LockpickTime final
{
public:
	uint8                                         ExactLockpickDifficulty;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerLockpickSkill;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BasePlayerLockpickSkill;                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToPick;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_LockpickToughness_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickTime) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_LockpickTime");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickTime) == 0x000024, "Wrong size on IndianaFormulas_BP_C_LockpickTime");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, ExactLockpickDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickTime::ExactLockpickDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, PlayerLockpickSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_LockpickTime::PlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, BasePlayerLockpickSkill) == 0x000008, "Member 'IndianaFormulas_BP_C_LockpickTime::BasePlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_LockpickTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, TimeToPick) == 0x000010, "Member 'IndianaFormulas_BP_C_LockpickTime::TimeToPick' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, CallFunc_LockpickToughness_ReturnValue) == 0x000014, "Member 'IndianaFormulas_BP_C_LockpickTime::CallFunc_LockpickToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, CallFunc_Less_IntInt_ReturnValue) == 0x000015, "Member 'IndianaFormulas_BP_C_LockpickTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000018, "Member 'IndianaFormulas_BP_C_LockpickTime::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'IndianaFormulas_BP_C_LockpickTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickTime, CallFunc_FMax_ReturnValue) == 0x000020, "Member 'IndianaFormulas_BP_C_LockpickTime::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickNoise
// 0x0018 (0x0018 - 0x0000)
struct IndianaFormulas_BP_C_LockpickNoise final
{
public:
	uint8                                         ExactLockpickDifficulty;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerLockpickSkill;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_LockpickToughness_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickNoise) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_LockpickNoise");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickNoise) == 0x000018, "Wrong size on IndianaFormulas_BP_C_LockpickNoise");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNoise, ExactLockpickDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickNoise::ExactLockpickDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNoise, PlayerLockpickSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_LockpickNoise::PlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNoise, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_LockpickNoise::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNoise, CallFunc_LockpickToughness_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_LockpickNoise::CallFunc_LockpickToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNoise, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_LockpickNoise::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNoise, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'IndianaFormulas_BP_C_LockpickNoise::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickNumResources
// 0x0014 (0x0014 - 0x0000)
struct IndianaFormulas_BP_C_LockpickNumResources final
{
public:
	uint8                                         ExactLockpickDifficulty;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerLockpickSkill;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BasePlayerLockpickSkill;                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         NumLockpicks;                                      // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_LockpickToughness_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickNumResources) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_LockpickNumResources");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickNumResources) == 0x000014, "Wrong size on IndianaFormulas_BP_C_LockpickNumResources");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, ExactLockpickDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickNumResources::ExactLockpickDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, PlayerLockpickSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_LockpickNumResources::PlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, BasePlayerLockpickSkill) == 0x000008, "Member 'IndianaFormulas_BP_C_LockpickNumResources::BasePlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_LockpickNumResources::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, NumLockpicks) == 0x00000D, "Member 'IndianaFormulas_BP_C_LockpickNumResources::NumLockpicks' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000E, "Member 'IndianaFormulas_BP_C_LockpickNumResources::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000F, "Member 'IndianaFormulas_BP_C_LockpickNumResources::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickNumResources, CallFunc_LockpickToughness_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_LockpickNumResources::CallFunc_LockpickToughness_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.CanLockpick
// 0x0018 (0x0018 - 0x0000)
struct IndianaFormulas_BP_C_CanLockpick final
{
public:
	uint8                                         ExactLockpickDifficulty;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerLockpickSkill;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseOCL_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IndianaFormulas_BP_C_CanLockpick) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_CanLockpick");
static_assert(sizeof(IndianaFormulas_BP_C_CanLockpick) == 0x000018, "Wrong size on IndianaFormulas_BP_C_CanLockpick");
static_assert(offsetof(IndianaFormulas_BP_C_CanLockpick, ExactLockpickDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_CanLockpick::ExactLockpickDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanLockpick, PlayerLockpickSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_CanLockpick::PlayerLockpickSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanLockpick, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_CanLockpick::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanLockpick, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_CanLockpick::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanLockpick, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'IndianaFormulas_BP_C_CanLockpick::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanLockpick, CallFunc_CanUseOCL_ReturnValue) == 0x000014, "Member 'IndianaFormulas_BP_C_CanLockpick::CallFunc_CanUseOCL_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickDifficultyFullRange
// 0x0003 (0x0003 - 0x0000)
struct IndianaFormulas_BP_C_LockpickDifficultyFullRange final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickDifficultyFullRange) == 0x000001, "Wrong alignment on IndianaFormulas_BP_C_LockpickDifficultyFullRange");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickDifficultyFullRange) == 0x000003, "Wrong size on IndianaFormulas_BP_C_LockpickDifficultyFullRange");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyFullRange, ReturnValue) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickDifficultyFullRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyFullRange, CallFunc_Subtract_ByteByte_ReturnValue) == 0x000001, "Member 'IndianaFormulas_BP_C_LockpickDifficultyFullRange::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyFullRange, CallFunc_Add_ByteByte_ReturnValue) == 0x000002, "Member 'IndianaFormulas_BP_C_LockpickDifficultyFullRange::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickDifficultyNumRanges
// 0x0003 (0x0003 - 0x0000)
struct IndianaFormulas_BP_C_LockpickDifficultyNumRanges final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickDifficultyNumRanges) == 0x000001, "Wrong alignment on IndianaFormulas_BP_C_LockpickDifficultyNumRanges");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickDifficultyNumRanges) == 0x000003, "Wrong size on IndianaFormulas_BP_C_LockpickDifficultyNumRanges");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyNumRanges, ReturnValue) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickDifficultyNumRanges::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyNumRanges, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'IndianaFormulas_BP_C_LockpickDifficultyNumRanges::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyNumRanges, CallFunc_Add_ByteByte_ReturnValue) == 0x000002, "Member 'IndianaFormulas_BP_C_LockpickDifficultyNumRanges::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.LockpickDifficultyRange
// 0x0014 (0x0014 - 0x0000)
struct IndianaFormulas_BP_C_LockpickDifficultyRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_LockpickDifficultyNumRanges_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_LockpickDifficultyFullRange_ReturnValue;  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_LockpickDifficultyRange) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_LockpickDifficultyRange");
static_assert(sizeof(IndianaFormulas_BP_C_LockpickDifficultyRange) == 0x000014, "Wrong size on IndianaFormulas_BP_C_LockpickDifficultyRange");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyRange, ReturnValue) == 0x000000, "Member 'IndianaFormulas_BP_C_LockpickDifficultyRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyRange, CallFunc_LockpickDifficultyNumRanges_ReturnValue) == 0x000004, "Member 'IndianaFormulas_BP_C_LockpickDifficultyRange::CallFunc_LockpickDifficultyNumRanges_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyRange, CallFunc_LockpickDifficultyFullRange_ReturnValue) == 0x000005, "Member 'IndianaFormulas_BP_C_LockpickDifficultyRange::CallFunc_LockpickDifficultyFullRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyRange, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_LockpickDifficultyRange::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyRange, CallFunc_Conv_ByteToFloat_ReturnValue_1) == 0x00000C, "Member 'IndianaFormulas_BP_C_LockpickDifficultyRange::CallFunc_Conv_ByteToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_LockpickDifficultyRange, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_LockpickDifficultyRange::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.ComputeExactLockpickDifficulty
// 0x000C (0x000C - 0x0000)
struct IndianaFormulas_BP_C_ComputeExactLockpickDifficulty final
{
public:
	EOCLDifficulty                                LockpickDifficulty;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillCheck;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetOCLSkillCheckValue_OCLSkillCheckValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_ComputeExactLockpickDifficulty) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_ComputeExactLockpickDifficulty");
static_assert(sizeof(IndianaFormulas_BP_C_ComputeExactLockpickDifficulty) == 0x00000C, "Wrong size on IndianaFormulas_BP_C_ComputeExactLockpickDifficulty");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactLockpickDifficulty, LockpickDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_ComputeExactLockpickDifficulty::LockpickDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactLockpickDifficulty, ReturnValue) == 0x000001, "Member 'IndianaFormulas_BP_C_ComputeExactLockpickDifficulty::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactLockpickDifficulty, SkillCheck) == 0x000004, "Member 'IndianaFormulas_BP_C_ComputeExactLockpickDifficulty::SkillCheck' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactLockpickDifficulty, CallFunc_GetOCLSkillCheckValue_OCLSkillCheckValue) == 0x000008, "Member 'IndianaFormulas_BP_C_ComputeExactLockpickDifficulty::CallFunc_GetOCLSkillCheckValue_OCLSkillCheckValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackToughness
// 0x0014 (0x0014 - 0x0000)
struct IndianaFormulas_BP_C_HackToughness final
{
public:
	uint8                                         ExactHackDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerHackSkill;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_OCLToughness_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackToughness) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_HackToughness");
static_assert(sizeof(IndianaFormulas_BP_C_HackToughness) == 0x000014, "Wrong size on IndianaFormulas_BP_C_HackToughness");
static_assert(offsetof(IndianaFormulas_BP_C_HackToughness, ExactHackDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_HackToughness::ExactHackDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackToughness, PlayerHackSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_HackToughness::PlayerHackSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackToughness, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_HackToughness::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackToughness, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_HackToughness::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackToughness, CallFunc_OCLToughness_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_HackToughness::CallFunc_OCLToughness_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackNumResources
// 0x000C (0x000C - 0x0000)
struct IndianaFormulas_BP_C_HackNumResources final
{
public:
	uint8                                         ExactHackDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerHackSkill;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_HackToughness_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Multiply_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackNumResources) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_HackNumResources");
static_assert(sizeof(IndianaFormulas_BP_C_HackNumResources) == 0x00000C, "Wrong size on IndianaFormulas_BP_C_HackNumResources");
static_assert(offsetof(IndianaFormulas_BP_C_HackNumResources, ExactHackDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_HackNumResources::ExactHackDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNumResources, PlayerHackSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_HackNumResources::PlayerHackSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNumResources, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_HackNumResources::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNumResources, CallFunc_HackToughness_ReturnValue) == 0x000009, "Member 'IndianaFormulas_BP_C_HackNumResources::CallFunc_HackToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNumResources, CallFunc_Multiply_ByteByte_ReturnValue) == 0x00000A, "Member 'IndianaFormulas_BP_C_HackNumResources::CallFunc_Multiply_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackTime
// 0x000C (0x000C - 0x0000)
struct IndianaFormulas_BP_C_HackTime final
{
public:
	uint8                                         ExactHackDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerHackSkill;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_HackToughness_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Multiply_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackTime) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_HackTime");
static_assert(sizeof(IndianaFormulas_BP_C_HackTime) == 0x00000C, "Wrong size on IndianaFormulas_BP_C_HackTime");
static_assert(offsetof(IndianaFormulas_BP_C_HackTime, ExactHackDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_HackTime::ExactHackDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackTime, PlayerHackSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_HackTime::PlayerHackSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackTime, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_HackTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackTime, CallFunc_HackToughness_ReturnValue) == 0x000009, "Member 'IndianaFormulas_BP_C_HackTime::CallFunc_HackToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackTime, CallFunc_Multiply_ByteByte_ReturnValue) == 0x00000A, "Member 'IndianaFormulas_BP_C_HackTime::CallFunc_Multiply_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackNoise
// 0x0018 (0x0018 - 0x0000)
struct IndianaFormulas_BP_C_HackNoise final
{
public:
	uint8                                         ExactHackDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerHackSkill;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_HackToughness_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackNoise) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_HackNoise");
static_assert(sizeof(IndianaFormulas_BP_C_HackNoise) == 0x000018, "Wrong size on IndianaFormulas_BP_C_HackNoise");
static_assert(offsetof(IndianaFormulas_BP_C_HackNoise, ExactHackDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_HackNoise::ExactHackDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNoise, PlayerHackSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_HackNoise::PlayerHackSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNoise, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_HackNoise::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNoise, CallFunc_HackToughness_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_HackNoise::CallFunc_HackToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNoise, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_HackNoise::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackNoise, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'IndianaFormulas_BP_C_HackNoise::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackDifficultyRange
// 0x0014 (0x0014 - 0x0000)
struct IndianaFormulas_BP_C_HackDifficultyRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_HackDifficultyNumRanges_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_HackDifficultyFullRange_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackDifficultyRange) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_HackDifficultyRange");
static_assert(sizeof(IndianaFormulas_BP_C_HackDifficultyRange) == 0x000014, "Wrong size on IndianaFormulas_BP_C_HackDifficultyRange");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyRange, ReturnValue) == 0x000000, "Member 'IndianaFormulas_BP_C_HackDifficultyRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyRange, CallFunc_HackDifficultyNumRanges_ReturnValue) == 0x000004, "Member 'IndianaFormulas_BP_C_HackDifficultyRange::CallFunc_HackDifficultyNumRanges_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyRange, CallFunc_HackDifficultyFullRange_ReturnValue) == 0x000005, "Member 'IndianaFormulas_BP_C_HackDifficultyRange::CallFunc_HackDifficultyFullRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyRange, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_HackDifficultyRange::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyRange, CallFunc_Conv_ByteToFloat_ReturnValue_1) == 0x00000C, "Member 'IndianaFormulas_BP_C_HackDifficultyRange::CallFunc_Conv_ByteToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyRange, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_HackDifficultyRange::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackDifficultyNumRanges
// 0x0003 (0x0003 - 0x0000)
struct IndianaFormulas_BP_C_HackDifficultyNumRanges final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackDifficultyNumRanges) == 0x000001, "Wrong alignment on IndianaFormulas_BP_C_HackDifficultyNumRanges");
static_assert(sizeof(IndianaFormulas_BP_C_HackDifficultyNumRanges) == 0x000003, "Wrong size on IndianaFormulas_BP_C_HackDifficultyNumRanges");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyNumRanges, ReturnValue) == 0x000000, "Member 'IndianaFormulas_BP_C_HackDifficultyNumRanges::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyNumRanges, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'IndianaFormulas_BP_C_HackDifficultyNumRanges::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyNumRanges, CallFunc_Add_ByteByte_ReturnValue) == 0x000002, "Member 'IndianaFormulas_BP_C_HackDifficultyNumRanges::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.HackDifficultyFullRange
// 0x0003 (0x0003 - 0x0000)
struct IndianaFormulas_BP_C_HackDifficultyFullRange final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_HackDifficultyFullRange) == 0x000001, "Wrong alignment on IndianaFormulas_BP_C_HackDifficultyFullRange");
static_assert(sizeof(IndianaFormulas_BP_C_HackDifficultyFullRange) == 0x000003, "Wrong size on IndianaFormulas_BP_C_HackDifficultyFullRange");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyFullRange, ReturnValue) == 0x000000, "Member 'IndianaFormulas_BP_C_HackDifficultyFullRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyFullRange, CallFunc_Subtract_ByteByte_ReturnValue) == 0x000001, "Member 'IndianaFormulas_BP_C_HackDifficultyFullRange::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_HackDifficultyFullRange, CallFunc_Add_ByteByte_ReturnValue) == 0x000002, "Member 'IndianaFormulas_BP_C_HackDifficultyFullRange::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.ComputeExactHackDifficulty
// 0x0003 (0x0003 - 0x0000)
struct IndianaFormulas_BP_C_ComputeExactHackDifficulty final
{
public:
	EOCLDifficulty                                HackDifficulty;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetOCLSkillCheckValue_OCLSkillCheckValue; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_ComputeExactHackDifficulty) == 0x000001, "Wrong alignment on IndianaFormulas_BP_C_ComputeExactHackDifficulty");
static_assert(sizeof(IndianaFormulas_BP_C_ComputeExactHackDifficulty) == 0x000003, "Wrong size on IndianaFormulas_BP_C_ComputeExactHackDifficulty");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactHackDifficulty, HackDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_ComputeExactHackDifficulty::HackDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactHackDifficulty, ReturnValue) == 0x000001, "Member 'IndianaFormulas_BP_C_ComputeExactHackDifficulty::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ComputeExactHackDifficulty, CallFunc_GetOCLSkillCheckValue_OCLSkillCheckValue) == 0x000002, "Member 'IndianaFormulas_BP_C_ComputeExactHackDifficulty::CallFunc_GetOCLSkillCheckValue_OCLSkillCheckValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.CanHack
// 0x0018 (0x0018 - 0x0000)
struct IndianaFormulas_BP_C_CanHack final
{
public:
	uint8                                         ExactComputerDifficulty;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerHackSkill;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseOCL_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IndianaFormulas_BP_C_CanHack) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_CanHack");
static_assert(sizeof(IndianaFormulas_BP_C_CanHack) == 0x000018, "Wrong size on IndianaFormulas_BP_C_CanHack");
static_assert(offsetof(IndianaFormulas_BP_C_CanHack, ExactComputerDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_CanHack::ExactComputerDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanHack, PlayerHackSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_CanHack::PlayerHackSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanHack, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_CanHack::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanHack, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_CanHack::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanHack, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'IndianaFormulas_BP_C_CanHack::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_CanHack, CallFunc_CanUseOCL_ReturnValue) == 0x000014, "Member 'IndianaFormulas_BP_C_CanHack::CallFunc_CanUseOCL_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.TrapToughness
// 0x0014 (0x0014 - 0x0000)
struct IndianaFormulas_BP_C_TrapToughness final
{
public:
	uint8                                         ExactTrapDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerEngineeringSkill;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_OCLToughness_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_TrapToughness) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_TrapToughness");
static_assert(sizeof(IndianaFormulas_BP_C_TrapToughness) == 0x000014, "Wrong size on IndianaFormulas_BP_C_TrapToughness");
static_assert(offsetof(IndianaFormulas_BP_C_TrapToughness, ExactTrapDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_TrapToughness::ExactTrapDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapToughness, PlayerEngineeringSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_TrapToughness::PlayerEngineeringSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapToughness, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_TrapToughness::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapToughness, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_TrapToughness::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapToughness, CallFunc_OCLToughness_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_TrapToughness::CallFunc_OCLToughness_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.ArmTime
// 0x000C (0x000C - 0x0000)
struct IndianaFormulas_BP_C_ArmTime final
{
public:
	uint8                                         ExactTrapDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerEngineeringSkill;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_TrapToughness_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Multiply_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_ArmTime) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_ArmTime");
static_assert(sizeof(IndianaFormulas_BP_C_ArmTime) == 0x00000C, "Wrong size on IndianaFormulas_BP_C_ArmTime");
static_assert(offsetof(IndianaFormulas_BP_C_ArmTime, ExactTrapDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_ArmTime::ExactTrapDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ArmTime, PlayerEngineeringSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_ArmTime::PlayerEngineeringSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ArmTime, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_ArmTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ArmTime, CallFunc_TrapToughness_ReturnValue) == 0x000009, "Member 'IndianaFormulas_BP_C_ArmTime::CallFunc_TrapToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_ArmTime, CallFunc_Multiply_ByteByte_ReturnValue) == 0x00000A, "Member 'IndianaFormulas_BP_C_ArmTime::CallFunc_Multiply_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.DisarmTime
// 0x000C (0x000C - 0x0000)
struct IndianaFormulas_BP_C_DisarmTime final
{
public:
	uint8                                         ExactTrapDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerEngineeringSkill;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_TrapToughness_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Multiply_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_DisarmTime) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_DisarmTime");
static_assert(sizeof(IndianaFormulas_BP_C_DisarmTime) == 0x00000C, "Wrong size on IndianaFormulas_BP_C_DisarmTime");
static_assert(offsetof(IndianaFormulas_BP_C_DisarmTime, ExactTrapDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_DisarmTime::ExactTrapDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_DisarmTime, PlayerEngineeringSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_DisarmTime::PlayerEngineeringSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_DisarmTime, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_DisarmTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_DisarmTime, CallFunc_TrapToughness_ReturnValue) == 0x000009, "Member 'IndianaFormulas_BP_C_DisarmTime::CallFunc_TrapToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_DisarmTime, CallFunc_Multiply_ByteByte_ReturnValue) == 0x00000A, "Member 'IndianaFormulas_BP_C_DisarmTime::CallFunc_Multiply_ByteByte_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.TrapArmNoise
// 0x0018 (0x0018 - 0x0000)
struct IndianaFormulas_BP_C_TrapArmNoise final
{
public:
	uint8                                         ExactTrapDifficulty;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerEngineeringSkill;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_TrapToughness_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndianaFormulas_BP_C_TrapArmNoise) == 0x000004, "Wrong alignment on IndianaFormulas_BP_C_TrapArmNoise");
static_assert(sizeof(IndianaFormulas_BP_C_TrapArmNoise) == 0x000018, "Wrong size on IndianaFormulas_BP_C_TrapArmNoise");
static_assert(offsetof(IndianaFormulas_BP_C_TrapArmNoise, ExactTrapDifficulty) == 0x000000, "Member 'IndianaFormulas_BP_C_TrapArmNoise::ExactTrapDifficulty' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapArmNoise, PlayerEngineeringSkill) == 0x000004, "Member 'IndianaFormulas_BP_C_TrapArmNoise::PlayerEngineeringSkill' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapArmNoise, ReturnValue) == 0x000008, "Member 'IndianaFormulas_BP_C_TrapArmNoise::ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapArmNoise, CallFunc_TrapToughness_ReturnValue) == 0x00000C, "Member 'IndianaFormulas_BP_C_TrapArmNoise::CallFunc_TrapToughness_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapArmNoise, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000010, "Member 'IndianaFormulas_BP_C_TrapArmNoise::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndianaFormulas_BP_C_TrapArmNoise, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'IndianaFormulas_BP_C_TrapArmNoise::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function IndianaFormulas_BP.IndianaFormulas_BP_C.TrapDisarmNoise
// 0x0018 (0x0018 - 0x0000)
struct IndianaFormulas_BP_C_TrapDisarmNoise final
{
public:
