#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Indiana

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Indiana_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Indiana.IndianaUserWidget.OnInputDeviceChanged
// 0x0001 (0x0001 - 0x0000)
struct IndianaUserWidget_OnInputDeviceChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_OnInputDeviceChanged) == 0x000001, "Wrong alignment on IndianaUserWidget_OnInputDeviceChanged");
static_assert(sizeof(IndianaUserWidget_OnInputDeviceChanged) == 0x000001, "Wrong size on IndianaUserWidget_OnInputDeviceChanged");
static_assert(offsetof(IndianaUserWidget_OnInputDeviceChanged, bUsingGamepad) == 0x000000, "Member 'IndianaUserWidget_OnInputDeviceChanged::bUsingGamepad' has a wrong offset!");

// Function Indiana.IndianaUserWidget.OnIntro
// 0x0014 (0x0014 - 0x0000)
struct IndianaUserWidget_OnIntro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IndianaUserWidget_OnIntro) == 0x000004, "Wrong alignment on IndianaUserWidget_OnIntro");
static_assert(sizeof(IndianaUserWidget_OnIntro) == 0x000014, "Wrong size on IndianaUserWidget_OnIntro");
static_assert(offsetof(IndianaUserWidget_OnIntro, AnimationCompleteCallback) == 0x000000, "Member 'IndianaUserWidget_OnIntro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_OnIntro, ReturnValue) == 0x000010, "Member 'IndianaUserWidget_OnIntro::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.OnMaximize
// 0x0014 (0x0014 - 0x0000)
struct IndianaUserWidget_OnMaximize final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IndianaUserWidget_OnMaximize) == 0x000004, "Wrong alignment on IndianaUserWidget_OnMaximize");
static_assert(sizeof(IndianaUserWidget_OnMaximize) == 0x000014, "Wrong size on IndianaUserWidget_OnMaximize");
static_assert(offsetof(IndianaUserWidget_OnMaximize, AnimationCompleteCallback) == 0x000000, "Member 'IndianaUserWidget_OnMaximize::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_OnMaximize, ReturnValue) == 0x000010, "Member 'IndianaUserWidget_OnMaximize::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.OnMinimize
// 0x0014 (0x0014 - 0x0000)
struct IndianaUserWidget_OnMinimize final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IndianaUserWidget_OnMinimize) == 0x000004, "Wrong alignment on IndianaUserWidget_OnMinimize");
static_assert(sizeof(IndianaUserWidget_OnMinimize) == 0x000014, "Wrong size on IndianaUserWidget_OnMinimize");
static_assert(offsetof(IndianaUserWidget_OnMinimize, AnimationCompleteCallback) == 0x000000, "Member 'IndianaUserWidget_OnMinimize::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_OnMinimize, ReturnValue) == 0x000010, "Member 'IndianaUserWidget_OnMinimize::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.OnOutro
// 0x0014 (0x0014 - 0x0000)
struct IndianaUserWidget_OnOutro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IndianaUserWidget_OnOutro) == 0x000004, "Wrong alignment on IndianaUserWidget_OnOutro");
static_assert(sizeof(IndianaUserWidget_OnOutro) == 0x000014, "Wrong size on IndianaUserWidget_OnOutro");
static_assert(offsetof(IndianaUserWidget_OnOutro, AnimationCompleteCallback) == 0x000000, "Member 'IndianaUserWidget_OnOutro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_OnOutro, ReturnValue) == 0x000010, "Member 'IndianaUserWidget_OnOutro::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.GetIndianaUI
// 0x0008 (0x0008 - 0x0000)
struct IndianaUserWidget_GetIndianaUI final
{
public:
	class AIndianaUI*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_GetIndianaUI) == 0x000008, "Wrong alignment on IndianaUserWidget_GetIndianaUI");
static_assert(sizeof(IndianaUserWidget_GetIndianaUI) == 0x000008, "Wrong size on IndianaUserWidget_GetIndianaUI");
static_assert(offsetof(IndianaUserWidget_GetIndianaUI, ReturnValue) == 0x000000, "Member 'IndianaUserWidget_GetIndianaUI::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.GetOpenState
// 0x0001 (0x0001 - 0x0000)
struct IndianaUserWidget_GetOpenState final
{
public:
	EWidgetOpenState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_GetOpenState) == 0x000001, "Wrong alignment on IndianaUserWidget_GetOpenState");
static_assert(sizeof(IndianaUserWidget_GetOpenState) == 0x000001, "Wrong size on IndianaUserWidget_GetOpenState");
static_assert(offsetof(IndianaUserWidget_GetOpenState, ReturnValue) == 0x000000, "Member 'IndianaUserWidget_GetOpenState::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.IsMaximized
// 0x0002 (0x0002 - 0x0000)
struct IndianaUserWidget_IsMaximized final
{
public:
	bool                                          bIncludeTransitioning;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_IsMaximized) == 0x000001, "Wrong alignment on IndianaUserWidget_IsMaximized");
static_assert(sizeof(IndianaUserWidget_IsMaximized) == 0x000002, "Wrong size on IndianaUserWidget_IsMaximized");
static_assert(offsetof(IndianaUserWidget_IsMaximized, bIncludeTransitioning) == 0x000000, "Member 'IndianaUserWidget_IsMaximized::bIncludeTransitioning' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_IsMaximized, ReturnValue) == 0x000001, "Member 'IndianaUserWidget_IsMaximized::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.IsMinimized
// 0x0002 (0x0002 - 0x0000)
struct IndianaUserWidget_IsMinimized final
{
public:
	bool                                          bIncludeTransitioning;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_IsMinimized) == 0x000001, "Wrong alignment on IndianaUserWidget_IsMinimized");
static_assert(sizeof(IndianaUserWidget_IsMinimized) == 0x000002, "Wrong size on IndianaUserWidget_IsMinimized");
static_assert(offsetof(IndianaUserWidget_IsMinimized, bIncludeTransitioning) == 0x000000, "Member 'IndianaUserWidget_IsMinimized::bIncludeTransitioning' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_IsMinimized, ReturnValue) == 0x000001, "Member 'IndianaUserWidget_IsMinimized::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.IsShuttingDown
// 0x0002 (0x0002 - 0x0000)
struct IndianaUserWidget_IsShuttingDown final
{
public:
	bool                                          bIncludeTransitioning;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_IsShuttingDown) == 0x000001, "Wrong alignment on IndianaUserWidget_IsShuttingDown");
static_assert(sizeof(IndianaUserWidget_IsShuttingDown) == 0x000002, "Wrong size on IndianaUserWidget_IsShuttingDown");
static_assert(offsetof(IndianaUserWidget_IsShuttingDown, bIncludeTransitioning) == 0x000000, "Member 'IndianaUserWidget_IsShuttingDown::bIncludeTransitioning' has a wrong offset!");
static_assert(offsetof(IndianaUserWidget_IsShuttingDown, ReturnValue) == 0x000001, "Member 'IndianaUserWidget_IsShuttingDown::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaUserWidget.ObjectRefHasReferencers
// 0x0001 (0x0001 - 0x0000)
struct IndianaUserWidget_ObjectRefHasReferencers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaUserWidget_ObjectRefHasReferencers) == 0x000001, "Wrong alignment on IndianaUserWidget_ObjectRefHasReferencers");
static_assert(sizeof(IndianaUserWidget_ObjectRefHasReferencers) == 0x000001, "Wrong size on IndianaUserWidget_ObjectRefHasReferencers");
static_assert(offsetof(IndianaUserWidget_ObjectRefHasReferencers, ReturnValue) == 0x000000, "Member 'IndianaUserWidget_ObjectRefHasReferencers::ReturnValue' has a wrong offset!");

// Function Indiana.AbilityOverviewChildWidget.ModifyPulseScale
// 0x0004 (0x0004 - 0x0000)
struct AbilityOverviewChildWidget_ModifyPulseScale final
{
public:
	float                                         PulseScale;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewChildWidget_ModifyPulseScale) == 0x000004, "Wrong alignment on AbilityOverviewChildWidget_ModifyPulseScale");
static_assert(sizeof(AbilityOverviewChildWidget_ModifyPulseScale) == 0x000004, "Wrong size on AbilityOverviewChildWidget_ModifyPulseScale");
static_assert(offsetof(AbilityOverviewChildWidget_ModifyPulseScale, PulseScale) == 0x000000, "Member 'AbilityOverviewChildWidget_ModifyPulseScale::PulseScale' has a wrong offset!");

// Function Indiana.FPVSkeletalMeshComponent.SetFixedFOVforFPVEnabled
// 0x0001 (0x0001 - 0x0000)
struct FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled final
{
public:
	bool                                          InbFixedFOVEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled) == 0x000001, "Wrong alignment on FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled");
static_assert(sizeof(FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled) == 0x000001, "Wrong size on FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled");
static_assert(offsetof(FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled, InbFixedFOVEnabled) == 0x000000, "Member 'FPVSkeletalMeshComponent_SetFixedFOVforFPVEnabled::InbFixedFOVEnabled' has a wrong offset!");

// Function Indiana.FPVSkeletalMeshComponent.IsFixedFOVEnabled
// 0x0001 (0x0001 - 0x0000)
struct FPVSkeletalMeshComponent_IsFixedFOVEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPVSkeletalMeshComponent_IsFixedFOVEnabled) == 0x000001, "Wrong alignment on FPVSkeletalMeshComponent_IsFixedFOVEnabled");
static_assert(sizeof(FPVSkeletalMeshComponent_IsFixedFOVEnabled) == 0x000001, "Wrong size on FPVSkeletalMeshComponent_IsFixedFOVEnabled");
static_assert(offsetof(FPVSkeletalMeshComponent_IsFixedFOVEnabled, ReturnValue) == 0x000000, "Member 'FPVSkeletalMeshComponent_IsFixedFOVEnabled::ReturnValue' has a wrong offset!");

// Function Indiana.AbilityOverviewDetailWidget.OnAbilityUnlockChange
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewDetailWidget_OnAbilityUnlockChange final
{
public:
	EUnlockAbility                                Ability;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewDetailWidget_OnAbilityUnlockChange) == 0x000001, "Wrong alignment on AbilityOverviewDetailWidget_OnAbilityUnlockChange");
static_assert(sizeof(AbilityOverviewDetailWidget_OnAbilityUnlockChange) == 0x000001, "Wrong size on AbilityOverviewDetailWidget_OnAbilityUnlockChange");
static_assert(offsetof(AbilityOverviewDetailWidget_OnAbilityUnlockChange, Ability) == 0x000000, "Member 'AbilityOverviewDetailWidget_OnAbilityUnlockChange::Ability' has a wrong offset!");

// Function Indiana.CompanionPositionComponent.RequestForceTeleportCompanions
// 0x0018 (0x0018 - 0x0000)
struct CompanionPositionComponent_RequestForceTeleportCompanions final
{
public:
	struct FVector                                Position1;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position2;                                         // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CompanionPositionComponent_RequestForceTeleportCompanions) == 0x000004, "Wrong alignment on CompanionPositionComponent_RequestForceTeleportCompanions");
static_assert(sizeof(CompanionPositionComponent_RequestForceTeleportCompanions) == 0x000018, "Wrong size on CompanionPositionComponent_RequestForceTeleportCompanions");
static_assert(offsetof(CompanionPositionComponent_RequestForceTeleportCompanions, Position1) == 0x000000, "Member 'CompanionPositionComponent_RequestForceTeleportCompanions::Position1' has a wrong offset!");
static_assert(offsetof(CompanionPositionComponent_RequestForceTeleportCompanions, Position2) == 0x00000C, "Member 'CompanionPositionComponent_RequestForceTeleportCompanions::Position2' has a wrong offset!");

// Function Indiana.CompanionPositionComponent.OnOccupiedElevatorChange
// 0x0010 (0x0010 - 0x0000)
struct CompanionPositionComponent_OnOccupiedElevatorChange final
{
public:
	class AElevator*                              Elevator;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOccupied;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CompanionPositionComponent_OnOccupiedElevatorChange) == 0x000008, "Wrong alignment on CompanionPositionComponent_OnOccupiedElevatorChange");
static_assert(sizeof(CompanionPositionComponent_OnOccupiedElevatorChange) == 0x000010, "Wrong size on CompanionPositionComponent_OnOccupiedElevatorChange");
static_assert(offsetof(CompanionPositionComponent_OnOccupiedElevatorChange, Elevator) == 0x000000, "Member 'CompanionPositionComponent_OnOccupiedElevatorChange::Elevator' has a wrong offset!");
static_assert(offsetof(CompanionPositionComponent_OnOccupiedElevatorChange, bOccupied) == 0x000008, "Member 'CompanionPositionComponent_OnOccupiedElevatorChange::bOccupied' has a wrong offset!");

// Function Indiana.CompanionPositionComponent.OnOccupiedElevatorMove
// 0x0008 (0x0008 - 0x0000)
struct CompanionPositionComponent_OnOccupiedElevatorMove final
{
public:
	class AElevator*                              Elevator;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CompanionPositionComponent_OnOccupiedElevatorMove) == 0x000008, "Wrong alignment on CompanionPositionComponent_OnOccupiedElevatorMove");
static_assert(sizeof(CompanionPositionComponent_OnOccupiedElevatorMove) == 0x000008, "Wrong size on CompanionPositionComponent_OnOccupiedElevatorMove");
static_assert(offsetof(CompanionPositionComponent_OnOccupiedElevatorMove, Elevator) == 0x000000, "Member 'CompanionPositionComponent_OnOccupiedElevatorMove::Elevator' has a wrong offset!");

// Function Indiana.CompanionPositionComponent.OnPlayerConversationChange
// 0x0010 (0x0010 - 0x0000)
struct CompanionPositionComponent_OnPlayerConversationChange final
{
public:
	const class UConversationInstance*            Instance;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEntered;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CompanionPositionComponent_OnPlayerConversationChange) == 0x000008, "Wrong alignment on CompanionPositionComponent_OnPlayerConversationChange");
static_assert(sizeof(CompanionPositionComponent_OnPlayerConversationChange) == 0x000010, "Wrong size on CompanionPositionComponent_OnPlayerConversationChange");
static_assert(offsetof(CompanionPositionComponent_OnPlayerConversationChange, Instance) == 0x000000, "Member 'CompanionPositionComponent_OnPlayerConversationChange::Instance' has a wrong offset!");
static_assert(offsetof(CompanionPositionComponent_OnPlayerConversationChange, bEntered) == 0x000008, "Member 'CompanionPositionComponent_OnPlayerConversationChange::bEntered' has a wrong offset!");

// Function Indiana.CompanionPositionComponent.OnStealthChange
// 0x0001 (0x0001 - 0x0000)
struct CompanionPositionComponent_OnStealthChange final
{
public:
	bool                                          bStealthed;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CompanionPositionComponent_OnStealthChange) == 0x000001, "Wrong alignment on CompanionPositionComponent_OnStealthChange");
static_assert(sizeof(CompanionPositionComponent_OnStealthChange) == 0x000001, "Wrong size on CompanionPositionComponent_OnStealthChange");
static_assert(offsetof(CompanionPositionComponent_OnStealthChange, bStealthed) == 0x000000, "Member 'CompanionPositionComponent_OnStealthChange::bStealthed' has a wrong offset!");

// Function Indiana.StatusEffect.ReceiveApplyEffect
// 0x0010 (0x0010 - 0x0000)
struct StatusEffect_ReceiveApplyEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Ratio;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestoredFromSave;                                 // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(StatusEffect_ReceiveApplyEffect) == 0x000008, "Wrong alignment on StatusEffect_ReceiveApplyEffect");
static_assert(sizeof(StatusEffect_ReceiveApplyEffect) == 0x000010, "Wrong size on StatusEffect_ReceiveApplyEffect");
static_assert(offsetof(StatusEffect_ReceiveApplyEffect, Target) == 0x000000, "Member 'StatusEffect_ReceiveApplyEffect::Target' has a wrong offset!");
static_assert(offsetof(StatusEffect_ReceiveApplyEffect, Ratio) == 0x000008, "Member 'StatusEffect_ReceiveApplyEffect::Ratio' has a wrong offset!");
static_assert(offsetof(StatusEffect_ReceiveApplyEffect, bRestoredFromSave) == 0x00000C, "Member 'StatusEffect_ReceiveApplyEffect::bRestoredFromSave' has a wrong offset!");

// Function Indiana.StatusEffect.ReceiveClearEffect
// 0x0008 (0x0008 - 0x0000)
struct StatusEffect_ReceiveClearEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StatusEffect_ReceiveClearEffect) == 0x000008, "Wrong alignment on StatusEffect_ReceiveClearEffect");
static_assert(sizeof(StatusEffect_ReceiveClearEffect) == 0x000008, "Wrong size on StatusEffect_ReceiveClearEffect");
static_assert(offsetof(StatusEffect_ReceiveClearEffect, Target) == 0x000000, "Member 'StatusEffect_ReceiveClearEffect::Target' has a wrong offset!");

// Function Indiana.StatusEffect.GetStatusEffectOriginActor
// 0x0008 (0x0008 - 0x0000)
struct StatusEffect_GetStatusEffectOriginActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StatusEffect_GetStatusEffectOriginActor) == 0x000008, "Wrong alignment on StatusEffect_GetStatusEffectOriginActor");
static_assert(sizeof(StatusEffect_GetStatusEffectOriginActor) == 0x000008, "Wrong size on StatusEffect_GetStatusEffectOriginActor");
static_assert(offsetof(StatusEffect_GetStatusEffectOriginActor, ReturnValue) == 0x000000, "Member 'StatusEffect_GetStatusEffectOriginActor::ReturnValue' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnAbilityCooldownEnded
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewWidget_OnAbilityCooldownEnded final
{
public:
	EAbilityPosition                              AbilityPosition;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnAbilityCooldownEnded) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnAbilityCooldownEnded");
static_assert(sizeof(AbilityOverviewWidget_OnAbilityCooldownEnded) == 0x000001, "Wrong size on AbilityOverviewWidget_OnAbilityCooldownEnded");
static_assert(offsetof(AbilityOverviewWidget_OnAbilityCooldownEnded, AbilityPosition) == 0x000000, "Member 'AbilityOverviewWidget_OnAbilityCooldownEnded::AbilityPosition' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnAbilityCooldownFinished
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewWidget_OnAbilityCooldownFinished final
{
public:
	EAbilityPosition                              AbillityPosition;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnAbilityCooldownFinished) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnAbilityCooldownFinished");
static_assert(sizeof(AbilityOverviewWidget_OnAbilityCooldownFinished) == 0x000001, "Wrong size on AbilityOverviewWidget_OnAbilityCooldownFinished");
static_assert(offsetof(AbilityOverviewWidget_OnAbilityCooldownFinished, AbillityPosition) == 0x000000, "Member 'AbilityOverviewWidget_OnAbilityCooldownFinished::AbillityPosition' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnAbilityCooldownStarted
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewWidget_OnAbilityCooldownStarted final
{
public:
	EAbilityPosition                              AbilityPosition;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnAbilityCooldownStarted) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnAbilityCooldownStarted");
static_assert(sizeof(AbilityOverviewWidget_OnAbilityCooldownStarted) == 0x000001, "Wrong size on AbilityOverviewWidget_OnAbilityCooldownStarted");
static_assert(offsetof(AbilityOverviewWidget_OnAbilityCooldownStarted, AbilityPosition) == 0x000000, "Member 'AbilityOverviewWidget_OnAbilityCooldownStarted::AbilityPosition' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnAbilityCooldownTriggered
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewWidget_OnAbilityCooldownTriggered final
{
public:
	EAbilityPosition                              AbilityPosition;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnAbilityCooldownTriggered) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnAbilityCooldownTriggered");
static_assert(sizeof(AbilityOverviewWidget_OnAbilityCooldownTriggered) == 0x000001, "Wrong size on AbilityOverviewWidget_OnAbilityCooldownTriggered");
static_assert(offsetof(AbilityOverviewWidget_OnAbilityCooldownTriggered, AbilityPosition) == 0x000000, "Member 'AbilityOverviewWidget_OnAbilityCooldownTriggered::AbilityPosition' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnAbilityUsed
// 0x0010 (0x0010 - 0x0000)
struct AbilityOverviewWidget_OnAbilityUsed final
{
public:
	class UAbilityOverviewDetailWidget*           Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityPosition                              AbilityPosition;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AbilityOverviewWidget_OnAbilityUsed) == 0x000008, "Wrong alignment on AbilityOverviewWidget_OnAbilityUsed");
static_assert(sizeof(AbilityOverviewWidget_OnAbilityUsed) == 0x000010, "Wrong size on AbilityOverviewWidget_OnAbilityUsed");
static_assert(offsetof(AbilityOverviewWidget_OnAbilityUsed, Widget) == 0x000000, "Member 'AbilityOverviewWidget_OnAbilityUsed::Widget' has a wrong offset!");
static_assert(offsetof(AbilityOverviewWidget_OnAbilityUsed, AbilityPosition) == 0x000008, "Member 'AbilityOverviewWidget_OnAbilityUsed::AbilityPosition' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnCommandButtonPressed
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewWidget_OnCommandButtonPressed final
{
public:
	EAbilityPosition                              AbillityPosition;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnCommandButtonPressed) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnCommandButtonPressed");
static_assert(sizeof(AbilityOverviewWidget_OnCommandButtonPressed) == 0x000001, "Wrong size on AbilityOverviewWidget_OnCommandButtonPressed");
static_assert(offsetof(AbilityOverviewWidget_OnCommandButtonPressed, AbillityPosition) == 0x000000, "Member 'AbilityOverviewWidget_OnCommandButtonPressed::AbillityPosition' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnCompanionAbilityBindingModeChanged
// 0x0004 (0x0004 - 0x0000)
struct AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged final
{
public:
	int32                                         ModeIn;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged) == 0x000004, "Wrong alignment on AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged");
static_assert(sizeof(AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged) == 0x000004, "Wrong size on AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged");
static_assert(offsetof(AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged, ModeIn) == 0x000000, "Member 'AbilityOverviewWidget_OnCompanionAbilityBindingModeChanged::ModeIn' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnCompanionAbilityModeChanged
// 0x0004 (0x0004 - 0x0000)
struct AbilityOverviewWidget_OnCompanionAbilityModeChanged final
{
public:
	int32                                         ModeIn;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnCompanionAbilityModeChanged) == 0x000004, "Wrong alignment on AbilityOverviewWidget_OnCompanionAbilityModeChanged");
static_assert(sizeof(AbilityOverviewWidget_OnCompanionAbilityModeChanged) == 0x000004, "Wrong size on AbilityOverviewWidget_OnCompanionAbilityModeChanged");
static_assert(offsetof(AbilityOverviewWidget_OnCompanionAbilityModeChanged, ModeIn) == 0x000000, "Member 'AbilityOverviewWidget_OnCompanionAbilityModeChanged::ModeIn' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnHUDModeChanged
// 0x0004 (0x0004 - 0x0000)
struct AbilityOverviewWidget_OnHUDModeChanged final
{
public:
	int32                                         ModeIn;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnHUDModeChanged) == 0x000004, "Wrong alignment on AbilityOverviewWidget_OnHUDModeChanged");
static_assert(sizeof(AbilityOverviewWidget_OnHUDModeChanged) == 0x000004, "Wrong size on AbilityOverviewWidget_OnHUDModeChanged");
static_assert(offsetof(AbilityOverviewWidget_OnHUDModeChanged, ModeIn) == 0x000000, "Member 'AbilityOverviewWidget_OnHUDModeChanged::ModeIn' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnHUDVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct AbilityOverviewWidget_OnHUDVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnHUDVisibilityChanged) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnHUDVisibilityChanged");
static_assert(sizeof(AbilityOverviewWidget_OnHUDVisibilityChanged) == 0x000001, "Wrong size on AbilityOverviewWidget_OnHUDVisibilityChanged");
static_assert(offsetof(AbilityOverviewWidget_OnHUDVisibilityChanged, bVisible) == 0x000000, "Member 'AbilityOverviewWidget_OnHUDVisibilityChanged::bVisible' has a wrong offset!");

// Function Indiana.AbilityOverviewWidget.OnPlayerCombatStateChange
// 0x0002 (0x0002 - 0x0000)
struct AbilityOverviewWidget_OnPlayerCombatStateChange final
{
public:
	bool                                          IsPlayerInCombat;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestoring;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityOverviewWidget_OnPlayerCombatStateChange) == 0x000001, "Wrong alignment on AbilityOverviewWidget_OnPlayerCombatStateChange");
static_assert(sizeof(AbilityOverviewWidget_OnPlayerCombatStateChange) == 0x000002, "Wrong size on AbilityOverviewWidget_OnPlayerCombatStateChange");
static_assert(offsetof(AbilityOverviewWidget_OnPlayerCombatStateChange, IsPlayerInCombat) == 0x000000, "Member 'AbilityOverviewWidget_OnPlayerCombatStateChange::IsPlayerInCombat' has a wrong offset!");
static_assert(offsetof(AbilityOverviewWidget_OnPlayerCombatStateChange, bRestoring) == 0x000001, "Member 'AbilityOverviewWidget_OnPlayerCombatStateChange::bRestoring' has a wrong offset!");

// Function Indiana.AchievementsManager.CompleteAchievementBP
// 0x0008 (0x0008 - 0x0000)
struct AchievementsManager_CompleteAchievementBP final
{
public:
	const class UAchievementDataAsset*            Achievement;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_CompleteAchievementBP) == 0x000008, "Wrong alignment on AchievementsManager_CompleteAchievementBP");
static_assert(sizeof(AchievementsManager_CompleteAchievementBP) == 0x000008, "Wrong size on AchievementsManager_CompleteAchievementBP");
static_assert(offsetof(AchievementsManager_CompleteAchievementBP, Achievement) == 0x000000, "Member 'AchievementsManager_CompleteAchievementBP::Achievement' has a wrong offset!");

// Function Indiana.AchievementsManager.CompleteAchievement
// 0x0008 (0x0008 - 0x0000)
struct AchievementsManager_CompleteAchievement final
{
public:
	class FName                                   AchievementBPName;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_CompleteAchievement) == 0x000004, "Wrong alignment on AchievementsManager_CompleteAchievement");
static_assert(sizeof(AchievementsManager_CompleteAchievement) == 0x000008, "Wrong size on AchievementsManager_CompleteAchievement");
static_assert(offsetof(AchievementsManager_CompleteAchievement, AchievementBPName) == 0x000000, "Member 'AchievementsManager_CompleteAchievement::AchievementBPName' has a wrong offset!");

// Function Indiana.AchievementsManager.IncrementAchievement
// 0x000C (0x000C - 0x0000)
struct AchievementsManager_IncrementAchievement final
{
public:
	class FName                                   AchievementBPName;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_IncrementAchievement) == 0x000004, "Wrong alignment on AchievementsManager_IncrementAchievement");
static_assert(sizeof(AchievementsManager_IncrementAchievement) == 0x00000C, "Wrong size on AchievementsManager_IncrementAchievement");
static_assert(offsetof(AchievementsManager_IncrementAchievement, AchievementBPName) == 0x000000, "Member 'AchievementsManager_IncrementAchievement::AchievementBPName' has a wrong offset!");
static_assert(offsetof(AchievementsManager_IncrementAchievement, Count) == 0x000008, "Member 'AchievementsManager_IncrementAchievement::Count' has a wrong offset!");

// Function Indiana.AchievementsManager.OnActiveUserChanged
// 0x0001 (0x0001 - 0x0000)
struct AchievementsManager_OnActiveUserChanged final
{
public:
	EActiveUserChangeType                         ChangeType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_OnActiveUserChanged) == 0x000001, "Wrong alignment on AchievementsManager_OnActiveUserChanged");
static_assert(sizeof(AchievementsManager_OnActiveUserChanged) == 0x000001, "Wrong size on AchievementsManager_OnActiveUserChanged");
static_assert(offsetof(AchievementsManager_OnActiveUserChanged, ChangeType) == 0x000000, "Member 'AchievementsManager_OnActiveUserChanged::ChangeType' has a wrong offset!");

// Function Indiana.AchievementsManager.OnItemEquipped
// 0x0008 (0x0008 - 0x0000)
struct AchievementsManager_OnItemEquipped final
{
public:
	class UItem*                                  Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_OnItemEquipped) == 0x000008, "Wrong alignment on AchievementsManager_OnItemEquipped");
static_assert(sizeof(AchievementsManager_OnItemEquipped) == 0x000008, "Wrong size on AchievementsManager_OnItemEquipped");
static_assert(offsetof(AchievementsManager_OnItemEquipped, Item) == 0x000000, "Member 'AchievementsManager_OnItemEquipped::Item' has a wrong offset!");

// Function Indiana.AchievementsManager.OnKillPreDeath
// 0x0008 (0x0008 - 0x0000)
struct AchievementsManager_OnKillPreDeath final
{
public:
	class AActor*                                 Victim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_OnKillPreDeath) == 0x000008, "Wrong alignment on AchievementsManager_OnKillPreDeath");
static_assert(sizeof(AchievementsManager_OnKillPreDeath) == 0x000008, "Wrong size on AchievementsManager_OnKillPreDeath");
static_assert(offsetof(AchievementsManager_OnKillPreDeath, Victim) == 0x000000, "Member 'AchievementsManager_OnKillPreDeath::Victim' has a wrong offset!");

// Function Indiana.AchievementsManager.OnWeaponSlotted
// 0x0008 (0x0008 - 0x0000)
struct AchievementsManager_OnWeaponSlotted final
{
public:
	class UItem*                                  Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementsManager_OnWeaponSlotted) == 0x000008, "Wrong alignment on AchievementsManager_OnWeaponSlotted");
static_assert(sizeof(AchievementsManager_OnWeaponSlotted) == 0x000008, "Wrong size on AchievementsManager_OnWeaponSlotted");
static_assert(offsetof(AchievementsManager_OnWeaponSlotted, Item) == 0x000000, "Member 'AchievementsManager_OnWeaponSlotted::Item' has a wrong offset!");

// Function Indiana.IndianaAnimInstance.Montage_SkipToEnd
// 0x0010 (0x0010 - 0x0000)
struct IndianaAnimInstance_Montage_SkipToEnd final
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(IndianaAnimInstance_Montage_SkipToEnd) == 0x000008, "Wrong alignment on IndianaAnimInstance_Montage_SkipToEnd");
static_assert(sizeof(IndianaAnimInstance_Montage_SkipToEnd) == 0x000010, "Wrong size on IndianaAnimInstance_Montage_SkipToEnd");
static_assert(offsetof(IndianaAnimInstance_Montage_SkipToEnd, MontageToPlay) == 0x000000, "Member 'IndianaAnimInstance_Montage_SkipToEnd::MontageToPlay' has a wrong offset!");
static_assert(offsetof(IndianaAnimInstance_Montage_SkipToEnd, ReturnValue) == 0x000008, "Member 'IndianaAnimInstance_Montage_SkipToEnd::ReturnValue' has a wrong offset!");

// Function Indiana.CharacterAnimInstance.OnMovementLanded
// 0x0004 (0x0004 - 0x0000)
struct CharacterAnimInstance_OnMovementLanded final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterAnimInstance_OnMovementLanded) == 0x000004, "Wrong alignment on CharacterAnimInstance_OnMovementLanded");
static_assert(sizeof(CharacterAnimInstance_OnMovementLanded) == 0x000004, "Wrong size on CharacterAnimInstance_OnMovementLanded");
static_assert(offsetof(CharacterAnimInstance_OnMovementLanded, Distance) == 0x000000, "Member 'CharacterAnimInstance_OnMovementLanded::Distance' has a wrong offset!");

// Function Indiana.CharacterAnimInstance.OnNewLocomotionAnimationSet
// 0x0008 (0x0008 - 0x0000)
struct CharacterAnimInstance_OnNewLocomotionAnimationSet final
{
public:
	class ULocomotionAnimationSet*                NewLocomtionAnimationSet;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterAnimInstance_OnNewLocomotionAnimationSet) == 0x000008, "Wrong alignment on CharacterAnimInstance_OnNewLocomotionAnimationSet");
static_assert(sizeof(CharacterAnimInstance_OnNewLocomotionAnimationSet) == 0x000008, "Wrong size on CharacterAnimInstance_OnNewLocomotionAnimationSet");
static_assert(offsetof(CharacterAnimInstance_OnNewLocomotionAnimationSet, NewLocomtionAnimationSet) == 0x000000, "Member 'CharacterAnimInstance_OnNewLocomotionAnimationSet::NewLocomtionAnimationSet' has a wrong offset!");

// Function Indiana.CharacterAnimInstance.OnNewWeaponAnimations
// 0x0008 (0x0008 - 0x0000)
struct CharacterAnimInstance_OnNewWeaponAnimations final
{
public:
	class UWeaponAnimations*                      NewWeaponAnimations;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterAnimInstance_OnNewWeaponAnimations) == 0x000008, "Wrong alignment on CharacterAnimInstance_OnNewWeaponAnimations");
static_assert(sizeof(CharacterAnimInstance_OnNewWeaponAnimations) == 0x000008, "Wrong size on CharacterAnimInstance_OnNewWeaponAnimations");
static_assert(offsetof(CharacterAnimInstance_OnNewWeaponAnimations, NewWeaponAnimations) == 0x000000, "Member 'CharacterAnimInstance_OnNewWeaponAnimations::NewWeaponAnimations' has a wrong offset!");

// Function Indiana.CharacterAnimInstance.SetDisabledAnimation
// 0x0010 (0x0010 - 0x0000)
struct CharacterAnimInstance_SetDisabledAnimation final
{
public:
	struct FAnimEventGameplayTagContainer         Container;                                         // 0x0000(0x0010)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterAnimInstance_SetDisabledAnimation) == 0x000008, "Wrong alignment on CharacterAnimInstance_SetDisabledAnimation");
static_assert(sizeof(CharacterAnimInstance_SetDisabledAnimation) == 0x000010, "Wrong size on CharacterAnimInstance_SetDisabledAnimation");
static_assert(offsetof(CharacterAnimInstance_SetDisabledAnimation, Container) == 0x000000, "Member 'CharacterAnimInstance_SetDisabledAnimation::Container' has a wrong offset!");

// Function Indiana.CharacterAnimInstance.IsMontagePlayingOnSlot
// 0x000C (0x000C - 0x0000)
struct CharacterAnimInstance_IsMontagePlayingOnSlot final
{
public:
	class FName                                   SlotNodeName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CharacterAnimInstance_IsMontagePlayingOnSlot) == 0x000004, "Wrong alignment on CharacterAnimInstance_IsMontagePlayingOnSlot");
static_assert(sizeof(CharacterAnimInstance_IsMontagePlayingOnSlot) == 0x00000C, "Wrong size on CharacterAnimInstance_IsMontagePlayingOnSlot");
static_assert(offsetof(CharacterAnimInstance_IsMontagePlayingOnSlot, SlotNodeName) == 0x000000, "Member 'CharacterAnimInstance_IsMontagePlayingOnSlot::SlotNodeName' has a wrong offset!");
static_assert(offsetof(CharacterAnimInstance_IsMontagePlayingOnSlot, ReturnValue) == 0x000008, "Member 'CharacterAnimInstance_IsMontagePlayingOnSlot::ReturnValue' has a wrong offset!");

// Function Indiana.FPVAnimInstance.OnHeadbobbingChanged
// 0x0001 (0x0001 - 0x0000)
struct FPVAnimInstance_OnHeadbobbingChanged final
{
public:
	bool                                          bShouldHeadbob;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPVAnimInstance_OnHeadbobbingChanged) == 0x000001, "Wrong alignment on FPVAnimInstance_OnHeadbobbingChanged");
static_assert(sizeof(FPVAnimInstance_OnHeadbobbingChanged) == 0x000001, "Wrong size on FPVAnimInstance_OnHeadbobbingChanged");
static_assert(offsetof(FPVAnimInstance_OnHeadbobbingChanged, bShouldHeadbob) == 0x000000, "Member 'FPVAnimInstance_OnHeadbobbingChanged::bShouldHeadbob' has a wrong offset!");

// Function Indiana.FPVAnimInstance.GetHeadbobWeight
// 0x0004 (0x0004 - 0x0000)
struct FPVAnimInstance_GetHeadbobWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPVAnimInstance_GetHeadbobWeight) == 0x000004, "Wrong alignment on FPVAnimInstance_GetHeadbobWeight");
static_assert(sizeof(FPVAnimInstance_GetHeadbobWeight) == 0x000004, "Wrong size on FPVAnimInstance_GetHeadbobWeight");
static_assert(offsetof(FPVAnimInstance_GetHeadbobWeight, ReturnValue) == 0x000000, "Member 'FPVAnimInstance_GetHeadbobWeight::ReturnValue' has a wrong offset!");

// Function Indiana.FPVAnimInstance.IsAimTransitioning
// 0x0001 (0x0001 - 0x0000)
struct FPVAnimInstance_IsAimTransitioning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPVAnimInstance_IsAimTransitioning) == 0x000001, "Wrong alignment on FPVAnimInstance_IsAimTransitioning");
static_assert(sizeof(FPVAnimInstance_IsAimTransitioning) == 0x000001, "Wrong size on FPVAnimInstance_IsAimTransitioning");
static_assert(offsetof(FPVAnimInstance_IsAimTransitioning, ReturnValue) == 0x000000, "Member 'FPVAnimInstance_IsAimTransitioning::ReturnValue' has a wrong offset!");

// Function Indiana.IndianaInterfaceUserWidget.SetCursorVisible
// 0x0001 (0x0001 - 0x0000)
struct IndianaInterfaceUserWidget_SetCursorVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IndianaInterfaceUserWidget_SetCursorVisible) == 0x000001, "Wrong alignment on IndianaInterfaceUserWidget_SetCursorVisible");
static_assert(sizeof(IndianaInterfaceUserWidget_SetCursorVisible) == 0x000001, "Wrong size on IndianaInterfaceUserWidget_SetCursorVisible");
static_assert(offsetof(IndianaInterfaceUserWidget_SetCursorVisible, bVisible) == 0x000000, "Member 'IndianaInterfaceUserWidget_SetCursorVisible::bVisible' has a wrong offset!");

// Function Indiana.Item.SetNonPlayerOwnership
// 0x0038 (0x0038 - 0x0000)
struct Item_SetNonPlayerOwnership final
{
public:
	TSubclassOf<class UFactionData>               Faction;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemovePlayerOwnership;                            // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Item_SetNonPlayerOwnership) == 0x000008, "Wrong alignment on Item_SetNonPlayerOwnership");
static_assert(sizeof(Item_SetNonPlayerOwnership) == 0x000038, "Wrong size on Item_SetNonPlayerOwnership");
static_assert(offsetof(Item_SetNonPlayerOwnership, Faction) == 0x000000, "Member 'Item_SetNonPlayerOwnership::Faction' has a wrong offset!");
static_assert(offsetof(Item_SetNonPlayerOwnership, Actor) == 0x000008, "Member 'Item_SetNonPlayerOwnership::Actor' has a wrong offset!");
static_assert(offsetof(Item_SetNonPlayerOwnership, bRemovePlayerOwnership) == 0x000030, "Member 'Item_SetNonPlayerOwnership::bRemovePlayerOwnership' has a wrong offset!");

// Function Indiana.Item.SetOwnership
// 0x0038 (0x0038 - 0x0000)
struct Item_SetOwnership final
{
public:
	TSubclassOf<class UFactionData>               Faction;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPlayerOwned;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Item_SetOwnership) == 0x000008, "Wrong alignment on Item_SetOwnership");
static_assert(sizeof(Item_SetOwnership) == 0x000038, "Wrong size on Item_SetOwnership");
static_assert(offsetof(Item_SetOwnership, Faction) == 0x000000, "Member 'Item_SetOwnership::Faction' has a wrong offset!");
static_assert(offsetof(Item_SetOwnership, Actor) == 0x000008, "Member 'Item_SetOwnership::Actor' has a wrong offset!");
static_assert(offsetof(Item_SetOwnership, bInPlayerOwned) == 0x000030, "Member 'Item_SetOwnership::bInPlayerOwned' has a wrong offset!");

// Function Indiana.Item.SetPlayerOwnership
// 0x0001 (0x0001 - 0x0000)
struct Item_SetPlayerOwnership final
{
public:
	bool                                          bRemoveNonPlayerOwnership;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_SetPlayerOwnership) == 0x000001, "Wrong alignment on Item_SetPlayerOwnership");
static_assert(sizeof(Item_SetPlayerOwnership) == 0x000001, "Wrong size on Item_SetPlayerOwnership");
static_assert(offsetof(Item_SetPlayerOwnership, bRemoveNonPlayerOwnership) == 0x000000, "Member 'Item_SetPlayerOwnership::bRemoveNonPlayerOwnership' has a wrong offset!");

// Function Indiana.Item.CanPlayerSafelyTake
// 0x0001 (0x0001 - 0x0000)
struct Item_CanPlayerSafelyTake final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_CanPlayerSafelyTake) == 0x000001, "Wrong alignment on Item_CanPlayerSafelyTake");
static_assert(sizeof(Item_CanPlayerSafelyTake) == 0x000001, "Wrong size on Item_CanPlayerSafelyTake");
static_assert(offsetof(Item_CanPlayerSafelyTake, ReturnValue) == 0x000000, "Member 'Item_CanPlayerSafelyTake::ReturnValue' has a wrong offset!");

// Function Indiana.Item.GetOwningActor
// 0x0028 (0x0028 - 0x0000)
struct Item_GetOwningActor final
{
public:
	TSoftObjectPtr<class AActor>                  ReturnValue;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetOwningActor) == 0x000008, "Wrong alignment on Item_GetOwningActor");
static_assert(sizeof(Item_GetOwningActor) == 0x000028, "Wrong size on Item_GetOwningActor");
static_assert(offsetof(Item_GetOwningActor, ReturnValue) == 0x000000, "Member 'Item_GetOwningActor::ReturnValue' has a wrong offset!");

// Function Indiana.Item.GetOwningFaction
// 0x0008 (0x0008 - 0x0000)
struct Item_GetOwningFaction final
{
public:
	TSubclassOf<class UFactionData>               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetOwningFaction) == 0x000008, "Wrong alignment on Item_GetOwningFaction");
static_assert(sizeof(Item_GetOwningFaction) == 0x000008, "Wrong size on Item_GetOwningFaction");
static_assert(offsetof(Item_GetOwningFaction, ReturnValue) == 0x000000, "Member 'Item_GetOwningFaction::ReturnValue' has a wrong offset!");

// Function Indiana.Item.IsPlayerOwned
// 0x0001 (0x0001 - 0x0000)
struct Item_IsPlayerOwned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_IsPlayerOwned) == 0x000001, "Wrong alignment on Item_IsPlayerOwned");
static_assert(sizeof(Item_IsPlayerOwned) == 0x000001, "Wrong size on Item_IsPlayerOwned");
static_assert(offsetof(Item_IsPlayerOwned, ReturnValue) == 0x000000, "Member 'Item_IsPlayerOwned::ReturnValue' has a wrong offset!");

// Function Indiana.DisguiseMeterWidget.HideDisguiseMeterTip
// 0x0004 (0x0004 - 0x0000)
struct DisguiseMeterWidget_HideDisguiseMeterTip final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DisguiseMeterWidget_HideDisguiseMeterTip) == 0x000004, "Wrong alignment on DisguiseMeterWidget_HideDisguiseMeterTip");
static_assert(sizeof(DisguiseMeterWidget_HideDisguiseMeterTip) == 0x000004, "Wrong size on DisguiseMeterWidget_HideDisguiseMeterTip");
static_assert(offsetof(DisguiseMeterWidget_HideDisguiseMeterTip, StartTime) == 0x000000, "Member 'DisguiseMeterWidget_HideDisguiseMeterTip::StartTime' has a wrong offset!");

// Function Indiana.DisguiseMeterWidget.OnDisguiseEquipped
// 0x0008 (0x0008 - 0x0000)
struct DisguiseMeterWidget_OnDisguiseEquipped final
{
public:
	const class UDisguiseData*                    Disguise;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DisguiseMeterWidget_OnDisguiseEquipped) == 0x000008, "Wrong alignment on DisguiseMeterWidget_OnDisguiseEquipped");
static_assert(sizeof(DisguiseMeterWidget_OnDisguiseEquipped) == 0x000008, "Wrong size on DisguiseMeterWidget_OnDisguiseEquipped");
