#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputLabelHoldSmall_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function InputLabelHoldSmall_BP.InputLabelHoldSmall_BP_C.ExecuteUbergraph_InputLabelHoldSmall_BP
// 0x0028 (0x0028 - 0x0000)
struct InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FillRatio;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Opacity;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Width;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP) == 0x000008, "Wrong alignment on InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP");
static_assert(sizeof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP) == 0x000028, "Wrong size on InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, EntryPoint) == 0x000000, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, K2Node_Event_FillRatio) == 0x000004, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::K2Node_Event_FillRatio' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, K2Node_Event_Opacity) == 0x000008, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::K2Node_Event_Opacity' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000D, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00000E, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00000F, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, K2Node_Event_Width) == 0x000010, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::K2Node_Event_Width' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'InputLabelHoldSmall_BP_C_ExecuteUbergraph_InputLabelHoldSmall_BP::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function InputLabelHoldSmall_BP.InputLabelHoldSmall_BP_C.SetWidth
// 0x0004 (0x0004 - 0x0000)
struct InputLabelHoldSmall_BP_C_SetWidth final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputLabelHoldSmall_BP_C_SetWidth) == 0x000004, "Wrong alignment on InputLabelHoldSmall_BP_C_SetWidth");
static_assert(sizeof(InputLabelHoldSmall_BP_C_SetWidth) == 0x000004, "Wrong size on InputLabelHoldSmall_BP_C_SetWidth");
static_assert(offsetof(InputLabelHoldSmall_BP_C_SetWidth, Width) == 0x000000, "Member 'InputLabelHoldSmall_BP_C_SetWidth::Width' has a wrong offset!");

// Function InputLabelHoldSmall_BP.InputLabelHoldSmall_BP_C.SetRadialFill
// 0x0008 (0x0008 - 0x0000)
struct InputLabelHoldSmall_BP_C_SetRadialFill final
{
public:
	float                                         FillRatio;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Opacity;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputLabelHoldSmall_BP_C_SetRadialFill) == 0x000004, "Wrong alignment on InputLabelHoldSmall_BP_C_SetRadialFill");
static_assert(sizeof(InputLabelHoldSmall_BP_C_SetRadialFill) == 0x000008, "Wrong size on InputLabelHoldSmall_BP_C_SetRadialFill");
static_assert(offsetof(InputLabelHoldSmall_BP_C_SetRadialFill, FillRatio) == 0x000000, "Member 'InputLabelHoldSmall_BP_C_SetRadialFill::FillRatio' has a wrong offset!");
static_assert(offsetof(InputLabelHoldSmall_BP_C_SetRadialFill, Opacity) == 0x000004, "Member 'InputLabelHoldSmall_BP_C_SetRadialFill::Opacity' has a wrong offset!");

}

