#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputLabelHoldSmall_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputLabelHoldSmall_BP.InputLabelHoldSmall_BP_C
// 0x0020 (0x03D8 - 0x03B8)
class UInputLabelHoldSmall_BP_C final : public UInputLabelHoldWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 KeyBackingIcon;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GamepadRadialMaterial;                             // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               KeyRadialMaterial;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InputLabelHoldSmall_BP(int32 EntryPoint);
	void SetWidth(float Width);
	void SetRadialFill(float FillRatio, float Opacity);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputLabelHoldSmall_BP_C">();
	}
	static class UInputLabelHoldSmall_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputLabelHoldSmall_BP_C>();
	}
};
static_assert(alignof(UInputLabelHoldSmall_BP_C) == 0x000008, "Wrong alignment on UInputLabelHoldSmall_BP_C");
static_assert(sizeof(UInputLabelHoldSmall_BP_C) == 0x0003D8, "Wrong size on UInputLabelHoldSmall_BP_C");
static_assert(offsetof(UInputLabelHoldSmall_BP_C, UberGraphFrame) == 0x0003B8, "Member 'UInputLabelHoldSmall_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputLabelHoldSmall_BP_C, KeyBackingIcon) == 0x0003C0, "Member 'UInputLabelHoldSmall_BP_C::KeyBackingIcon' has a wrong offset!");
static_assert(offsetof(UInputLabelHoldSmall_BP_C, GamepadRadialMaterial) == 0x0003C8, "Member 'UInputLabelHoldSmall_BP_C::GamepadRadialMaterial' has a wrong offset!");
static_assert(offsetof(UInputLabelHoldSmall_BP_C, KeyRadialMaterial) == 0x0003D0, "Member 'UInputLabelHoldSmall_BP_C::KeyRadialMaterial' has a wrong offset!");

}

