#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractableFunctionLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InteractableFunctionLibrary.InteractableFunctionLibrary_C.AssignMaterialInstanceBySlotName
// 0x0040 (0x0040 - 0x0000)
struct InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName final
{
public:
	class UStaticMeshComponent*                   MeshComponentIn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MaterialSlotNameIn;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstanceOut;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Out;                                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName) == 0x000008, "Wrong alignment on InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName");
static_assert(sizeof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName) == 0x000040, "Wrong size on InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, MeshComponentIn) == 0x000000, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::MeshComponentIn' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, MaterialSlotNameIn) == 0x000008, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::MaterialSlotNameIn' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, MaterialInstanceOut) == 0x000010, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::MaterialInstanceOut' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, __WorldContext) == 0x000018, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::__WorldContext' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, Out) == 0x000020, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::Out' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, CallFunc_GetMaterialIndex_ReturnValue) == 0x000028, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, CallFunc_GetMaterial_ReturnValue) == 0x000030, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'InteractableFunctionLibrary_C_AssignMaterialInstanceBySlotName::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function InteractableFunctionLibrary.InteractableFunctionLibrary_C.FormatWithObjectName
// 0x0108 (0x0108 - 0x0000)
struct InteractableFunctionLibrary_C_FormatWithObjectName final
{
public:
	class FText                                   Format;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                Object;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractableFunctionLibrary_C_FormatWithObjectName) == 0x000008, "Wrong alignment on InteractableFunctionLibrary_C_FormatWithObjectName");
static_assert(sizeof(InteractableFunctionLibrary_C_FormatWithObjectName) == 0x000108, "Wrong size on InteractableFunctionLibrary_C_FormatWithObjectName");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, Format) == 0x000000, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::Format' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, Object) == 0x000018, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::Object' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, __WorldContext) == 0x000020, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::__WorldContext' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, CallFunc_GetObjectName_ReturnValue) == 0x000068, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, K2Node_MakeArray_Array) == 0x0000D0, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_FormatWithObjectName, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F8, "Member 'InteractableFunctionLibrary_C_FormatWithObjectName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function InteractableFunctionLibrary.InteractableFunctionLibrary_C.SetupCAC
// 0x0058 (0x0058 - 0x0000)
struct InteractableFunctionLibrary_C_SetupCAC final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UOCLComponent*                          OCL;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOCL_CAC_C>            K2Node_DynamicCast_AsOCL_CAC;                      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Setup_Unused;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractableFunctionLibrary_C_SetupCAC) == 0x000008, "Wrong alignment on InteractableFunctionLibrary_C_SetupCAC");
static_assert(sizeof(InteractableFunctionLibrary_C_SetupCAC) == 0x000058, "Wrong size on InteractableFunctionLibrary_C_SetupCAC");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, Array) == 0x000000, "Member 'InteractableFunctionLibrary_C_SetupCAC::Array' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, OCL) == 0x000010, "Member 'InteractableFunctionLibrary_C_SetupCAC::OCL' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, __WorldContext) == 0x000018, "Member 'InteractableFunctionLibrary_C_SetupCAC::__WorldContext' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'InteractableFunctionLibrary_C_SetupCAC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'InteractableFunctionLibrary_C_SetupCAC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'InteractableFunctionLibrary_C_SetupCAC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'InteractableFunctionLibrary_C_SetupCAC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, Temp_int_Array_Index_Variable) == 0x000030, "Member 'InteractableFunctionLibrary_C_SetupCAC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, CallFunc_Array_Get_Item) == 0x000038, "Member 'InteractableFunctionLibrary_C_SetupCAC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, K2Node_DynamicCast_AsOCL_CAC) == 0x000040, "Member 'InteractableFunctionLibrary_C_SetupCAC::K2Node_DynamicCast_AsOCL_CAC' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'InteractableFunctionLibrary_C_SetupCAC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'InteractableFunctionLibrary_C_SetupCAC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_SetupCAC, CallFunc_Setup_Unused) == 0x000052, "Member 'InteractableFunctionLibrary_C_SetupCAC::CallFunc_Setup_Unused' has a wrong offset!");

// Function InteractableFunctionLibrary.InteractableFunctionLibrary_C.UpdateOCLCAC
// 0x0058 (0x0058 - 0x0000)
struct InteractableFunctionLibrary_C_UpdateOCLCAC final
{
public:
	TArray<class AActor*>                         Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsEmpty;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IOCL_CAC_C>            K2Node_DynamicCast_AsOCL_CAC;                      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Update_Unused;                            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InteractableFunctionLibrary_C_UpdateOCLCAC) == 0x000008, "Wrong alignment on InteractableFunctionLibrary_C_UpdateOCLCAC");
static_assert(sizeof(InteractableFunctionLibrary_C_UpdateOCLCAC) == 0x000058, "Wrong size on InteractableFunctionLibrary_C_UpdateOCLCAC");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, Array) == 0x000000, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::Array' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, IsEmpty) == 0x000010, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::IsEmpty' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, __WorldContext) == 0x000018, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::__WorldContext' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, Temp_int_Array_Index_Variable) == 0x000030, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, CallFunc_Array_Get_Item) == 0x000038, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, K2Node_DynamicCast_AsOCL_CAC) == 0x000040, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::K2Node_DynamicCast_AsOCL_CAC' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableFunctionLibrary_C_UpdateOCLCAC, CallFunc_Update_Unused) == 0x000052, "Member 'InteractableFunctionLibrary_C_UpdateOCLCAC::CallFunc_Update_Unused' has a wrong offset!");

}

