#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractableActorBase_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function InteractableActorBase_BP.InteractableActorBase_BP_C.BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature final
{
public:
	struct FInteractionDescription                Description;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature) == 0x000008, "Wrong alignment on InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature");
static_assert(sizeof(InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature) == 0x000028, "Wrong size on InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature");
static_assert(offsetof(InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature, Description) == 0x000000, "Member 'InteractableActorBase_BP_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_InteractComplete__DelegateSignature::Description' has a wrong offset!");

// Function InteractableActorBase_BP.InteractableActorBase_BP_C.ExecuteUbergraph_InteractableActorBase_BP
// 0x0030 (0x0030 - 0x0000)
struct InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractionDescription                K2Node_ComponentBoundEvent_Description;            // 0x0008(0x0028)(ConstParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP) == 0x000008, "Wrong alignment on InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP");
static_assert(sizeof(InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP) == 0x000030, "Wrong size on InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP");
static_assert(offsetof(InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP, EntryPoint) == 0x000000, "Member 'InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP, K2Node_ComponentBoundEvent_Description) == 0x000008, "Member 'InteractableActorBase_BP_C_ExecuteUbergraph_InteractableActorBase_BP::K2Node_ComponentBoundEvent_Description' has a wrong offset!");

// Function InteractableActorBase_BP.InteractableActorBase_BP_C.GetInteractLocString
// 0x0010 (0x0010 - 0x0000)
struct InteractableActorBase_BP_C_GetInteractLocString final
{
public:
	struct FLocString                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FLocString                             Prompt;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InteractableActorBase_BP_C_GetInteractLocString) == 0x000004, "Wrong alignment on InteractableActorBase_BP_C_GetInteractLocString");
static_assert(sizeof(InteractableActorBase_BP_C_GetInteractLocString) == 0x000010, "Wrong size on InteractableActorBase_BP_C_GetInteractLocString");
static_assert(offsetof(InteractableActorBase_BP_C_GetInteractLocString, ReturnValue) == 0x000000, "Member 'InteractableActorBase_BP_C_GetInteractLocString::ReturnValue' has a wrong offset!");
static_assert(offsetof(InteractableActorBase_BP_C_GetInteractLocString, Prompt) == 0x000008, "Member 'InteractableActorBase_BP_C_GetInteractLocString::Prompt' has a wrong offset!");

}

