#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemStage_BP

#include "Basic.hpp"

#include "ActorStage_BP_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ItemStage_BP.ItemStage_BP_C
// 0x0038 (0x03D0 - 0x0398)
class AItemStage_BP_C final : public AActorStage_BP_Base_C
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLightLeft;                                     // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLightRight;                                    // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLightRear;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LightingVolume;                                    // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemStage_BP_C">();
	}
	static class AItemStage_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemStage_BP_C>();
	}
};
static_assert(alignof(AItemStage_BP_C) == 0x000008, "Wrong alignment on AItemStage_BP_C");
static_assert(sizeof(AItemStage_BP_C) == 0x0003D0, "Wrong size on AItemStage_BP_C");
static_assert(offsetof(AItemStage_BP_C, SpotLight) == 0x000398, "Member 'AItemStage_BP_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AItemStage_BP_C, PointLight) == 0x0003A0, "Member 'AItemStage_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(AItemStage_BP_C, Box) == 0x0003A8, "Member 'AItemStage_BP_C::Box' has a wrong offset!");
static_assert(offsetof(AItemStage_BP_C, SpotLightLeft) == 0x0003B0, "Member 'AItemStage_BP_C::SpotLightLeft' has a wrong offset!");
static_assert(offsetof(AItemStage_BP_C, SpotLightRight) == 0x0003B8, "Member 'AItemStage_BP_C::SpotLightRight' has a wrong offset!");
static_assert(offsetof(AItemStage_BP_C, SpotLightRear) == 0x0003C0, "Member 'AItemStage_BP_C::SpotLightRear' has a wrong offset!");
static_assert(offsetof(AItemStage_BP_C, LightingVolume) == 0x0003C8, "Member 'AItemStage_BP_C::LightingVolume' has a wrong offset!");

}

