#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDegradationEntry_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemDegradationEntry_BP.ItemDegradationEntry_BP_C
// 0x0028 (0x0348 - 0x0320)
class UItemDegradationEntry_BP_C final : public UItemDegradationEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SevereDamgeAnim;                                   // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroDamagedAnim;                                  // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 InnerCircle;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OuterCircle;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemDegradationEntry_BP(int32 EntryPoint);
	void KillAllAnims();
	void PlaySevereDamageAnim();
	void PlayIntroDamagedAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemDegradationEntry_BP_C">();
	}
	static class UItemDegradationEntry_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDegradationEntry_BP_C>();
	}
};
static_assert(alignof(UItemDegradationEntry_BP_C) == 0x000008, "Wrong alignment on UItemDegradationEntry_BP_C");
static_assert(sizeof(UItemDegradationEntry_BP_C) == 0x000348, "Wrong size on UItemDegradationEntry_BP_C");
static_assert(offsetof(UItemDegradationEntry_BP_C, UberGraphFrame) == 0x000320, "Member 'UItemDegradationEntry_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemDegradationEntry_BP_C, SevereDamgeAnim) == 0x000328, "Member 'UItemDegradationEntry_BP_C::SevereDamgeAnim' has a wrong offset!");
static_assert(offsetof(UItemDegradationEntry_BP_C, IntroDamagedAnim) == 0x000330, "Member 'UItemDegradationEntry_BP_C::IntroDamagedAnim' has a wrong offset!");
static_assert(offsetof(UItemDegradationEntry_BP_C, InnerCircle) == 0x000338, "Member 'UItemDegradationEntry_BP_C::InnerCircle' has a wrong offset!");
static_assert(offsetof(UItemDegradationEntry_BP_C, OuterCircle) == 0x000340, "Member 'UItemDegradationEntry_BP_C::OuterCircle' has a wrong offset!");

}

