#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCellDragContainer_BP

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.ExecuteUbergraph_ItemCellDragContainer_BP
// 0x01D8 (0x01D8 - 0x0000)
struct ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIndianaDragDropOperation*              K2Node_Event_Operation;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent_2;                       // 0x0058(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation_6;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent_1;                       // 0x00D0(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation_5;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0148(0x0070)(ConstParm)
	class UDragDropOperation*                     K2Node_Event_Operation_4;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIndianaDragDropOperation*              K2Node_Event_Operation_3;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIndianaDragDropOperation*              K2Node_Event_Operation_2;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIndianaDragDropOperation*              K2Node_Event_Operation_1;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP");
static_assert(sizeof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP) == 0x0001D8, "Wrong size on ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, EntryPoint) == 0x000000, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation) == 0x000008, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_MyGeometry) == 0x000020, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_PointerEvent_2) == 0x000058, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_PointerEvent_2' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation_6) == 0x0000C8, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation_6' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_PointerEvent_1) == 0x0000D0, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_PointerEvent_1' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation_5) == 0x000140, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation_5' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_PointerEvent) == 0x000148, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation_4) == 0x0001B8, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation_4' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation_3) == 0x0001C0, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation_3' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation_2) == 0x0001C8, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation_2' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP, K2Node_Event_Operation_1) == 0x0001D0, "Member 'ItemCellDragContainer_BP_C_ExecuteUbergraph_ItemCellDragContainer_BP::K2Node_Event_Operation_1' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragGroupDrop
// 0x0008 (0x0008 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragGroupDrop final
{
public:
	class UIndianaDragDropOperation*              Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragGroupDrop) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragGroupDrop");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragGroupDrop) == 0x000008, "Wrong size on ItemCellDragContainer_BP_C_OnDragGroupDrop");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragGroupDrop, Operation) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragGroupDrop::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragGroupCancelled
// 0x0008 (0x0008 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragGroupCancelled final
{
public:
	class UIndianaDragDropOperation*              Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragGroupCancelled) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragGroupCancelled");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragGroupCancelled) == 0x000008, "Wrong size on ItemCellDragContainer_BP_C_OnDragGroupCancelled");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragGroupCancelled, Operation) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragGroupCancelled::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragConfirmDrop
// 0x0008 (0x0008 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragConfirmDrop final
{
public:
	class UIndianaDragDropOperation*              Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragConfirmDrop) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragConfirmDrop");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragConfirmDrop) == 0x000008, "Wrong size on ItemCellDragContainer_BP_C_OnDragConfirmDrop");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragConfirmDrop, Operation) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragConfirmDrop::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragGroupStarted
// 0x0008 (0x0008 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragGroupStarted final
{
public:
	class UIndianaDragDropOperation*              Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragGroupStarted) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragGroupStarted");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragGroupStarted) == 0x000008, "Wrong size on ItemCellDragContainer_BP_C_OnDragGroupStarted");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragGroupStarted, Operation) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragGroupStarted::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragCancelled
// 0x0078 (0x0078 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragCancelled final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragCancelled) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragCancelled");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragCancelled) == 0x000078, "Wrong size on ItemCellDragContainer_BP_C_OnDragCancelled");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragCancelled, PointerEvent) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragCancelled::PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragCancelled, Operation) == 0x000070, "Member 'ItemCellDragContainer_BP_C_OnDragCancelled::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragLeave
// 0x0078 (0x0078 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragLeave) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragLeave");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragLeave) == 0x000078, "Wrong size on ItemCellDragContainer_BP_C_OnDragLeave");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragLeave, Operation) == 0x000070, "Member 'ItemCellDragContainer_BP_C_OnDragLeave::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnDragEnter
// 0x00B0 (0x00B0 - 0x0000)
struct ItemCellDragContainer_BP_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnDragEnter) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnDragEnter");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnDragEnter) == 0x0000B0, "Wrong size on ItemCellDragContainer_BP_C_OnDragEnter");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'ItemCellDragContainer_BP_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnDragEnter, Operation) == 0x0000A8, "Member 'ItemCellDragContainer_BP_C_OnDragEnter::Operation' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.OnPreviewMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00B8)()
};
static_assert(alignof(ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown");
static_assert(sizeof(ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown) == 0x000218, "Wrong size on ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'ItemCellDragContainer_BP_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function ItemCellDragContainer_BP.ItemCellDragContainer_BP_C.SetPendingDropAnimationEnabled
// 0x0005 (0x0005 - 0x0000)
struct ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled) == 0x000001, "Wrong alignment on ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled");
static_assert(sizeof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled) == 0x000005, "Wrong size on ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled");
static_assert(offsetof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled, Enabled) == 0x000000, "Member 'ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled, Temp_bool_Variable) == 0x000001, "Member 'ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled, Temp_byte_Variable) == 0x000002, "Member 'ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled, Temp_byte_Variable_1) == 0x000003, "Member 'ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled, K2Node_Select_Default) == 0x000004, "Member 'ItemCellDragContainer_BP_C_SetPendingDropAnimationEnabled::K2Node_Select_Default' has a wrong offset!");

}

