#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemViewer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemViewer_BP.ItemViewer_BP_C
// 0x0028 (0x0678 - 0x0650)
class UItemViewer_BP_C final : public UItemViewerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemViewer_BP(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemViewer_BP_C">();
	}
	static class UItemViewer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemViewer_BP_C>();
	}
};
static_assert(alignof(UItemViewer_BP_C) == 0x000008, "Wrong alignment on UItemViewer_BP_C");
static_assert(sizeof(UItemViewer_BP_C) == 0x000678, "Wrong size on UItemViewer_BP_C");
static_assert(offsetof(UItemViewer_BP_C, UberGraphFrame) == 0x000650, "Member 'UItemViewer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemViewer_BP_C, Image_0) == 0x000658, "Member 'UItemViewer_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemViewer_BP_C, Image_1) == 0x000660, "Member 'UItemViewer_BP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UItemViewer_BP_C, Image_2) == 0x000668, "Member 'UItemViewer_BP_C::Image_2' has a wrong offset!");
static_assert(offsetof(UItemViewer_BP_C, Image_3) == 0x000670, "Member 'UItemViewer_BP_C::Image_3' has a wrong offset!");

}

