#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspector_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemInspector_BP.ItemInspector_BP_C.ExecuteUbergraph_ItemInspector_BP
// 0x0008 (0x0008 - 0x0000)
struct ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFullZoom;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP) == 0x000004, "Wrong alignment on ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP");
static_assert(sizeof(ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP) == 0x000008, "Wrong size on ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP");
static_assert(offsetof(ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP, EntryPoint) == 0x000000, "Member 'ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP, K2Node_Event_bFullZoom) == 0x000004, "Member 'ItemInspector_BP_C_ExecuteUbergraph_ItemInspector_BP::K2Node_Event_bFullZoom' has a wrong offset!");

// Function ItemInspector_BP.ItemInspector_BP_C.ZoomToggled
// 0x0001 (0x0001 - 0x0000)
struct ItemInspector_BP_C_ZoomToggled final
{
public:
	bool                                          bFullZoom;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspector_BP_C_ZoomToggled) == 0x000001, "Wrong alignment on ItemInspector_BP_C_ZoomToggled");
static_assert(sizeof(ItemInspector_BP_C_ZoomToggled) == 0x000001, "Wrong size on ItemInspector_BP_C_ZoomToggled");
static_assert(offsetof(ItemInspector_BP_C_ZoomToggled, bFullZoom) == 0x000000, "Member 'ItemInspector_BP_C_ZoomToggled::bFullZoom' has a wrong offset!");

}

