#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemContainer_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemContainer_BP.ItemContainer_BP_C
// 0x0028 (0x0390 - 0x0368)
class UItemContainer_BP_C final : public UItemContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PlaybackMultiplier;                                // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemContainer_BP(int32 EntryPoint);
	void OnOutroEnd();
	void OnIntroStart();
	void HideContainer();
	void ShowContainer();
	void OnCancelShutdown();
	void Construct();
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnOutro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemContainer_BP_C">();
	}
	static class UItemContainer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemContainer_BP_C>();
	}
};
static_assert(alignof(UItemContainer_BP_C) == 0x000008, "Wrong alignment on UItemContainer_BP_C");
static_assert(sizeof(UItemContainer_BP_C) == 0x000390, "Wrong size on UItemContainer_BP_C");
static_assert(offsetof(UItemContainer_BP_C, UberGraphFrame) == 0x000368, "Member 'UItemContainer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemContainer_BP_C, Outro) == 0x000370, "Member 'UItemContainer_BP_C::Outro' has a wrong offset!");
static_assert(offsetof(UItemContainer_BP_C, Intro) == 0x000378, "Member 'UItemContainer_BP_C::Intro' has a wrong offset!");
static_assert(offsetof(UItemContainer_BP_C, Image_0) == 0x000380, "Member 'UItemContainer_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemContainer_BP_C, PlaybackMultiplier) == 0x000388, "Member 'UItemContainer_BP_C::PlaybackMultiplier' has a wrong offset!");

}

