#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemToolTip_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemToolTip_BP.ItemToolTip_BP_C.ExecuteUbergraph_ItemToolTip_BP
// 0x0004 (0x0004 - 0x0000)
struct ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP) == 0x000004, "Wrong alignment on ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP");
static_assert(sizeof(ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP) == 0x000004, "Wrong size on ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP");
static_assert(offsetof(ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP, EntryPoint) == 0x000000, "Member 'ItemToolTip_BP_C_ExecuteUbergraph_ItemToolTip_BP::EntryPoint' has a wrong offset!");

// Function ItemToolTip_BP.ItemToolTip_BP_C.OnIntro
// 0x0014 (0x0014 - 0x0000)
struct ItemToolTip_BP_C_OnIntro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemToolTip_BP_C_OnIntro) == 0x000004, "Wrong alignment on ItemToolTip_BP_C_OnIntro");
static_assert(sizeof(ItemToolTip_BP_C_OnIntro) == 0x000014, "Wrong size on ItemToolTip_BP_C_OnIntro");
static_assert(offsetof(ItemToolTip_BP_C_OnIntro, AnimationCompleteCallback) == 0x000000, "Member 'ItemToolTip_BP_C_OnIntro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(ItemToolTip_BP_C_OnIntro, ReturnValue) == 0x000010, "Member 'ItemToolTip_BP_C_OnIntro::ReturnValue' has a wrong offset!");

}

