#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemToolTip_BP

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemToolTip_BP.ItemToolTip_BP_C
// 0x01C8 (0x06C0 - 0x04F8)
class UItemToolTip_BP_C final : public UItemToolTipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BorderBackerImage;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConditionImage;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ValueImage;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WeightImage;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            ScienceBackerBrush;                                // 0x0528(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                            UniqueBackerBrush;                                 // 0x05B0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                            NoBackerBrush;                                     // 0x0638(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_ItemToolTip_BP(int32 EntryPoint);
	void SetBackgroundBrush();
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemToolTip_BP_C">();
	}
	static class UItemToolTip_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemToolTip_BP_C>();
	}
};
static_assert(alignof(UItemToolTip_BP_C) == 0x000008, "Wrong alignment on UItemToolTip_BP_C");
static_assert(sizeof(UItemToolTip_BP_C) == 0x0006C0, "Wrong size on UItemToolTip_BP_C");
static_assert(offsetof(UItemToolTip_BP_C, UberGraphFrame) == 0x0004F8, "Member 'UItemToolTip_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, FadeIn) == 0x000500, "Member 'UItemToolTip_BP_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, BorderBackerImage) == 0x000508, "Member 'UItemToolTip_BP_C::BorderBackerImage' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, ConditionImage) == 0x000510, "Member 'UItemToolTip_BP_C::ConditionImage' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, ValueImage) == 0x000518, "Member 'UItemToolTip_BP_C::ValueImage' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, WeightImage) == 0x000520, "Member 'UItemToolTip_BP_C::WeightImage' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, ScienceBackerBrush) == 0x000528, "Member 'UItemToolTip_BP_C::ScienceBackerBrush' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, UniqueBackerBrush) == 0x0005B0, "Member 'UItemToolTip_BP_C::UniqueBackerBrush' has a wrong offset!");
static_assert(offsetof(UItemToolTip_BP_C, NoBackerBrush) == 0x000638, "Member 'UItemToolTip_BP_C::NoBackerBrush' has a wrong offset!");

}

