#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemContainer_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemContainer_BP.ItemContainer_BP_C.ExecuteUbergraph_ItemContainer_BP
// 0x0040 (0x0040 - 0x0000)
struct ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelativePlaybackTime_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelativePlaybackTime_ReturnValue_1;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP) == 0x000008, "Wrong alignment on ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP");
static_assert(sizeof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP) == 0x000040, "Wrong size on ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, EntryPoint) == 0x000000, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, CallFunc_PauseAnimation_ReturnValue) == 0x000024, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, CallFunc_GetRelativePlaybackTime_ReturnValue) == 0x000028, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::CallFunc_GetRelativePlaybackTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, CallFunc_GetRelativePlaybackTime_ReturnValue_1) == 0x00002C, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::CallFunc_GetRelativePlaybackTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'ItemContainer_BP_C_ExecuteUbergraph_ItemContainer_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function ItemContainer_BP.ItemContainer_BP_C.OnIntro
// 0x0014 (0x0014 - 0x0000)
struct ItemContainer_BP_C_OnIntro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemContainer_BP_C_OnIntro) == 0x000004, "Wrong alignment on ItemContainer_BP_C_OnIntro");
static_assert(sizeof(ItemContainer_BP_C_OnIntro) == 0x000014, "Wrong size on ItemContainer_BP_C_OnIntro");
static_assert(offsetof(ItemContainer_BP_C_OnIntro, AnimationCompleteCallback) == 0x000000, "Member 'ItemContainer_BP_C_OnIntro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_OnIntro, ReturnValue) == 0x000010, "Member 'ItemContainer_BP_C_OnIntro::ReturnValue' has a wrong offset!");

// Function ItemContainer_BP.ItemContainer_BP_C.OnOutro
// 0x0014 (0x0014 - 0x0000)
struct ItemContainer_BP_C_OnOutro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemContainer_BP_C_OnOutro) == 0x000004, "Wrong alignment on ItemContainer_BP_C_OnOutro");
static_assert(sizeof(ItemContainer_BP_C_OnOutro) == 0x000014, "Wrong size on ItemContainer_BP_C_OnOutro");
static_assert(offsetof(ItemContainer_BP_C_OnOutro, AnimationCompleteCallback) == 0x000000, "Member 'ItemContainer_BP_C_OnOutro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(ItemContainer_BP_C_OnOutro, ReturnValue) == 0x000010, "Member 'ItemContainer_BP_C_OnOutro::ReturnValue' has a wrong offset!");

}

