#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JumpFloodComponent_2D

#include "Basic.hpp"

#include "JumpFloodSeedMode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function JumpFloodComponent_2D.JumpFloodComponent_2D_C.Assign Render Targets
// 0x0138 (0x0138 - 0x0000)
struct JumpFloodComponent_2D_C_Assign_Render_Targets final
{
public:
	class UTextureRenderTarget2D*                 RT_A_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT_B_0;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Get_Texture_Size_Size;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RT_Size_Compare_Match;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Loge_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Loge_ReturnValue_1;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(JumpFloodComponent_2D_C_Assign_Render_Targets) == 0x000008, "Wrong alignment on JumpFloodComponent_2D_C_Assign_Render_Targets");
static_assert(sizeof(JumpFloodComponent_2D_C_Assign_Render_Targets) == 0x000138, "Wrong size on JumpFloodComponent_2D_C_Assign_Render_Targets");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, RT_A_0) == 0x000000, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::RT_A_0' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, RT_B_0) == 0x000008, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::RT_B_0' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, K2Node_MakeStruct_IntPoint) == 0x000010, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Get_Texture_Size_Size) == 0x000018, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Get_Texture_Size_Size' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000030, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_RT_Size_Compare_Match) == 0x000060, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_RT_Size_Compare_Match' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Loge_ReturnValue) == 0x000078, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Loge_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, K2Node_MakeStruct_IntPoint_1) == 0x00007C, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Max_ReturnValue) == 0x000084, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000088, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000098, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0000A0, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Loge_ReturnValue_1) == 0x0000B0, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Loge_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000C8, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D0, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_FTrunc_ReturnValue) == 0x0000E0, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000E8, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000F8, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000108, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000118, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Assign_Render_Targets, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000128, "Member 'JumpFloodComponent_2D_C_Assign_Render_Targets::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");

// Function JumpFloodComponent_2D.JumpFloodComponent_2D_C.Allocate Render Targets
// 0x0038 (0x0038 - 0x0000)
struct JumpFloodComponent_2D_C_Allocate_Render_Targets final
{
public:
	class UTexture*                               Seed_Texture_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              OutTexSize;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              SeedSize;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Loge_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Get_Texture_Size_Size;                    // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Loge_ReturnValue_1;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JumpFloodComponent_2D_C_Allocate_Render_Targets) == 0x000008, "Wrong alignment on JumpFloodComponent_2D_C_Allocate_Render_Targets");
static_assert(sizeof(JumpFloodComponent_2D_C_Allocate_Render_Targets) == 0x000038, "Wrong size on JumpFloodComponent_2D_C_Allocate_Render_Targets");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, Seed_Texture_0) == 0x000000, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::Seed_Texture_0' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, OutTexSize) == 0x000008, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::OutTexSize' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, SeedSize) == 0x000010, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::SeedSize' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_Loge_ReturnValue) == 0x000018, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_Loge_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_Get_Texture_Size_Size) == 0x00001C, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_Get_Texture_Size_Size' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_Max_ReturnValue) == 0x000024, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_Loge_ReturnValue_1) == 0x00002C, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_Loge_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Allocate_Render_Targets, CallFunc_FTrunc_ReturnValue) == 0x000034, "Member 'JumpFloodComponent_2D_C_Allocate_Render_Targets::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function JumpFloodComponent_2D.JumpFloodComponent_2D_C.Detect Edges
// 0x0128 (0x0128 - 0x0000)
struct JumpFloodComponent_2D_C_Detect_Edges final
{
public:
	class UTexture*                               Seed_Texture_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJumpFloodSeedMode                            Mode;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Result_RT;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              OutPoint;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJumpFloodSeedMode                            Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_2;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_3;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_4;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JumpFloodComponent_2D_C_Detect_Edges) == 0x000008, "Wrong alignment on JumpFloodComponent_2D_C_Detect_Edges");
static_assert(sizeof(JumpFloodComponent_2D_C_Detect_Edges) == 0x000128, "Wrong size on JumpFloodComponent_2D_C_Detect_Edges");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Seed_Texture_0) == 0x000000, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Seed_Texture_0' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Mode) == 0x000008, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Mode' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Result_RT) == 0x000010, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Result_RT' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, OutPoint) == 0x000018, "Member 'JumpFloodComponent_2D_C_Detect_Edges::OutPoint' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_struct_Variable) == 0x000020, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_struct_Variable_1) == 0x000030, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_byte_Variable) == 0x000040, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Percent_IntInt_ReturnValue) == 0x000048, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000050, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000055, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_BooleanAND_ReturnValue) == 0x000056, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_bool_Variable) == 0x000057, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Percent_IntInt_ReturnValue_2) == 0x00005C, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_struct_Variable_2) == 0x000060, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_int_Variable) == 0x000074, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_struct_Variable_3) == 0x000078, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_struct_Variable_4) == 0x000088, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_int_Variable_1) == 0x000098, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00009C, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000A0, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_Select_Default) == 0x0000A4, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_MakeStruct_LinearColor) == 0x0000B4, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_int_Variable_2) == 0x0000C4, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000C8, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_Select_Default_1) == 0x0000D0, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x0000D8, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_DynamicCast_AsTexture_2D) == 0x0000E8, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_MakeStruct_IntPoint) == 0x0000F4, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0000FC, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000100, "Member 'JumpFloodComponent_2D_C_Detect_Edges::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_MakeStruct_IntPoint_1) == 0x000104, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, Temp_int_Variable_3) == 0x00010C, "Member 'JumpFloodComponent_2D_C_Detect_Edges::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_Select_Default_2) == 0x000110, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_Select_Default_3) == 0x000118, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Detect_Edges, K2Node_Select_Default_4) == 0x000120, "Member 'JumpFloodComponent_2D_C_Detect_Edges::K2Node_Select_Default_4' has a wrong offset!");

// Function JumpFloodComponent_2D.JumpFloodComponent_2D_C.Jump Flood
// 0x0090 (0x0090 - 0x0000)
struct JumpFloodComponent_2D_C_Jump_Flood final
{
public:
	EJumpFloodSeedMode                            Seed_Mode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Seed_Texture_0;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Smoothing_Passes;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Result_RT;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Edge_Smooth_Iteration_Result_RT;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Detect_Edges_Result_RT;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Single_Iteration_Result_RT;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_1;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_2;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JumpFloodComponent_2D_C_Jump_Flood) == 0x000008, "Wrong alignment on JumpFloodComponent_2D_C_Jump_Flood");
static_assert(sizeof(JumpFloodComponent_2D_C_Jump_Flood) == 0x000090, "Wrong size on JumpFloodComponent_2D_C_Jump_Flood");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Seed_Mode) == 0x000000, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Seed_Mode' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Seed_Texture_0) == 0x000008, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Seed_Texture_0' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Smoothing_Passes) == 0x000010, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Smoothing_Passes' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Result_RT) == 0x000018, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Result_RT' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000029, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Temp_int_Variable) == 0x00002C, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000034, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000038, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Edge_Smooth_Iteration_Result_RT) == 0x000048, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Edge_Smooth_Iteration_Result_RT' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000051, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Detect_Edges_Result_RT) == 0x000058, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Detect_Edges_Result_RT' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Temp_bool_Variable) == 0x000061, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Not_PreBool_ReturnValue) == 0x000062, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Single_Iteration_Result_RT) == 0x000068, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Single_Iteration_Result_RT' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, Temp_int_Variable_1) == 0x000070, "Member 'JumpFloodComponent_2D_C_Jump_Flood::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'JumpFloodComponent_2D_C_Jump_Flood::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, K2Node_Select_Default) == 0x000078, "Member 'JumpFloodComponent_2D_C_Jump_Flood::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, K2Node_Select_Default_1) == 0x000080, "Member 'JumpFloodComponent_2D_C_Jump_Flood::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Jump_Flood, K2Node_Select_Default_2) == 0x000088, "Member 'JumpFloodComponent_2D_C_Jump_Flood::K2Node_Select_Default_2' has a wrong offset!");

// Function JumpFloodComponent_2D.JumpFloodComponent_2D_C.Single Iteration
// 0x00C0 (0x00C0 - 0x0000)
struct JumpFloodComponent_2D_C_Single_Iteration final
{
public:
	class UTexture*                               Result_RT;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_4;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_1;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default_2;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default_4;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_Select_Default_5;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_Select_Default_6;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JumpFloodComponent_2D_C_Single_Iteration) == 0x000008, "Wrong alignment on JumpFloodComponent_2D_C_Single_Iteration");
static_assert(sizeof(JumpFloodComponent_2D_C_Single_Iteration) == 0x0000C0, "Wrong size on JumpFloodComponent_2D_C_Single_Iteration");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Result_RT) == 0x000000, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Result_RT' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Temp_int_Variable) == 0x00000C, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Temp_bool_Variable) == 0x000014, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000020, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000024, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000029, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Add_IntInt_ReturnValue_3) == 0x00002C, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Percent_IntInt_ReturnValue_3) == 0x000030, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000034, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000035, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_BooleanAND_ReturnValue_1) == 0x000036, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Temp_int_Variable_1) == 0x000038, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Add_IntInt_ReturnValue_4) == 0x00003C, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, CallFunc_Percent_IntInt_ReturnValue_4) == 0x000040, "Member 'JumpFloodComponent_2D_C_Single_Iteration::CallFunc_Percent_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Temp_int_Variable_2) == 0x000044, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, K2Node_Select_Default) == 0x000048, "Member 'JumpFloodComponent_2D_C_Single_Iteration::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Temp_int_Variable_3) == 0x000050, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, Temp_int_Variable_4) == 0x000054, "Member 'JumpFloodComponent_2D_C_Single_Iteration::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(JumpFloodComponent_2D_C_Single_Iteration, K2Node_Select_Default_1) == 0x000058, "Member 'JumpFloodComponent_2D_C_Single_Iteration::K2Node_Select_Default_1' has a wrong offset!");
