#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JumpFloodComponent_2D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JumpFloodSeedMode_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass JumpFloodComponent_2D.JumpFloodComponent_2D_C
// 0x0078 (0x0158 - 0x00E0)
class UJumpFloodComponent_2D_C final : public UActorComponent
{
public:
	class UTextureRenderTarget2D*                 RT_A;                                              // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT_B;                                              // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Seed_Texture;                                      // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartIndex;                                        // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastIndex;                                         // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SmoothPasses;                                      // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              TwoD_Size;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Find_Edges_Material;                               // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Jump_Step_Material;                                // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Compute_Gradient_Material;                         // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Edge_Smooth_Material;                              // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Find_Edges_MID;                                    // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Jump_Step_MID;                                     // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Compute_Gradient_MID;                              // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Edge_Smooth_MID;                                   // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJumpFloodSeedMode                            SeedMode;                                          // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Assign_Render_Targets(class UTextureRenderTarget2D*& RT_A_0, class UTextureRenderTarget2D*& RT_B_0);
	void Allocate_Render_Targets(class UTexture*& Seed_Texture_0);
	void Detect_Edges(class UTexture*& Seed_Texture_0, EJumpFloodSeedMode Mode, class UTexture** Result_RT);
	void Jump_Flood(EJumpFloodSeedMode Seed_Mode, class UTexture* Seed_Texture_0, int32 Smoothing_Passes, class UTexture** Result_RT);
	void Single_Iteration(class UTexture** Result_RT);
	void Compute_Gradient(class UTexture** Result_RT);
	void Edge_Smooth_Iteration(class UTexture** Result_RT);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JumpFloodComponent_2D_C">();
	}
	static class UJumpFloodComponent_2D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJumpFloodComponent_2D_C>();
	}
};
static_assert(alignof(UJumpFloodComponent_2D_C) == 0x000008, "Wrong alignment on UJumpFloodComponent_2D_C");
static_assert(sizeof(UJumpFloodComponent_2D_C) == 0x000158, "Wrong size on UJumpFloodComponent_2D_C");
static_assert(offsetof(UJumpFloodComponent_2D_C, RT_A) == 0x0000E0, "Member 'UJumpFloodComponent_2D_C::RT_A' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, RT_B) == 0x0000E8, "Member 'UJumpFloodComponent_2D_C::RT_B' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Seed_Texture) == 0x0000F0, "Member 'UJumpFloodComponent_2D_C::Seed_Texture' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, StartIndex) == 0x0000F8, "Member 'UJumpFloodComponent_2D_C::StartIndex' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, CurrentIndex) == 0x0000FC, "Member 'UJumpFloodComponent_2D_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, LastIndex) == 0x000100, "Member 'UJumpFloodComponent_2D_C::LastIndex' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, SmoothPasses) == 0x000104, "Member 'UJumpFloodComponent_2D_C::SmoothPasses' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, TwoD_Size) == 0x000108, "Member 'UJumpFloodComponent_2D_C::TwoD_Size' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Find_Edges_Material) == 0x000110, "Member 'UJumpFloodComponent_2D_C::Find_Edges_Material' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Jump_Step_Material) == 0x000118, "Member 'UJumpFloodComponent_2D_C::Jump_Step_Material' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Compute_Gradient_Material) == 0x000120, "Member 'UJumpFloodComponent_2D_C::Compute_Gradient_Material' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Edge_Smooth_Material) == 0x000128, "Member 'UJumpFloodComponent_2D_C::Edge_Smooth_Material' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Find_Edges_MID) == 0x000130, "Member 'UJumpFloodComponent_2D_C::Find_Edges_MID' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Jump_Step_MID) == 0x000138, "Member 'UJumpFloodComponent_2D_C::Jump_Step_MID' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Compute_Gradient_MID) == 0x000140, "Member 'UJumpFloodComponent_2D_C::Compute_Gradient_MID' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, Edge_Smooth_MID) == 0x000148, "Member 'UJumpFloodComponent_2D_C::Edge_Smooth_MID' has a wrong offset!");
static_assert(offsetof(UJumpFloodComponent_2D_C, SeedMode) == 0x000150, "Member 'UJumpFloodComponent_2D_C::SeedMode' has a wrong offset!");

}

