#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Light_Pulse_Blueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function Light_Pulse_Blueprint.Light_Pulse_Blueprint_C.ExecuteUbergraph_Light_Pulse_Blueprint
// 0x0008 (0x0008 - 0x0000)
struct Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint) == 0x000004, "Wrong alignment on Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint");
static_assert(sizeof(Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint) == 0x000008, "Wrong size on Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint");
static_assert(offsetof(Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint, EntryPoint) == 0x000000, "Member 'Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint, Temp_bool_Variable) == 0x000004, "Member 'Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'Light_Pulse_Blueprint_C_ExecuteUbergraph_Light_Pulse_Blueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

