#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Light_Pulse_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Light_Pulse_Blueprint.Light_Pulse_Blueprint_C
// 0x0020 (0x02F0 - 0x02D0)
class ALight_Pulse_Blueprint_C final : public ASpotLight
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Intensity_395F9B604E07814FD514C398020A57A8; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_395F9B604E07814FD514C398020A57A8; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpotLightIntensity;                                // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Light_Pulse_Blueprint(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Light_Pulse_Blueprint_C">();
	}
	static class ALight_Pulse_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALight_Pulse_Blueprint_C>();
	}
};
static_assert(alignof(ALight_Pulse_Blueprint_C) == 0x000008, "Wrong alignment on ALight_Pulse_Blueprint_C");
static_assert(sizeof(ALight_Pulse_Blueprint_C) == 0x0002F0, "Wrong size on ALight_Pulse_Blueprint_C");
static_assert(offsetof(ALight_Pulse_Blueprint_C, UberGraphFrame) == 0x0002D0, "Member 'ALight_Pulse_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALight_Pulse_Blueprint_C, Timeline_0_Intensity_395F9B604E07814FD514C398020A57A8) == 0x0002D8, "Member 'ALight_Pulse_Blueprint_C::Timeline_0_Intensity_395F9B604E07814FD514C398020A57A8' has a wrong offset!");
static_assert(offsetof(ALight_Pulse_Blueprint_C, Timeline_0__Direction_395F9B604E07814FD514C398020A57A8) == 0x0002DC, "Member 'ALight_Pulse_Blueprint_C::Timeline_0__Direction_395F9B604E07814FD514C398020A57A8' has a wrong offset!");
static_assert(offsetof(ALight_Pulse_Blueprint_C, Timeline_0) == 0x0002E0, "Member 'ALight_Pulse_Blueprint_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ALight_Pulse_Blueprint_C, SpotLightIntensity) == 0x0002E8, "Member 'ALight_Pulse_Blueprint_C::SpotLightIntensity' has a wrong offset!");

}

