#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Max_Comp_Male

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function Max_Comp_Male.Max_Comp_Male_C.ExecuteUbergraph_Max_Comp_Male
// 0x0160 (0x0160 - 0x0000)
struct Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCompanionDied;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Instigator, struct FCauseDamageInfo& CauseDamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bCompanionDied)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_ZoneOwner;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsCurrentMap_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HaveDaysElapsedSinceNamedTimestamp_ReturnValue; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCauseDamageInfo                       K2Node_CustomEvent_CauseDamageInfo;                // 0x0048(0x0110)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue;     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameDifficulty                               CallFunc_GetGameDifficulty_ReturnValue;            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male) == 0x000008, "Wrong alignment on Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male");
static_assert(sizeof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male) == 0x000160, "Wrong size on Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, EntryPoint) == 0x000000, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::EntryPoint' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_CustomEvent_bCompanionDied) == 0x000004, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_CustomEvent_bCompanionDied' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_ComponentBoundEvent_ZoneOwner) == 0x000028, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_ComponentBoundEvent_ZoneOwner' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_K2_IsCurrentMap_ReturnValue) == 0x000030, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_K2_IsCurrentMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_StartConversation_Branches) == 0x000031, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_StartConversation_Branches' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_StartConversation_InstanceID) == 0x000034, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_StartConversation_InstanceID' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_StartConversation_ReturnValue) == 0x000038, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_StartConversation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_K2_HaveDaysElapsedSinceNamedTimestamp_ReturnValue) == 0x000039, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_K2_HaveDaysElapsedSinceNamedTimestamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_CustomEvent_Instigator) == 0x000040, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, K2Node_CustomEvent_CauseDamageInfo) == 0x000048, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::K2Node_CustomEvent_CauseDamageInfo' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_IsCompanionInActiveParty_ReturnValue) == 0x000158, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_IsCompanionInActiveParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_GetGameDifficulty_ReturnValue) == 0x000159, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_GetGameDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00015A, "Member 'Max_Comp_Male_C_ExecuteUbergraph_Max_Comp_Male::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Max_Comp_Male.Max_Comp_Male_C.OnCompanionDismissed_Event_0
// 0x0001 (0x0001 - 0x0000)
struct Max_Comp_Male_C_OnCompanionDismissed_Event_0 final
{
public:
	bool                                          bCompanionDied;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Max_Comp_Male_C_OnCompanionDismissed_Event_0) == 0x000001, "Wrong alignment on Max_Comp_Male_C_OnCompanionDismissed_Event_0");
static_assert(sizeof(Max_Comp_Male_C_OnCompanionDismissed_Event_0) == 0x000001, "Wrong size on Max_Comp_Male_C_OnCompanionDismissed_Event_0");
static_assert(offsetof(Max_Comp_Male_C_OnCompanionDismissed_Event_0, bCompanionDied) == 0x000000, "Member 'Max_Comp_Male_C_OnCompanionDismissed_Event_0::bCompanionDied' has a wrong offset!");

// Function Max_Comp_Male.Max_Comp_Male_C.DEATH_MAX
// 0x0118 (0x0118 - 0x0000)
struct Max_Comp_Male_C_DEATH_MAX final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCauseDamageInfo                       CauseDamageInfo;                                   // 0x0008(0x0110)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Max_Comp_Male_C_DEATH_MAX) == 0x000008, "Wrong alignment on Max_Comp_Male_C_DEATH_MAX");
static_assert(sizeof(Max_Comp_Male_C_DEATH_MAX) == 0x000118, "Wrong size on Max_Comp_Male_C_DEATH_MAX");
static_assert(offsetof(Max_Comp_Male_C_DEATH_MAX, Instigator_0) == 0x000000, "Member 'Max_Comp_Male_C_DEATH_MAX::Instigator_0' has a wrong offset!");
static_assert(offsetof(Max_Comp_Male_C_DEATH_MAX, CauseDamageInfo) == 0x000008, "Member 'Max_Comp_Male_C_DEATH_MAX::CauseDamageInfo' has a wrong offset!");

// Function Max_Comp_Male.Max_Comp_Male_C.BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature final
{
public:
	class AActor*                                 ZoneOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature) == 0x000008, "Wrong alignment on Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature");
static_assert(sizeof(Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature) == 0x000008, "Wrong size on Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature");
static_assert(offsetof(Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature, ZoneOwner) == 0x000000, "Member 'Max_Comp_Male_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature::ZoneOwner' has a wrong offset!");

}

