#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoviePlayer_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MoviePlayer_BP.MoviePlayer_BP_C
// 0x0020 (0x0390 - 0x0370)
class UMoviePlayer_BP_C final : public UMoviePlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SkipFadeOutIn;                                     // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackground1_BP_C*                      Background1_BP;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBG;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MoviePlayer_BP(int32 EntryPoint);
	void InitiateFadeOut();
	void InitiateFadeIn();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MoviePlayer_BP_C">();
	}
	static class UMoviePlayer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePlayer_BP_C>();
	}
};
static_assert(alignof(UMoviePlayer_BP_C) == 0x000008, "Wrong alignment on UMoviePlayer_BP_C");
static_assert(sizeof(UMoviePlayer_BP_C) == 0x000390, "Wrong size on UMoviePlayer_BP_C");
static_assert(offsetof(UMoviePlayer_BP_C, UberGraphFrame) == 0x000370, "Member 'UMoviePlayer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMoviePlayer_BP_C, SkipFadeOutIn) == 0x000378, "Member 'UMoviePlayer_BP_C::SkipFadeOutIn' has a wrong offset!");
static_assert(offsetof(UMoviePlayer_BP_C, Background1_BP) == 0x000380, "Member 'UMoviePlayer_BP_C::Background1_BP' has a wrong offset!");
static_assert(offsetof(UMoviePlayer_BP_C, BlackBG) == 0x000388, "Member 'UMoviePlayer_BP_C::BlackBG' has a wrong offset!");

}

