#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Objective_Beacon

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Objective_Beacon.Objective_Beacon_C
// 0x0020 (0x0308 - 0x02E8)
class AObjective_Beacon_C final : public ABasicMapFloorTrackedActor
{
public:
	class UBillboardComponent*                    Visualizer;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBeaconComponent*                       Beacon;                                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObsidianIDComponent*                   ObsidianID;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Objective_Beacon_C">();
	}
	static class AObjective_Beacon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AObjective_Beacon_C>();
	}
};
static_assert(alignof(AObjective_Beacon_C) == 0x000008, "Wrong alignment on AObjective_Beacon_C");
static_assert(sizeof(AObjective_Beacon_C) == 0x000308, "Wrong size on AObjective_Beacon_C");
static_assert(offsetof(AObjective_Beacon_C, Visualizer) == 0x0002E8, "Member 'AObjective_Beacon_C::Visualizer' has a wrong offset!");
static_assert(offsetof(AObjective_Beacon_C, Beacon) == 0x0002F0, "Member 'AObjective_Beacon_C::Beacon' has a wrong offset!");
static_assert(offsetof(AObjective_Beacon_C, Sphere) == 0x0002F8, "Member 'AObjective_Beacon_C::Sphere' has a wrong offset!");
static_assert(offsetof(AObjective_Beacon_C, ObsidianID) == 0x000300, "Member 'AObjective_Beacon_C::ObsidianID' has a wrong offset!");

}

