#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OCL_CAC

#include "Basic.hpp"


namespace SDK::Params
{

// Function OCL_CAC.OCL_CAC_C.Update
// 0x0002 (0x0002 - 0x0000)
struct OCL_CAC_C_Update final
{
public:
	bool                                          IsEmpty;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Unused;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OCL_CAC_C_Update) == 0x000001, "Wrong alignment on OCL_CAC_C_Update");
static_assert(sizeof(OCL_CAC_C_Update) == 0x000002, "Wrong size on OCL_CAC_C_Update");
static_assert(offsetof(OCL_CAC_C_Update, IsEmpty) == 0x000000, "Member 'OCL_CAC_C_Update::IsEmpty' has a wrong offset!");
static_assert(offsetof(OCL_CAC_C_Update, Unused) == 0x000001, "Member 'OCL_CAC_C_Update::Unused' has a wrong offset!");

// Function OCL_CAC.OCL_CAC_C.Setup
// 0x0010 (0x0010 - 0x0000)
struct OCL_CAC_C_Setup final
{
public:
	class UOCLComponent*                          OCL;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unused;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OCL_CAC_C_Setup) == 0x000008, "Wrong alignment on OCL_CAC_C_Setup");
static_assert(sizeof(OCL_CAC_C_Setup) == 0x000010, "Wrong size on OCL_CAC_C_Setup");
static_assert(offsetof(OCL_CAC_C_Setup, OCL) == 0x000000, "Member 'OCL_CAC_C_Setup::OCL' has a wrong offset!");
static_assert(offsetof(OCL_CAC_C_Setup, Unused) == 0x000008, "Member 'OCL_CAC_C_Setup::Unused' has a wrong offset!");

}

