#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenXRHandTracking

#include "Basic.hpp"

#include "LiveLinkInterface_classes.hpp"
#include "OpenXRHandTracking_structs.hpp"
#include "LiveLink_classes.hpp"


namespace SDK
{

// Class OpenXRHandTracking.LiveLinkOpenXRHandTrackingSourceFactory
// 0x0010 (0x0040 - 0x0030)
class ULiveLinkOpenXRHandTrackingSourceFactory final : public ULiveLinkSourceFactory
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkOpenXRHandTrackingSourceFactory">();
	}
	static class ULiveLinkOpenXRHandTrackingSourceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkOpenXRHandTrackingSourceFactory>();
	}
};
static_assert(alignof(ULiveLinkOpenXRHandTrackingSourceFactory) == 0x000008, "Wrong alignment on ULiveLinkOpenXRHandTrackingSourceFactory");
static_assert(sizeof(ULiveLinkOpenXRHandTrackingSourceFactory) == 0x000040, "Wrong size on ULiveLinkOpenXRHandTrackingSourceFactory");

// Class OpenXRHandTracking.OpenXRHandTrackingLiveLinkRemapAsset
// 0x0058 (0x0088 - 0x0030)
class UOpenXRHandTrackingLiveLinkRemapAsset final : public ULiveLinkRetargetAsset
{
public:
	bool                                          bHasMetacarpals;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetargetRotationOnly;                             // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleX;                                          // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleY;                                          // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleZ;                                          // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuatSwizzleAxisB                             SwizzleW;                                          // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                HandTrackingBoneNameMap;                           // 0x0038(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpenXRHandTrackingLiveLinkRemapAsset">();
	}
	static class UOpenXRHandTrackingLiveLinkRemapAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenXRHandTrackingLiveLinkRemapAsset>();
	}
};
static_assert(alignof(UOpenXRHandTrackingLiveLinkRemapAsset) == 0x000008, "Wrong alignment on UOpenXRHandTrackingLiveLinkRemapAsset");
static_assert(sizeof(UOpenXRHandTrackingLiveLinkRemapAsset) == 0x000088, "Wrong size on UOpenXRHandTrackingLiveLinkRemapAsset");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, bHasMetacarpals) == 0x000030, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::bHasMetacarpals' has a wrong offset!");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, bRetargetRotationOnly) == 0x000031, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::bRetargetRotationOnly' has a wrong offset!");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, SwizzleX) == 0x000032, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::SwizzleX' has a wrong offset!");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, SwizzleY) == 0x000033, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::SwizzleY' has a wrong offset!");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, SwizzleZ) == 0x000034, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::SwizzleZ' has a wrong offset!");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, SwizzleW) == 0x000035, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::SwizzleW' has a wrong offset!");
static_assert(offsetof(UOpenXRHandTrackingLiveLinkRemapAsset, HandTrackingBoneNameMap) == 0x000038, "Member 'UOpenXRHandTrackingLiveLinkRemapAsset::HandTrackingBoneNameMap' has a wrong offset!");

}

