#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PageAnchor2_BP

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PageAnchor2_BP.PageAnchor2_BP_C
// 0x0018 (0x0290 - 0x0278)
class UPageAnchor2_BP_C final : public UUserWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_33;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PageAnchor2_BP_C">();
	}
	static class UPageAnchor2_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPageAnchor2_BP_C>();
	}
};
static_assert(alignof(UPageAnchor2_BP_C) == 0x000008, "Wrong alignment on UPageAnchor2_BP_C");
static_assert(sizeof(UPageAnchor2_BP_C) == 0x000290, "Wrong size on UPageAnchor2_BP_C");
static_assert(offsetof(UPageAnchor2_BP_C, Image_0) == 0x000278, "Member 'UPageAnchor2_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPageAnchor2_BP_C, Image_33) == 0x000280, "Member 'UPageAnchor2_BP_C::Image_33' has a wrong offset!");
static_assert(offsetof(UPageAnchor2_BP_C, Image_46) == 0x000288, "Member 'UPageAnchor2_BP_C::Image_46' has a wrong offset!");

}

