#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PauseMenu

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PauseMenu.PauseMenu_C
// 0x0048 (0x03B8 - 0x0370)
class UPauseMenu_C final : public UPauseMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackground1_BP_C*                      Background1_BP;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         LoadGameText;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         MainMenuText;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         QuitText;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         ResumeText;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         SaveGameText;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavingWidget_BP_C*                     SavingWidget_BP;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         SettingsText;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PauseMenu(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PauseMenu_C">();
	}
	static class UPauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPauseMenu_C>();
	}
};
static_assert(alignof(UPauseMenu_C) == 0x000008, "Wrong alignment on UPauseMenu_C");
static_assert(sizeof(UPauseMenu_C) == 0x0003B8, "Wrong size on UPauseMenu_C");
static_assert(offsetof(UPauseMenu_C, UberGraphFrame) == 0x000370, "Member 'UPauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Background1_BP) == 0x000378, "Member 'UPauseMenu_C::Background1_BP' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, LoadGameText) == 0x000380, "Member 'UPauseMenu_C::LoadGameText' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, MainMenuText) == 0x000388, "Member 'UPauseMenu_C::MainMenuText' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, QuitText) == 0x000390, "Member 'UPauseMenu_C::QuitText' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, ResumeText) == 0x000398, "Member 'UPauseMenu_C::ResumeText' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, SaveGameText) == 0x0003A0, "Member 'UPauseMenu_C::SaveGameText' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, SavingWidget_BP) == 0x0003A8, "Member 'UPauseMenu_C::SavingWidget_BP' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, SettingsText) == 0x0003B0, "Member 'UPauseMenu_C::SettingsText' has a wrong offset!");

}

