#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStats_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerStats_BP.PlayerStats_BP_C
// 0x0018 (0x0360 - 0x0348)
class UPlayerStats_BP_C final : public UPlayerStatsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 XPBarFill;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               XPBarFillMat;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerStats_BP(int32 EntryPoint);
	void SetXPRatio(float XPRatio);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerStats_BP_C">();
	}
	static class UPlayerStats_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerStats_BP_C>();
	}
};
static_assert(alignof(UPlayerStats_BP_C) == 0x000008, "Wrong alignment on UPlayerStats_BP_C");
static_assert(sizeof(UPlayerStats_BP_C) == 0x000360, "Wrong size on UPlayerStats_BP_C");
static_assert(offsetof(UPlayerStats_BP_C, UberGraphFrame) == 0x000348, "Member 'UPlayerStats_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerStats_BP_C, XPBarFill) == 0x000350, "Member 'UPlayerStats_BP_C::XPBarFill' has a wrong offset!");
static_assert(offsetof(UPlayerStats_BP_C, XPBarFillMat) == 0x000358, "Member 'UPlayerStats_BP_C::XPBarFillMat' has a wrong offset!");

}

