#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerTimeDilationComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerTimeDilationComponent.PlayerTimeDilationComponent_C
// 0x0020 (0x01A8 - 0x0188)
class UPlayerTimeDilationComponent_C final : public UTimeDilationComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0188(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          TTD;                                               // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultChromaticAberration;                        // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DynamicTOD_C*                       DynamicTOD;                                        // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChromaticAberrationWasReset;                      // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlayerTimeDilationComponent(int32 EntryPoint);
	void TTD_End(float Duration);
	void ReceiveBeginPlay();
	void TTD_Start();
	void OnTimeDilationEnd();
	void ReceiveTick(float DeltaSeconds);
	void ResetChromaticAberration();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerTimeDilationComponent_C">();
	}
	static class UPlayerTimeDilationComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerTimeDilationComponent_C>();
	}
};
static_assert(alignof(UPlayerTimeDilationComponent_C) == 0x000008, "Wrong alignment on UPlayerTimeDilationComponent_C");
static_assert(sizeof(UPlayerTimeDilationComponent_C) == 0x0001A8, "Wrong size on UPlayerTimeDilationComponent_C");
static_assert(offsetof(UPlayerTimeDilationComponent_C, UberGraphFrame) == 0x000188, "Member 'UPlayerTimeDilationComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerTimeDilationComponent_C, TTD) == 0x000190, "Member 'UPlayerTimeDilationComponent_C::TTD' has a wrong offset!");
static_assert(offsetof(UPlayerTimeDilationComponent_C, DefaultChromaticAberration) == 0x000194, "Member 'UPlayerTimeDilationComponent_C::DefaultChromaticAberration' has a wrong offset!");
static_assert(offsetof(UPlayerTimeDilationComponent_C, DynamicTOD) == 0x000198, "Member 'UPlayerTimeDilationComponent_C::DynamicTOD' has a wrong offset!");
static_assert(offsetof(UPlayerTimeDilationComponent_C, bChromaticAberrationWasReset) == 0x0001A0, "Member 'UPlayerTimeDilationComponent_C::bChromaticAberrationWasReset' has a wrong offset!");

}

