#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestLogEntry_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function QuestLogEntry_BP.QuestLogEntry_BP_C.ExecuteUbergraph_QuestLogEntry_BP
// 0x0070 (0x0070 - 0x0000)
struct QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP) == 0x000008, "Wrong alignment on QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP");
static_assert(sizeof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP) == 0x000070, "Wrong size on QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, EntryPoint) == 0x000000, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, CallFunc_PlayAnimation_ReturnValue_3) == 0x000060, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP, CallFunc_PlayAnimation_ReturnValue_4) == 0x000068, "Member 'QuestLogEntry_BP_C_ExecuteUbergraph_QuestLogEntry_BP::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");

}

