#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestJournalMaster_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestJournalMaster_BP.QuestJournalMaster_BP_C
// 0x0030 (0x04F0 - 0x04C0)
class UQuestJournalMaster_BP_C final : public UQuestJournalWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInQuestImage;                                  // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget;                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundSplitPanelWidget_C*          BackgroundSplitPanelWidget;                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_1;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_2;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestJournalMaster_BP(int32 EntryPoint);
	void OnQuestImageLoaded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestJournalMaster_BP_C">();
	}
	static class UQuestJournalMaster_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestJournalMaster_BP_C>();
	}
};
static_assert(alignof(UQuestJournalMaster_BP_C) == 0x000008, "Wrong alignment on UQuestJournalMaster_BP_C");
static_assert(sizeof(UQuestJournalMaster_BP_C) == 0x0004F0, "Wrong size on UQuestJournalMaster_BP_C");
static_assert(offsetof(UQuestJournalMaster_BP_C, UberGraphFrame) == 0x0004C0, "Member 'UQuestJournalMaster_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestJournalMaster_BP_C, FadeInQuestImage) == 0x0004C8, "Member 'UQuestJournalMaster_BP_C::FadeInQuestImage' has a wrong offset!");
static_assert(offsetof(UQuestJournalMaster_BP_C, BackgroundPanelWidget) == 0x0004D0, "Member 'UQuestJournalMaster_BP_C::BackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(UQuestJournalMaster_BP_C, BackgroundSplitPanelWidget) == 0x0004D8, "Member 'UQuestJournalMaster_BP_C::BackgroundSplitPanelWidget' has a wrong offset!");
static_assert(offsetof(UQuestJournalMaster_BP_C, InvalidationBox_1) == 0x0004E0, "Member 'UQuestJournalMaster_BP_C::InvalidationBox_1' has a wrong offset!");
static_assert(offsetof(UQuestJournalMaster_BP_C, InvalidationBox_2) == 0x0004E8, "Member 'UQuestJournalMaster_BP_C::InvalidationBox_2' has a wrong offset!");

}

