#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestLogEntry_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestLogEntry_BP.QuestLogEntry_BP_C
// 0x0030 (0x0360 - 0x0330)
class UQuestLogEntry_BP_C final : public UQuestLogEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       QuestUpdated;                                      // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutQuestName;                                  // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInQuestName;                                   // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestFail;                                         // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestComplete;                                     // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestLogEntry_BP(int32 EntryPoint);
	void OnQuestUpdateComplete();
	void OnQuestUpdated();
	void FadeInTextAnimComplete();
	void FadeOutTextAnimComplete();
	void FadeOutQuestText();
	void FadeInQuestText();
	void OnQuestFailed();
	void OnQuestCompleted();
	void QuestAnimComplete();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestLogEntry_BP_C">();
	}
	static class UQuestLogEntry_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestLogEntry_BP_C>();
	}
};
static_assert(alignof(UQuestLogEntry_BP_C) == 0x000008, "Wrong alignment on UQuestLogEntry_BP_C");
static_assert(sizeof(UQuestLogEntry_BP_C) == 0x000360, "Wrong size on UQuestLogEntry_BP_C");
static_assert(offsetof(UQuestLogEntry_BP_C, UberGraphFrame) == 0x000330, "Member 'UQuestLogEntry_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestLogEntry_BP_C, QuestUpdated) == 0x000338, "Member 'UQuestLogEntry_BP_C::QuestUpdated' has a wrong offset!");
static_assert(offsetof(UQuestLogEntry_BP_C, FadeOutQuestName) == 0x000340, "Member 'UQuestLogEntry_BP_C::FadeOutQuestName' has a wrong offset!");
static_assert(offsetof(UQuestLogEntry_BP_C, FadeInQuestName) == 0x000348, "Member 'UQuestLogEntry_BP_C::FadeInQuestName' has a wrong offset!");
static_assert(offsetof(UQuestLogEntry_BP_C, QuestFail) == 0x000350, "Member 'UQuestLogEntry_BP_C::QuestFail' has a wrong offset!");
static_assert(offsetof(UQuestLogEntry_BP_C, QuestComplete) == 0x000358, "Member 'UQuestLogEntry_BP_C::QuestComplete' has a wrong offset!");

}

