#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialContextMenu_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RadialContextMenu_BP.RadialContextMenu_BP_C
// 0x0020 (0x0358 - 0x0338)
class URadialContextMenu_BP_C final : public URadialContextMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackSpeed;                                     // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RadialContextMenu_BP(int32 EntryPoint);
	void Construct();
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnOutro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RadialContextMenu_BP_C">();
	}
	static class URadialContextMenu_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadialContextMenu_BP_C>();
	}
};
static_assert(alignof(URadialContextMenu_BP_C) == 0x000008, "Wrong alignment on URadialContextMenu_BP_C");
static_assert(sizeof(URadialContextMenu_BP_C) == 0x000358, "Wrong size on URadialContextMenu_BP_C");
static_assert(offsetof(URadialContextMenu_BP_C, UberGraphFrame) == 0x000338, "Member 'URadialContextMenu_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URadialContextMenu_BP_C, Outro) == 0x000340, "Member 'URadialContextMenu_BP_C::Outro' has a wrong offset!");
static_assert(offsetof(URadialContextMenu_BP_C, Intro) == 0x000348, "Member 'URadialContextMenu_BP_C::Intro' has a wrong offset!");
static_assert(offsetof(URadialContextMenu_BP_C, PlaybackSpeed) == 0x000350, "Member 'URadialContextMenu_BP_C::PlaybackSpeed' has a wrong offset!");

}

