#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RagdollCharacterDeath

#include "Basic.hpp"


namespace SDK::Params
{

// Function RagdollCharacterDeath.RagdollCharacterDeath_C.ExecuteUbergraph_RagdollCharacterDeath
// 0x0028 (0x0028 - 0x0000)
struct RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent_1;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateAshPile_Ash_MID;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath) == 0x000008, "Wrong alignment on RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath");
static_assert(sizeof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath) == 0x000028, "Wrong size on RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath");
static_assert(offsetof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath, EntryPoint) == 0x000000, "Member 'RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath, K2Node_Event_InDeathComponent_1) == 0x000008, "Member 'RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath::K2Node_Event_InDeathComponent_1' has a wrong offset!");
static_assert(offsetof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000010, "Member 'RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath, K2Node_Event_InDeathComponent) == 0x000018, "Member 'RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath::K2Node_Event_InDeathComponent' has a wrong offset!");
static_assert(offsetof(RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath, CallFunc_CreateAshPile_Ash_MID) == 0x000020, "Member 'RagdollCharacterDeath_C_ExecuteUbergraph_RagdollCharacterDeath::CallFunc_CreateAshPile_Ash_MID' has a wrong offset!");

// Function RagdollCharacterDeath.RagdollCharacterDeath_C.ExecuteOnReload
// 0x0008 (0x0008 - 0x0000)
struct RagdollCharacterDeath_C_ExecuteOnReload final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RagdollCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong alignment on RagdollCharacterDeath_C_ExecuteOnReload");
static_assert(sizeof(RagdollCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong size on RagdollCharacterDeath_C_ExecuteOnReload");
static_assert(offsetof(RagdollCharacterDeath_C_ExecuteOnReload, InDeathComponent) == 0x000000, "Member 'RagdollCharacterDeath_C_ExecuteOnReload::InDeathComponent' has a wrong offset!");

// Function RagdollCharacterDeath.RagdollCharacterDeath_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct RagdollCharacterDeath_C_Execute final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RagdollCharacterDeath_C_Execute) == 0x000008, "Wrong alignment on RagdollCharacterDeath_C_Execute");
static_assert(sizeof(RagdollCharacterDeath_C_Execute) == 0x000008, "Wrong size on RagdollCharacterDeath_C_Execute");
static_assert(offsetof(RagdollCharacterDeath_C_Execute, InDeathComponent) == 0x000000, "Member 'RagdollCharacterDeath_C_Execute::InDeathComponent' has a wrong offset!");

}

