#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBT_HoverDrone_AnimBP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CombatEnum_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RBT_HoverDrone_AnimBP.RBT_HoverDrone_AnimBP_C
// 0x1A10 (0x23A0 - 0x0990)
class URBT_HoverDrone_AnimBP_C final : public UHoverbotAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0990(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0998(0x00A0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0A38(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x0A50(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x0A98(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0AE0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x0B28(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0B70(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0CB0(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_1;                    // 0x0CD8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0D68(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0D98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0E18(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0E48(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0EC8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x0EF8(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0FA8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0FF0(0x00A0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x1090(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1120(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1168(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x11B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x11F8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1220(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x12C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x12E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1310(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1338(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1360(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1388(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x13B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x13D8(0x0028)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_1;               // 0x1400(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1488(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed;                 // 0x14B8(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1540(0x0030)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x1570(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x15F0(0x00A0)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x1690(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1710(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1740(0x00B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x17F0(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x18F8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1918(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x19B0(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay;                      // 0x19D8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1A68(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1A98(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1AC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1B40(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1B70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1BF0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1C20(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1CD0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1D00(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1D80(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1DB0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1E60(0x0030)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1E90(0x0198)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2028(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2130(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x2288(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2350(0x0028)()
	class URBT_HoverDrone_WeaponAnimations_C*     WeaponAnimationsBP;                                // 0x2378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECombatEnum                                   CombatEnum;                                        // 0x2380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2381[0x3];                                     // 0x2381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitReactionDirection;                              // 0x2384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionRate;                                   // 0x2388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionType;                                   // 0x238C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionActive;                                 // 0x2390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitFlinchActive;                                   // 0x2394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomIdle;                                        // 0x2398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_RBT_HoverDrone_AnimBP(int32 EntryPoint);
	void AnimNotify_TurnOffRandomIdle();
	void AnimNotify_RandomIdle();
	void OnNewWeaponAnimations(class UWeaponAnimations* NewWeaponAnimations);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBT_HoverDrone_AnimBP_C">();
	}
	static class URBT_HoverDrone_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URBT_HoverDrone_AnimBP_C>();
	}
};
static_assert(alignof(URBT_HoverDrone_AnimBP_C) == 0x000010, "Wrong alignment on URBT_HoverDrone_AnimBP_C");
static_assert(sizeof(URBT_HoverDrone_AnimBP_C) == 0x0023A0, "Wrong size on URBT_HoverDrone_AnimBP_C");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, UberGraphFrame) == 0x000990, "Member 'URBT_HoverDrone_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000998, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x000A38, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_7) == 0x000A50, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_7' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_6) == 0x000A98, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_5) == 0x000AE0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_4) == 0x000B28, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000B70, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_17) == 0x000C10, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x000C38, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x000C60, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x000C88, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x000CB0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_LocomotionPlay_1) == 0x000CD8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_LocomotionPlay_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_10) == 0x000D68, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000D98, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_9) == 0x000E18, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000E48, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_8) == 0x000EC8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateMachine_3) == 0x000EF8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_3) == 0x000FA8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000FF0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_PoseSnapshot) == 0x001090, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_2) == 0x001120, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot_1) == 0x001168, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Slot) == 0x0011B0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0011F8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001220, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x0012C0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x0012E8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x001310, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x001338, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x001360, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x001388, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x0013B0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x0013D8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_RandomSequenceNamed_1) == 0x001400, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_RandomSequenceNamed_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_7) == 0x001488, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_RandomSequenceNamed) == 0x0014B8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_RandomSequenceNamed' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_6) == 0x001540, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_RandomPlayer_1) == 0x001570, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_RandomPlayer_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0015F0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_RandomPlayer) == 0x001690, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_RandomPlayer' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001710, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x001740, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0017F0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0018F8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001918, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x001938, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x001960, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x001988, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0019B0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_LocomotionPlay) == 0x0019D8, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_LocomotionPlay' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_4) == 0x001A68, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TransitionResult) == 0x001A98, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001AC0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_3) == 0x001B40, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001B70, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_2) == 0x001BF0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x001C20, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult_1) == 0x001CD0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001D00, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateResult) == 0x001D80, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_StateMachine) == 0x001DB0, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_Root) == 0x001E60, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001E90, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002028, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002130, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x002288, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x002350, "Member 'URBT_HoverDrone_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, WeaponAnimationsBP) == 0x002378, "Member 'URBT_HoverDrone_AnimBP_C::WeaponAnimationsBP' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, CombatEnum) == 0x002380, "Member 'URBT_HoverDrone_AnimBP_C::CombatEnum' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, HitReactionDirection) == 0x002384, "Member 'URBT_HoverDrone_AnimBP_C::HitReactionDirection' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, HitReactionRate) == 0x002388, "Member 'URBT_HoverDrone_AnimBP_C::HitReactionRate' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, HitReactionType) == 0x00238C, "Member 'URBT_HoverDrone_AnimBP_C::HitReactionType' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, HitReactionActive) == 0x002390, "Member 'URBT_HoverDrone_AnimBP_C::HitReactionActive' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, HitFlinchActive) == 0x002394, "Member 'URBT_HoverDrone_AnimBP_C::HitFlinchActive' has a wrong offset!");
static_assert(offsetof(URBT_HoverDrone_AnimBP_C, RandomIdle) == 0x002398, "Member 'URBT_HoverDrone_AnimBP_C::RandomIdle' has a wrong offset!");

}

