#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBT_HoverDrone_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RBT_HoverDrone_AnimBP.RBT_HoverDrone_AnimBP_C.ExecuteUbergraph_RBT_HoverDrone_AnimBP
// 0x0028 (0x0028 - 0x0000)
struct RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimations*                      K2Node_Event_NewWeaponAnimations;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMontagePlayingOnSlot_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBT_HoverDrone_WeaponAnimations_C*     K2Node_DynamicCast_AsRBT_Hover_Drone_Weapon_Animations; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP) == 0x000008, "Wrong alignment on RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP");
static_assert(sizeof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP) == 0x000028, "Wrong size on RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, EntryPoint) == 0x000000, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, K2Node_Event_NewWeaponAnimations) == 0x000008, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::K2Node_Event_NewWeaponAnimations' has a wrong offset!");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, CallFunc_IsMontagePlayingOnSlot_ReturnValue) == 0x000010, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::CallFunc_IsMontagePlayingOnSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, K2Node_DynamicCast_AsRBT_Hover_Drone_Weapon_Animations) == 0x000018, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::K2Node_DynamicCast_AsRBT_Hover_Drone_Weapon_Animations' has a wrong offset!");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000024, "Member 'RBT_HoverDrone_AnimBP_C_ExecuteUbergraph_RBT_HoverDrone_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function RBT_HoverDrone_AnimBP.RBT_HoverDrone_AnimBP_C.OnNewWeaponAnimations
// 0x0008 (0x0008 - 0x0000)
struct RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations final
{
public:
	class UWeaponAnimations*                      NewWeaponAnimations;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations) == 0x000008, "Wrong alignment on RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations");
static_assert(sizeof(RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations) == 0x000008, "Wrong size on RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations, NewWeaponAnimations) == 0x000000, "Member 'RBT_HoverDrone_AnimBP_C_OnNewWeaponAnimations::NewWeaponAnimations' has a wrong offset!");

// Function RBT_HoverDrone_AnimBP.RBT_HoverDrone_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'RBT_HoverDrone_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function RBT_HoverDrone_AnimBP.RBT_HoverDrone_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct RBT_HoverDrone_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(RBT_HoverDrone_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on RBT_HoverDrone_AnimBP_C_AnimGraph");
static_assert(sizeof(RBT_HoverDrone_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on RBT_HoverDrone_AnimBP_C_AnimGraph");
static_assert(offsetof(RBT_HoverDrone_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'RBT_HoverDrone_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

