#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReputationDetails_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReputationDetails_BP.ReputationDetails_BP_C
// 0x0018 (0x0378 - 0x0360)
class UReputationDetails_BP_C final : public UReputationDetailsWidget
{
public:
	class UTextBlockBase*                         DescriptionTextBlock;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         EffectsTextBlock;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlockBase*                         TextBlockBase_0;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReputationDetails_BP_C">();
	}
	static class UReputationDetails_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReputationDetails_BP_C>();
	}
};
static_assert(alignof(UReputationDetails_BP_C) == 0x000008, "Wrong alignment on UReputationDetails_BP_C");
static_assert(sizeof(UReputationDetails_BP_C) == 0x000378, "Wrong size on UReputationDetails_BP_C");
static_assert(offsetof(UReputationDetails_BP_C, DescriptionTextBlock) == 0x000360, "Member 'UReputationDetails_BP_C::DescriptionTextBlock' has a wrong offset!");
static_assert(offsetof(UReputationDetails_BP_C, EffectsTextBlock) == 0x000368, "Member 'UReputationDetails_BP_C::EffectsTextBlock' has a wrong offset!");
static_assert(offsetof(UReputationDetails_BP_C, TextBlockBase_0) == 0x000370, "Member 'UReputationDetails_BP_C::TextBlockBase_0' has a wrong offset!");

}

