#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReputationProgress_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ReputationProgress_BP.ReputationProgress_BP_C.ExecuteUbergraph_ReputationProgress_BP
// 0x0040 (0x0040 - 0x0000)
struct ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP) == 0x000008, "Wrong alignment on ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP");
static_assert(sizeof(ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP) == 0x000040, "Wrong size on ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP");
static_assert(offsetof(ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP, EntryPoint) == 0x000000, "Member 'ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP, CallFunc_GetColorByType_ReturnValue) == 0x000004, "Member 'ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP, K2Node_Event_IsDesignTime) == 0x000014, "Member 'ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'ReputationProgress_BP_C_ExecuteUbergraph_ReputationProgress_BP::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function ReputationProgress_BP.ReputationProgress_BP_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ReputationProgress_BP_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReputationProgress_BP_C_PreConstruct) == 0x000001, "Wrong alignment on ReputationProgress_BP_C_PreConstruct");
static_assert(sizeof(ReputationProgress_BP_C_PreConstruct) == 0x000001, "Wrong size on ReputationProgress_BP_C_PreConstruct");
static_assert(offsetof(ReputationProgress_BP_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ReputationProgress_BP_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

