#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReputationProgress_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReputationProgress_BP.ReputationProgress_BP_C
// 0x0018 (0x02B0 - 0x0298)
class UReputationProgress_BP_C final : public UReputationProgressWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture2D*                             Fill;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EIndianaUIColorType                           IndianaColor;                                      // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReputationProgress_BP(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReputationProgress_BP_C">();
	}
	static class UReputationProgress_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReputationProgress_BP_C>();
	}
};
static_assert(alignof(UReputationProgress_BP_C) == 0x000008, "Wrong alignment on UReputationProgress_BP_C");
static_assert(sizeof(UReputationProgress_BP_C) == 0x0002B0, "Wrong size on UReputationProgress_BP_C");
static_assert(offsetof(UReputationProgress_BP_C, UberGraphFrame) == 0x000298, "Member 'UReputationProgress_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReputationProgress_BP_C, Fill) == 0x0002A0, "Member 'UReputationProgress_BP_C::Fill' has a wrong offset!");
static_assert(offsetof(UReputationProgress_BP_C, IndianaColor) == 0x0002A8, "Member 'UReputationProgress_BP_C::IndianaColor' has a wrong offset!");

}

