#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SavingWidget_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SavingWidget_BP.SavingWidget_BP_C
// 0x0028 (0x0348 - 0x0320)
class USavingWidget_BP_C final : public USavingWidget
{
public:
	class UWidgetAnimation*                       FadeOut;                                           // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SavingImageBacking;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SavingImageForeground;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SavingImageRotating;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool OnMaximize(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnMinimize(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SavingWidget_BP_C">();
	}
	static class USavingWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USavingWidget_BP_C>();
	}
};
static_assert(alignof(USavingWidget_BP_C) == 0x000008, "Wrong alignment on USavingWidget_BP_C");
static_assert(sizeof(USavingWidget_BP_C) == 0x000348, "Wrong size on USavingWidget_BP_C");
static_assert(offsetof(USavingWidget_BP_C, FadeOut) == 0x000320, "Member 'USavingWidget_BP_C::FadeOut' has a wrong offset!");
static_assert(offsetof(USavingWidget_BP_C, FadeIn) == 0x000328, "Member 'USavingWidget_BP_C::FadeIn' has a wrong offset!");
static_assert(offsetof(USavingWidget_BP_C, SavingImageBacking) == 0x000330, "Member 'USavingWidget_BP_C::SavingImageBacking' has a wrong offset!");
static_assert(offsetof(USavingWidget_BP_C, SavingImageForeground) == 0x000338, "Member 'USavingWidget_BP_C::SavingImageForeground' has a wrong offset!");
static_assert(offsetof(USavingWidget_BP_C, SavingImageRotating) == 0x000340, "Member 'USavingWidget_BP_C::SavingImageRotating' has a wrong offset!");

}

