#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SavingWidget_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SavingWidget_BP.SavingWidget_BP_C.OnMaximize
// 0x0014 (0x0014 - 0x0000)
struct SavingWidget_BP_C_OnMaximize final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SavingWidget_BP_C_OnMaximize) == 0x000004, "Wrong alignment on SavingWidget_BP_C_OnMaximize");
static_assert(sizeof(SavingWidget_BP_C_OnMaximize) == 0x000014, "Wrong size on SavingWidget_BP_C_OnMaximize");
static_assert(offsetof(SavingWidget_BP_C_OnMaximize, AnimationCompleteCallback) == 0x000000, "Member 'SavingWidget_BP_C_OnMaximize::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(SavingWidget_BP_C_OnMaximize, ReturnValue) == 0x000010, "Member 'SavingWidget_BP_C_OnMaximize::ReturnValue' has a wrong offset!");

// Function SavingWidget_BP.SavingWidget_BP_C.OnMinimize
// 0x0014 (0x0014 - 0x0000)
struct SavingWidget_BP_C_OnMinimize final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SavingWidget_BP_C_OnMinimize) == 0x000004, "Wrong alignment on SavingWidget_BP_C_OnMinimize");
static_assert(sizeof(SavingWidget_BP_C_OnMinimize) == 0x000014, "Wrong size on SavingWidget_BP_C_OnMinimize");
static_assert(offsetof(SavingWidget_BP_C_OnMinimize, AnimationCompleteCallback) == 0x000000, "Member 'SavingWidget_BP_C_OnMinimize::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(SavingWidget_BP_C_OnMinimize, ReturnValue) == 0x000010, "Member 'SavingWidget_BP_C_OnMinimize::ReturnValue' has a wrong offset!");

}

