#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SC_LAR_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SC_LAR_AnimBlueprint.SC_LAR_AnimBlueprint_C.ExecuteUbergraph_SC_LAR_AnimBlueprint
// 0x0004 (0x0004 - 0x0000)
struct SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint) == 0x000004, "Wrong alignment on SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint");
static_assert(sizeof(SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint) == 0x000004, "Wrong size on SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint");
static_assert(offsetof(SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint, EntryPoint) == 0x000000, "Member 'SC_LAR_AnimBlueprint_C_ExecuteUbergraph_SC_LAR_AnimBlueprint::EntryPoint' has a wrong offset!");

// Function SC_LAR_AnimBlueprint.SC_LAR_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SC_LAR_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SC_LAR_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on SC_LAR_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(SC_LAR_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on SC_LAR_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(SC_LAR_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SC_LAR_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

