#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShockCharacterDeath

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShockCharacterDeath.ShockCharacterDeath_C.ExecuteUbergraph_ShockCharacterDeath
// 0x00C0 (0x00C0 - 0x0000)
struct ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent_1;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Delta;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath) == 0x000008, "Wrong alignment on ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath");
static_assert(sizeof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath) == 0x0000C0, "Wrong size on ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, EntryPoint) == 0x000000, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, Temp_int_Variable) == 0x000004, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, Temp_int_Variable_1) == 0x000008, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, Temp_int_Variable_2) == 0x000014, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, Temp_int_Variable_3) == 0x000018, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_IntInt_ReturnValue_3) == 0x000020, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, K2Node_Event_InDeathComponent_1) == 0x000028, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::K2Node_Event_InDeathComponent_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Get_Item) == 0x000038, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000058, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, K2Node_Event_Delta) == 0x000060, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Get_Item_3) == 0x000078, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Less_IntInt_ReturnValue_2) == 0x000080, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Array_Length_ReturnValue_3) == 0x000084, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Less_IntInt_ReturnValue_3) == 0x000088, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000090, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Lerp_ReturnValue) == 0x000094, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Less_FloatFloat_ReturnValue) == 0x000098, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_FClamp_ReturnValue) == 0x0000A4, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000A8, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000AC, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000B0, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath, K2Node_Event_InDeathComponent) == 0x0000B8, "Member 'ShockCharacterDeath_C_ExecuteUbergraph_ShockCharacterDeath::K2Node_Event_InDeathComponent' has a wrong offset!");

// Function ShockCharacterDeath.ShockCharacterDeath_C.ExecuteOnReload
// 0x0008 (0x0008 - 0x0000)
struct ShockCharacterDeath_C_ExecuteOnReload final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShockCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong alignment on ShockCharacterDeath_C_ExecuteOnReload");
static_assert(sizeof(ShockCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong size on ShockCharacterDeath_C_ExecuteOnReload");
static_assert(offsetof(ShockCharacterDeath_C_ExecuteOnReload, InDeathComponent) == 0x000000, "Member 'ShockCharacterDeath_C_ExecuteOnReload::InDeathComponent' has a wrong offset!");

// Function ShockCharacterDeath.ShockCharacterDeath_C.Tick
// 0x0004 (0x0004 - 0x0000)
struct ShockCharacterDeath_C_Tick final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShockCharacterDeath_C_Tick) == 0x000004, "Wrong alignment on ShockCharacterDeath_C_Tick");
static_assert(sizeof(ShockCharacterDeath_C_Tick) == 0x000004, "Wrong size on ShockCharacterDeath_C_Tick");
static_assert(offsetof(ShockCharacterDeath_C_Tick, Delta) == 0x000000, "Member 'ShockCharacterDeath_C_Tick::Delta' has a wrong offset!");

// Function ShockCharacterDeath.ShockCharacterDeath_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct ShockCharacterDeath_C_Execute final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShockCharacterDeath_C_Execute) == 0x000008, "Wrong alignment on ShockCharacterDeath_C_Execute");
static_assert(sizeof(ShockCharacterDeath_C_Execute) == 0x000008, "Wrong size on ShockCharacterDeath_C_Execute");
static_assert(offsetof(ShockCharacterDeath_C_Execute, InDeathComponent) == 0x000000, "Member 'ShockCharacterDeath_C_Execute::InDeathComponent' has a wrong offset!");

}

