#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkelMeshToSpawnAlong

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SkelMeshToSpawnAlong.SkelMeshToSpawnAlong
// 0x0058 (0x0058 - 0x0000)
struct FSkelMeshToSpawnAlong final
{
public:
	class USkeletalMesh*                          Mesh_51_CE794D5C46E9032710913DB175C95C46;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount_14_AB3ACCB543A8B45FE112759415C30A8E;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale_17_04F27EDA46975BCF09325792404719FC;         // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleRandomizer_47_D49E9C5B458EECEF3C1E078C23525554; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         spawnLengthSection_9_B4B968A14BB878D5AC8D17BC9CDD8EEC; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         spawnLengthSectionTolerance_11_C1FB31FE46C753F43A9A79A3B0710F80; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         minDistanceBetweenMeshes_20_79C72B424C0ACC42FF630A9B9AE702EA; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         heightAboveSurface_50_1CACD2E64131FFFF9C6B7C989A46067C; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_34_1AD513CD4B492F41E959CE9B44BEB4FD;      // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          useWorldRotation_41_3970C4BF4B586807AF22D6B70601E235; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                minRandomRotation_44_C5993A264ECECFFDAEA007B94543C1AB; // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                maxRandomRotation_23_40F852C84C872A40B5C50AAF3C2471C1; // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          onlyNearSurfaces_25_BC9A521B461BC39914A254AFC54E0C28; // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          onlyMidAir_27_847896C14DCBBEE5CEC2C49306874759;    // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSkelMeshToSpawnAlong) == 0x000008, "Wrong alignment on FSkelMeshToSpawnAlong");
static_assert(sizeof(FSkelMeshToSpawnAlong) == 0x000058, "Wrong size on FSkelMeshToSpawnAlong");
static_assert(offsetof(FSkelMeshToSpawnAlong, Mesh_51_CE794D5C46E9032710913DB175C95C46) == 0x000000, "Member 'FSkelMeshToSpawnAlong::Mesh_51_CE794D5C46E9032710913DB175C95C46' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, Amount_14_AB3ACCB543A8B45FE112759415C30A8E) == 0x000008, "Member 'FSkelMeshToSpawnAlong::Amount_14_AB3ACCB543A8B45FE112759415C30A8E' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, Scale_17_04F27EDA46975BCF09325792404719FC) == 0x00000C, "Member 'FSkelMeshToSpawnAlong::Scale_17_04F27EDA46975BCF09325792404719FC' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, ScaleRandomizer_47_D49E9C5B458EECEF3C1E078C23525554) == 0x000018, "Member 'FSkelMeshToSpawnAlong::ScaleRandomizer_47_D49E9C5B458EECEF3C1E078C23525554' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, spawnLengthSection_9_B4B968A14BB878D5AC8D17BC9CDD8EEC) == 0x00001C, "Member 'FSkelMeshToSpawnAlong::spawnLengthSection_9_B4B968A14BB878D5AC8D17BC9CDD8EEC' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, spawnLengthSectionTolerance_11_C1FB31FE46C753F43A9A79A3B0710F80) == 0x000020, "Member 'FSkelMeshToSpawnAlong::spawnLengthSectionTolerance_11_C1FB31FE46C753F43A9A79A3B0710F80' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, minDistanceBetweenMeshes_20_79C72B424C0ACC42FF630A9B9AE702EA) == 0x000024, "Member 'FSkelMeshToSpawnAlong::minDistanceBetweenMeshes_20_79C72B424C0ACC42FF630A9B9AE702EA' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, heightAboveSurface_50_1CACD2E64131FFFF9C6B7C989A46067C) == 0x000028, "Member 'FSkelMeshToSpawnAlong::heightAboveSurface_50_1CACD2E64131FFFF9C6B7C989A46067C' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, Rotation_34_1AD513CD4B492F41E959CE9B44BEB4FD) == 0x00002C, "Member 'FSkelMeshToSpawnAlong::Rotation_34_1AD513CD4B492F41E959CE9B44BEB4FD' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, useWorldRotation_41_3970C4BF4B586807AF22D6B70601E235) == 0x000038, "Member 'FSkelMeshToSpawnAlong::useWorldRotation_41_3970C4BF4B586807AF22D6B70601E235' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, minRandomRotation_44_C5993A264ECECFFDAEA007B94543C1AB) == 0x00003C, "Member 'FSkelMeshToSpawnAlong::minRandomRotation_44_C5993A264ECECFFDAEA007B94543C1AB' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, maxRandomRotation_23_40F852C84C872A40B5C50AAF3C2471C1) == 0x000048, "Member 'FSkelMeshToSpawnAlong::maxRandomRotation_23_40F852C84C872A40B5C50AAF3C2471C1' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, onlyNearSurfaces_25_BC9A521B461BC39914A254AFC54E0C28) == 0x000054, "Member 'FSkelMeshToSpawnAlong::onlyNearSurfaces_25_BC9A521B461BC39914A254AFC54E0C28' has a wrong offset!");
static_assert(offsetof(FSkelMeshToSpawnAlong, onlyMidAir_27_847896C14DCBBEE5CEC2C49306874759) == 0x000055, "Member 'FSkelMeshToSpawnAlong::onlyMidAir_27_847896C14DCBBEE5CEC2C49306874759' has a wrong offset!");

}

