#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillGroupDetail_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillGroupDetail_BP.SkillGroupDetail_BP_C
// 0x0018 (0x02D0 - 0x02B8)
class USkillGroupDetail_BP_C final : public USkillGroupDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectedAnimation3;                                // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedAnimation2;                                // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SkillGroupDetail_BP(int32 EntryPoint);
	void OnSkillSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillGroupDetail_BP_C">();
	}
	static class USkillGroupDetail_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillGroupDetail_BP_C>();
	}
};
static_assert(alignof(USkillGroupDetail_BP_C) == 0x000008, "Wrong alignment on USkillGroupDetail_BP_C");
static_assert(sizeof(USkillGroupDetail_BP_C) == 0x0002D0, "Wrong size on USkillGroupDetail_BP_C");
static_assert(offsetof(USkillGroupDetail_BP_C, UberGraphFrame) == 0x0002B8, "Member 'USkillGroupDetail_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillGroupDetail_BP_C, SelectedAnimation3) == 0x0002C0, "Member 'USkillGroupDetail_BP_C::SelectedAnimation3' has a wrong offset!");
static_assert(offsetof(USkillGroupDetail_BP_C, SelectedAnimation2) == 0x0002C8, "Member 'USkillGroupDetail_BP_C::SelectedAnimation2' has a wrong offset!");

}

