#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingDoor_Int_BP

#include "Basic.hpp"

#include "TimelineMeshTransform_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MeshMaterialInstance_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SlidingDoor_Int_BP.SlidingDoor_Int_BP_C.OnAnimateOpen
// 0x0001 (0x0001 - 0x0000)
struct SlidingDoor_Int_BP_C_OnAnimateOpen final
{
public:
	bool                                          InstantAnimation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlidingDoor_Int_BP_C_OnAnimateOpen) == 0x000001, "Wrong alignment on SlidingDoor_Int_BP_C_OnAnimateOpen");
static_assert(sizeof(SlidingDoor_Int_BP_C_OnAnimateOpen) == 0x000001, "Wrong size on SlidingDoor_Int_BP_C_OnAnimateOpen");
static_assert(offsetof(SlidingDoor_Int_BP_C_OnAnimateOpen, InstantAnimation) == 0x000000, "Member 'SlidingDoor_Int_BP_C_OnAnimateOpen::InstantAnimation' has a wrong offset!");

// Function SlidingDoor_Int_BP.SlidingDoor_Int_BP_C.OnAnimateClose
// 0x0002 (0x0002 - 0x0000)
struct SlidingDoor_Int_BP_C_OnAnimateClose final
{
public:
	bool                                          IgnoreSound_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InstantAnimation;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlidingDoor_Int_BP_C_OnAnimateClose) == 0x000001, "Wrong alignment on SlidingDoor_Int_BP_C_OnAnimateClose");
static_assert(sizeof(SlidingDoor_Int_BP_C_OnAnimateClose) == 0x000002, "Wrong size on SlidingDoor_Int_BP_C_OnAnimateClose");
static_assert(offsetof(SlidingDoor_Int_BP_C_OnAnimateClose, IgnoreSound_0) == 0x000000, "Member 'SlidingDoor_Int_BP_C_OnAnimateClose::IgnoreSound_0' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_OnAnimateClose, InstantAnimation) == 0x000001, "Member 'SlidingDoor_Int_BP_C_OnAnimateClose::InstantAnimation' has a wrong offset!");

// Function SlidingDoor_Int_BP.SlidingDoor_Int_BP_C.ExecuteUbergraph_SlidingDoor_Int_BP
// 0x0130 (0x0130 - 0x0000)
struct SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InstantAnimation_1;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IgnoreSound;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InstantAnimation;                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimelineMeshTransform                 CallFunc_Array_Get_Item;                           // 0x0018(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_IsLocked;                        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBarred_IsBarred;                        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSealed_IsSealed;                        // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshMaterialInstance                  CallFunc_Array_Get_Item_1;                         // 0x0108(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP) == 0x000008, "Wrong alignment on SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP");
static_assert(sizeof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP) == 0x000130, "Wrong size on SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, EntryPoint) == 0x000000, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, K2Node_Event_InstantAnimation_1) == 0x000014, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::K2Node_Event_InstantAnimation_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, K2Node_Event_IgnoreSound) == 0x000015, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::K2Node_Event_IgnoreSound' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, K2Node_Event_InstantAnimation) == 0x000016, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::K2Node_Event_InstantAnimation' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Array_Get_Item) == 0x000018, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_VLerp_ReturnValue) == 0x000054, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000060, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, Temp_int_Loop_Counter_Variable_1) == 0x0000E8, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_IsLocked_IsLocked) == 0x0000EC, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_IsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_SelectFloat_ReturnValue) == 0x0000F0, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_IsBarred_IsBarred) == 0x0000FC, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_IsBarred_IsBarred' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_IsSealed_IsSealed) == 0x0000FD, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_IsSealed_IsSealed' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_BooleanOR_ReturnValue) == 0x0000FE, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_SelectFloat_ReturnValue_1) == 0x000100, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP, CallFunc_GetTimelineLength_ReturnValue) == 0x000128, "Member 'SlidingDoor_Int_BP_C_ExecuteUbergraph_SlidingDoor_Int_BP::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");

// Function SlidingDoor_Int_BP.SlidingDoor_Int_BP_C.UserConstructionScript
// 0x0130 (0x0130 - 0x0000)
struct SlidingDoor_Int_BP_C_UserConstructionScript final
{
public:
	struct FVector                                TopSlide;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MainSlide;                                         // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_AssignMaterialInstanceBySlotName_Out;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimelineMeshTransform                 K2Node_MakeStruct_TimelineMeshTransform;           // 0x0048(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshMaterialInstance                  K2Node_MakeStruct_MeshMaterialInstance;            // 0x0090(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimelineMeshTransform                 K2Node_MakeStruct_TimelineMeshTransform_1;         // 0x00A8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTimelineMeshTransform>         K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	struct FMeshMaterialInstance                  K2Node_MakeStruct_MeshMaterialInstance_1;          // 0x00F0(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMeshMaterialInstance                  K2Node_MakeStruct_MeshMaterialInstance_2;          // 0x0108(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMeshMaterialInstance>          K2Node_MakeArray_Array_1;                          // 0x0120(0x0010)(ReferenceParm)
};
static_assert(alignof(SlidingDoor_Int_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on SlidingDoor_Int_BP_C_UserConstructionScript");
static_assert(sizeof(SlidingDoor_Int_BP_C_UserConstructionScript) == 0x000130, "Wrong size on SlidingDoor_Int_BP_C_UserConstructionScript");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, TopSlide) == 0x000000, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::TopSlide' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, MainSlide) == 0x00000C, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::MainSlide' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000018, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x00001D, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_AssignMaterialInstanceBySlotName_Out) == 0x000028, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_AssignMaterialInstanceBySlotName_Out' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeStruct_TimelineMeshTransform) == 0x000048, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeStruct_TimelineMeshTransform' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000084, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeStruct_MeshMaterialInstance) == 0x000090, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeStruct_MeshMaterialInstance' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeStruct_TimelineMeshTransform_1) == 0x0000A8, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeStruct_TimelineMeshTransform_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0000E0, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeStruct_MeshMaterialInstance_1) == 0x0000F0, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeStruct_MeshMaterialInstance_1' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeStruct_MeshMaterialInstance_2) == 0x000108, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeStruct_MeshMaterialInstance_2' has a wrong offset!");
static_assert(offsetof(SlidingDoor_Int_BP_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000120, "Member 'SlidingDoor_Int_BP_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");

}

