#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusTag_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatusTag_BP.StatusTag_BP_C
// 0x0020 (0x0420 - 0x0400)
class UStatusTag_BP_C final : public UStatusTagWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutTarget;                                     // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInTarget;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_3;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StatusTag_BP(int32 EntryPoint);
	void WidgetAnimationEvt_FadeInTarget_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_FadeOutTarget_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_FadeInTarget_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_FadeOutTarget_K2Node_WidgetAnimationEvent_0();
	void OnSetPlayerTargeted(bool bIsTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatusTag_BP_C">();
	}
	static class UStatusTag_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatusTag_BP_C>();
	}
};
static_assert(alignof(UStatusTag_BP_C) == 0x000008, "Wrong alignment on UStatusTag_BP_C");
static_assert(sizeof(UStatusTag_BP_C) == 0x000420, "Wrong size on UStatusTag_BP_C");
static_assert(offsetof(UStatusTag_BP_C, UberGraphFrame) == 0x000400, "Member 'UStatusTag_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStatusTag_BP_C, FadeOutTarget) == 0x000408, "Member 'UStatusTag_BP_C::FadeOutTarget' has a wrong offset!");
static_assert(offsetof(UStatusTag_BP_C, FadeInTarget) == 0x000410, "Member 'UStatusTag_BP_C::FadeInTarget' has a wrong offset!");
static_assert(offsetof(UStatusTag_BP_C, InvalidationBox_3) == 0x000418, "Member 'UStatusTag_BP_C::InvalidationBox_3' has a wrong offset!");

}

