#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsPerksPage_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatsPerksPage_BP.StatsPerksPage_BP_C
// 0x0018 (0x0400 - 0x03E8)
class UStatsPerksPage_BP_C final : public UStatsPerksPageWidget
{
public:
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget_0;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DynamicBacking;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatsPerksPage_BP_C">();
	}
	static class UStatsPerksPage_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatsPerksPage_BP_C>();
	}
};
static_assert(alignof(UStatsPerksPage_BP_C) == 0x000008, "Wrong alignment on UStatsPerksPage_BP_C");
static_assert(sizeof(UStatsPerksPage_BP_C) == 0x000400, "Wrong size on UStatsPerksPage_BP_C");
static_assert(offsetof(UStatsPerksPage_BP_C, BackgroundPanelWidget) == 0x0003E8, "Member 'UStatsPerksPage_BP_C::BackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(UStatsPerksPage_BP_C, BackgroundPanelWidget_0) == 0x0003F0, "Member 'UStatsPerksPage_BP_C::BackgroundPanelWidget_0' has a wrong offset!");
static_assert(offsetof(UStatsPerksPage_BP_C, DynamicBacking) == 0x0003F8, "Member 'UStatsPerksPage_BP_C::DynamicBacking' has a wrong offset!");

}

