#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsPerkList_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatsPerkList_BP.StatsPerkList_BP_C
// 0x0028 (0x0388 - 0x0360)
class UStatsPerkList_BP_C final : public UPerksListWidget
{
public:
	class UImage*                                 PerkRowLineBreakFour;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PerkRowLineBreakOne;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PerkRowLineBreakThree;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PerkRowLineBreakTwo;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerkVerticalBox;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatsPerkList_BP_C">();
	}
	static class UStatsPerkList_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatsPerkList_BP_C>();
	}
};
static_assert(alignof(UStatsPerkList_BP_C) == 0x000008, "Wrong alignment on UStatsPerkList_BP_C");
static_assert(sizeof(UStatsPerkList_BP_C) == 0x000388, "Wrong size on UStatsPerkList_BP_C");
static_assert(offsetof(UStatsPerkList_BP_C, PerkRowLineBreakFour) == 0x000360, "Member 'UStatsPerkList_BP_C::PerkRowLineBreakFour' has a wrong offset!");
static_assert(offsetof(UStatsPerkList_BP_C, PerkRowLineBreakOne) == 0x000368, "Member 'UStatsPerkList_BP_C::PerkRowLineBreakOne' has a wrong offset!");
static_assert(offsetof(UStatsPerkList_BP_C, PerkRowLineBreakThree) == 0x000370, "Member 'UStatsPerkList_BP_C::PerkRowLineBreakThree' has a wrong offset!");
static_assert(offsetof(UStatsPerkList_BP_C, PerkRowLineBreakTwo) == 0x000378, "Member 'UStatsPerkList_BP_C::PerkRowLineBreakTwo' has a wrong offset!");
static_assert(offsetof(UStatsPerkList_BP_C, PerkVerticalBox) == 0x000380, "Member 'UStatsPerkList_BP_C::PerkVerticalBox' has a wrong offset!");

}

