#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusTagAwarenessWidget_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function StatusTagAwarenessWidget_BP.StatusTagAwarenessWidget_BP_C.ExecuteUbergraph_StatusTagAwarenessWidget_BP
// 0x0020 (0x0020 - 0x0000)
struct StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_BackingTexture;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_FillTexture;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP) == 0x000008, "Wrong alignment on StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP");
static_assert(sizeof(StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP) == 0x000020, "Wrong size on StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP");
static_assert(offsetof(StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP, EntryPoint) == 0x000000, "Member 'StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP, K2Node_Event_BackingTexture) == 0x000010, "Member 'StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP::K2Node_Event_BackingTexture' has a wrong offset!");
static_assert(offsetof(StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP, K2Node_Event_FillTexture) == 0x000018, "Member 'StatusTagAwarenessWidget_BP_C_ExecuteUbergraph_StatusTagAwarenessWidget_BP::K2Node_Event_FillTexture' has a wrong offset!");

// Function StatusTagAwarenessWidget_BP.StatusTagAwarenessWidget_BP_C.SetTextures
// 0x0010 (0x0010 - 0x0000)
struct StatusTagAwarenessWidget_BP_C_SetTextures final
{
public:
	class UTexture2D*                             BackingTexture;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FillTexture;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatusTagAwarenessWidget_BP_C_SetTextures) == 0x000008, "Wrong alignment on StatusTagAwarenessWidget_BP_C_SetTextures");
static_assert(sizeof(StatusTagAwarenessWidget_BP_C_SetTextures) == 0x000010, "Wrong size on StatusTagAwarenessWidget_BP_C_SetTextures");
static_assert(offsetof(StatusTagAwarenessWidget_BP_C_SetTextures, BackingTexture) == 0x000000, "Member 'StatusTagAwarenessWidget_BP_C_SetTextures::BackingTexture' has a wrong offset!");
static_assert(offsetof(StatusTagAwarenessWidget_BP_C_SetTextures, FillTexture) == 0x000008, "Member 'StatusTagAwarenessWidget_BP_C_SetTextures::FillTexture' has a wrong offset!");

}

