#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsFlawSummaryEntry_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function StatsFlawSummaryEntry_BP.StatsFlawSummaryEntry_BP_C.ExecuteUbergraph_StatsFlawSummaryEntry_BP
// 0x0178 (0x0178 - 0x0000)
struct StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0008(0x0030)(ConstParm, ContainsInstancedReference)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue_1;             // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0098(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00C0(0x0028)()
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_3;                // 0x00E8(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x0118(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x0148(0x0030)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP) == 0x000008, "Wrong alignment on StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP");
static_assert(sizeof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP) == 0x000178, "Wrong size on StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, EntryPoint) == 0x000000, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_ComponentBoundEvent_Event) == 0x000008, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_Event_MyGeometry) == 0x000038, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_Event_InDeltaTime) == 0x000070, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, CallFunc_GetColorByType_ReturnValue) == 0x000074, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, CallFunc_GetColorByType_ReturnValue_1) == 0x000084, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::CallFunc_GetColorByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_MakeStruct_SlateColor) == 0x000098, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_MakeStruct_SlateColor_1) == 0x0000C0, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_ComponentBoundEvent_Event_3) == 0x0000E8, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_ComponentBoundEvent_Event_3' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_ComponentBoundEvent_Event_2) == 0x000118, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP, K2Node_ComponentBoundEvent_Event_1) == 0x000148, "Member 'StatsFlawSummaryEntry_BP_C_ExecuteUbergraph_StatsFlawSummaryEntry_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");

// Function StatsFlawSummaryEntry_BP.StatsFlawSummaryEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_20_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsFlawSummaryEntry_BP.StatsFlawSummaryEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsFlawSummaryEntry_BP.StatsFlawSummaryEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_86_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsFlawSummaryEntry_BP.StatsFlawSummaryEntry_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsFlawSummaryEntry_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_62_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsFlawSummaryEntry_BP.StatsFlawSummaryEntry_BP_C.Tick
// 0x003C (0x003C - 0x0000)
struct StatsFlawSummaryEntry_BP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFlawSummaryEntry_BP_C_Tick) == 0x000004, "Wrong alignment on StatsFlawSummaryEntry_BP_C_Tick");
static_assert(sizeof(StatsFlawSummaryEntry_BP_C_Tick) == 0x00003C, "Wrong size on StatsFlawSummaryEntry_BP_C_Tick");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_Tick, MyGeometry) == 0x000000, "Member 'StatsFlawSummaryEntry_BP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(StatsFlawSummaryEntry_BP_C_Tick, InDeltaTime) == 0x000038, "Member 'StatsFlawSummaryEntry_BP_C_Tick::InDeltaTime' has a wrong offset!");

}

