#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubStemStarter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SubStemStarter.SubStemStarter
// 0x0028 (0x0028 - 0x0000)
struct FSubStemStarter final
{
public:
	struct FVector                                startLocation_2_EB4C4B974C238AA4A472FFA1BE26E87E;  // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                startSurfaceNormal_4_7C11BD5A415026868BF0338FBAB8B71C; // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                startDirection_6_6CE9CE6248083FF90A46FEB4C09052C9; // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         subStemLevel_9_8CD6A05A4AA942B4B561029325FB7747;   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSubStemStarter) == 0x000004, "Wrong alignment on FSubStemStarter");
static_assert(sizeof(FSubStemStarter) == 0x000028, "Wrong size on FSubStemStarter");
static_assert(offsetof(FSubStemStarter, startLocation_2_EB4C4B974C238AA4A472FFA1BE26E87E) == 0x000000, "Member 'FSubStemStarter::startLocation_2_EB4C4B974C238AA4A472FFA1BE26E87E' has a wrong offset!");
static_assert(offsetof(FSubStemStarter, startSurfaceNormal_4_7C11BD5A415026868BF0338FBAB8B71C) == 0x00000C, "Member 'FSubStemStarter::startSurfaceNormal_4_7C11BD5A415026868BF0338FBAB8B71C' has a wrong offset!");
static_assert(offsetof(FSubStemStarter, startDirection_6_6CE9CE6248083FF90A46FEB4C09052C9) == 0x000018, "Member 'FSubStemStarter::startDirection_6_6CE9CE6248083FF90A46FEB4C09052C9' has a wrong offset!");
static_assert(offsetof(FSubStemStarter, subStemLevel_9_8CD6A05A4AA942B4B561029325FB7747) == 0x000024, "Member 'FSubStemStarter::subStemLevel_9_8CD6A05A4AA942B4B561029325FB7747' has a wrong offset!");

}

