#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Subtitle_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Subtitle_BP.Subtitle_BP_C
// 0x0020 (0x0490 - 0x0470)
class USubtitle_BP_C final : public USubtitlesWidget
{
public:
	class UMaterialInstanceDynamic*               LeftTopImageInst;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RightTopImageInst;                                 // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LeftBotImageInst;                                  // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RightBotImageInst;                                 // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Subtitle_BP_C">();
	}
	static class USubtitle_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubtitle_BP_C>();
	}
};
static_assert(alignof(USubtitle_BP_C) == 0x000008, "Wrong alignment on USubtitle_BP_C");
static_assert(sizeof(USubtitle_BP_C) == 0x000490, "Wrong size on USubtitle_BP_C");
static_assert(offsetof(USubtitle_BP_C, LeftTopImageInst) == 0x000470, "Member 'USubtitle_BP_C::LeftTopImageInst' has a wrong offset!");
static_assert(offsetof(USubtitle_BP_C, RightTopImageInst) == 0x000478, "Member 'USubtitle_BP_C::RightTopImageInst' has a wrong offset!");
static_assert(offsetof(USubtitle_BP_C, LeftBotImageInst) == 0x000480, "Member 'USubtitle_BP_C::LeftBotImageInst' has a wrong offset!");
static_assert(offsetof(USubtitle_BP_C, RightBotImageInst) == 0x000488, "Member 'USubtitle_BP_C::RightBotImageInst' has a wrong offset!");

}

