#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Switch_Interactable

#include "Basic.hpp"


namespace SDK::Params
{

// Function Switch_Interactable.Switch_Interactable_C.SetState
// 0x0008 (0x0008 - 0x0000)
struct Switch_Interactable_C_SetState final
{
public:
	int32                                         StateIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreSound;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InstantAnimation;                                  // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Unused;                                            // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Switch_Interactable_C_SetState) == 0x000004, "Wrong alignment on Switch_Interactable_C_SetState");
static_assert(sizeof(Switch_Interactable_C_SetState) == 0x000008, "Wrong size on Switch_Interactable_C_SetState");
static_assert(offsetof(Switch_Interactable_C_SetState, StateIndex) == 0x000000, "Member 'Switch_Interactable_C_SetState::StateIndex' has a wrong offset!");
static_assert(offsetof(Switch_Interactable_C_SetState, IgnoreSound) == 0x000004, "Member 'Switch_Interactable_C_SetState::IgnoreSound' has a wrong offset!");
static_assert(offsetof(Switch_Interactable_C_SetState, InstantAnimation) == 0x000005, "Member 'Switch_Interactable_C_SetState::InstantAnimation' has a wrong offset!");
static_assert(offsetof(Switch_Interactable_C_SetState, Unused) == 0x000006, "Member 'Switch_Interactable_C_SetState::Unused' has a wrong offset!");

}

