#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TerminalResponse_BP

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TerminalResponse_BP.TerminalResponse_BP_C.ExecuteUbergraph_TerminalResponse_BP
// 0x0030 (0x0030 - 0x0000)
struct TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectable_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bContainsSkillCheck;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelectable_1;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default_1;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelectable;                          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP) == 0x000008, "Wrong alignment on TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP");
static_assert(sizeof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP) == 0x000030, "Wrong size on TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, EntryPoint) == 0x000000, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, CallFunc_IsSelectable_ReturnValue) == 0x000004, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::CallFunc_IsSelectable_ReturnValue' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_bool_Variable) == 0x000005, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_bool_Variable_1) == 0x000006, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_byte_Variable) == 0x000007, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_byte_Variable_1) == 0x000008, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_bool_Variable_2) == 0x000009, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_float_Variable) == 0x00000C, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_float_Variable_1) == 0x000010, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_bool_Variable_3) == 0x000014, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_byte_Variable_2) == 0x000015, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, Temp_byte_Variable_3) == 0x000016, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Event_bContainsSkillCheck) == 0x000017, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Event_bContainsSkillCheck' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Event_bSelectable_1) == 0x000018, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Event_bSelectable_1' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Select_Default) == 0x00001A, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Select_Default_1) == 0x000020, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Select_Default_2) == 0x000028, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Event_bSelectable) == 0x00002C, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Event_bSelectable' has a wrong offset!");
static_assert(offsetof(TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP, K2Node_Select_Default_3) == 0x00002D, "Member 'TerminalResponse_BP_C_ExecuteUbergraph_TerminalResponse_BP::K2Node_Select_Default_3' has a wrong offset!");

// Function TerminalResponse_BP.TerminalResponse_BP_C.OnSetSkillCheckRequiredCompanion
// 0x0001 (0x0001 - 0x0000)
struct TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion final
{
public:
	bool                                          bSelectable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion) == 0x000001, "Wrong alignment on TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion");
static_assert(sizeof(TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion) == 0x000001, "Wrong size on TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion");
static_assert(offsetof(TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion, bSelectable) == 0x000000, "Member 'TerminalResponse_BP_C_OnSetSkillCheckRequiredCompanion::bSelectable' has a wrong offset!");

// Function TerminalResponse_BP.TerminalResponse_BP_C.OnSetSelectableOption
// 0x0001 (0x0001 - 0x0000)
struct TerminalResponse_BP_C_OnSetSelectableOption final
{
public:
	bool                                          bSelectable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TerminalResponse_BP_C_OnSetSelectableOption) == 0x000001, "Wrong alignment on TerminalResponse_BP_C_OnSetSelectableOption");
static_assert(sizeof(TerminalResponse_BP_C_OnSetSelectableOption) == 0x000001, "Wrong size on TerminalResponse_BP_C_OnSetSelectableOption");
static_assert(offsetof(TerminalResponse_BP_C_OnSetSelectableOption, bSelectable) == 0x000000, "Member 'TerminalResponse_BP_C_OnSetSelectableOption::bSelectable' has a wrong offset!");

// Function TerminalResponse_BP.TerminalResponse_BP_C.OnResponseSkillsChanged
// 0x0001 (0x0001 - 0x0000)
struct TerminalResponse_BP_C_OnResponseSkillsChanged final
{
public:
	bool                                          bContainsSkillCheck;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TerminalResponse_BP_C_OnResponseSkillsChanged) == 0x000001, "Wrong alignment on TerminalResponse_BP_C_OnResponseSkillsChanged");
static_assert(sizeof(TerminalResponse_BP_C_OnResponseSkillsChanged) == 0x000001, "Wrong size on TerminalResponse_BP_C_OnResponseSkillsChanged");
static_assert(offsetof(TerminalResponse_BP_C_OnResponseSkillsChanged, bContainsSkillCheck) == 0x000000, "Member 'TerminalResponse_BP_C_OnResponseSkillsChanged::bContainsSkillCheck' has a wrong offset!");

}

