#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tinkering_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tinkering_BP.Tinkering_BP_C
// 0x0030 (0x03D0 - 0x03A0)
class UTinkering_BP_C final : public UTinkeringWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackingBot;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingTop;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackingBotInst;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tinkering_BP(int32 EntryPoint);
	void SetNewBackingMaterialHeight(float NewHeight);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tinkering_BP_C">();
	}
	static class UTinkering_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTinkering_BP_C>();
	}
};
static_assert(alignof(UTinkering_BP_C) == 0x000008, "Wrong alignment on UTinkering_BP_C");
static_assert(sizeof(UTinkering_BP_C) == 0x0003D0, "Wrong size on UTinkering_BP_C");
static_assert(offsetof(UTinkering_BP_C, UberGraphFrame) == 0x0003A0, "Member 'UTinkering_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTinkering_BP_C, FadeIn) == 0x0003A8, "Member 'UTinkering_BP_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UTinkering_BP_C, BackingBot) == 0x0003B0, "Member 'UTinkering_BP_C::BackingBot' has a wrong offset!");
static_assert(offsetof(UTinkering_BP_C, BackingTop) == 0x0003B8, "Member 'UTinkering_BP_C::BackingTop' has a wrong offset!");
static_assert(offsetof(UTinkering_BP_C, Frame) == 0x0003C0, "Member 'UTinkering_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(UTinkering_BP_C, BackingBotInst) == 0x0003C8, "Member 'UTinkering_BP_C::BackingBotInst' has a wrong offset!");

}

