#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TownDoor_BP

#include "Basic.hpp"

#include "DoorBase_BP_classes.hpp"
#include "Engine_structs.hpp"
#include "MeshMaterialInstance_structs.hpp"
#include "TimelineMeshTransform_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TownDoor_BP.TownDoor_BP_C
// 0x0058 (0x0580 - 0x0528)
class ATownDoor_BP_C : public ADoorBase_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TownDoor_BP_C;                      // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LeftDoor;                                          // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RightDoor;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TopDoor;                                           // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateDoors_Main_883CE6CF46D48C50E240C9ABB10C96B6; // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateDoors__Direction_883CE6CF46D48C50E240C9ABB10C96B6; // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateDoors;                                      // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMeshMaterialInstance>          MeshMaterialInstances;                             // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTimelineMeshTransform>         MeshTransforms;                                    // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TimelineTime;                                      // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TownDoor_BP(int32 EntryPoint);
	void OnAnimateOpen(bool InstantAnimation);
	void AnimateDoors__UpdateFunc();
	void AnimateDoors__FinishedFunc();
	void OnAnimateClose(bool IgnoreSound_0, bool InstantAnimation);
	void OnStateChanged();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TownDoor_BP_C">();
	}
	static class ATownDoor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATownDoor_BP_C>();
	}
};
static_assert(alignof(ATownDoor_BP_C) == 0x000008, "Wrong alignment on ATownDoor_BP_C");
static_assert(sizeof(ATownDoor_BP_C) == 0x000580, "Wrong size on ATownDoor_BP_C");
static_assert(offsetof(ATownDoor_BP_C, UberGraphFrame_TownDoor_BP_C) == 0x000528, "Member 'ATownDoor_BP_C::UberGraphFrame_TownDoor_BP_C' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, LeftDoor) == 0x000530, "Member 'ATownDoor_BP_C::LeftDoor' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, RightDoor) == 0x000538, "Member 'ATownDoor_BP_C::RightDoor' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, TopDoor) == 0x000540, "Member 'ATownDoor_BP_C::TopDoor' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, AnimateDoors_Main_883CE6CF46D48C50E240C9ABB10C96B6) == 0x000548, "Member 'ATownDoor_BP_C::AnimateDoors_Main_883CE6CF46D48C50E240C9ABB10C96B6' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, AnimateDoors__Direction_883CE6CF46D48C50E240C9ABB10C96B6) == 0x00054C, "Member 'ATownDoor_BP_C::AnimateDoors__Direction_883CE6CF46D48C50E240C9ABB10C96B6' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, AnimateDoors) == 0x000550, "Member 'ATownDoor_BP_C::AnimateDoors' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, MeshMaterialInstances) == 0x000558, "Member 'ATownDoor_BP_C::MeshMaterialInstances' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, MeshTransforms) == 0x000568, "Member 'ATownDoor_BP_C::MeshTransforms' has a wrong offset!");
static_assert(offsetof(ATownDoor_BP_C, TimelineTime) == 0x000578, "Member 'ATownDoor_BP_C::TimelineTime' has a wrong offset!");

}

