#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TPV_AnimBP_Marauder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FaceFX_structs.hpp"
#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C
// 0xBA90 (0xCD70 - 0x12E0)
class UTPV_AnimBP_Marauder_C final : public UBipedAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x12E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_216;                // 0x1330(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_215;                // 0x1358(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_214;                // 0x1380(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_213;                // 0x13A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_212;                // 0x13D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_211;                // 0x13F8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x1420(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x14A0(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_210;                // 0x1560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_209;                // 0x1588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_208;                // 0x15B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_207;                // 0x15D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x1600(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x1680(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_206;                // 0x16B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_205;                // 0x16D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_204;                // 0x1700(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_203;                // 0x1728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_202;                // 0x1750(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_201;                // 0x1778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_200;                // 0x17A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x17C8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x1848(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x1878(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x18F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x1928(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x19A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x19D8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x1A58(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x1A88(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x1B08(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x1B38(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x1BE8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x1C18(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_199;                // 0x1C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_198;                // 0x1C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_197;                // 0x1CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_196;                // 0x1CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_195;                // 0x1D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_194;                // 0x1D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_193;                // 0x1D50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_192;                // 0x1D78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_191;                // 0x1DA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_190;                // 0x1DC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_189;                // 0x1DF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_188;                // 0x1E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_187;                // 0x1E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_186;                // 0x1E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_185;                // 0x1E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_184;                // 0x1EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_183;                // 0x1EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_182;                // 0x1F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_181;                // 0x1F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_180;                // 0x1F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_179;                // 0x1F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_178;                // 0x1FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_177;                // 0x1FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_176;                // 0x1FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_175;                // 0x2020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_174;                // 0x2048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_173;                // 0x2070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_172;                // 0x2098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_171;                // 0x20C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_170;                // 0x20E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_169;                // 0x2110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_168;                // 0x2138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_167;                // 0x2160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_166;                // 0x2188(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x21B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x2230(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x2260(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x22E0(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_18;              // 0x2310(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x2398(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x23C8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x2448(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x2478(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x24F8(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_17;              // 0x2528(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x25B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x25E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x2660(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_16;              // 0x2690(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x2718(0x00A0)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_15;              // 0x27B8(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x2840(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x2870(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x2920(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_165;                // 0x2950(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_164;                // 0x2978(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163;                // 0x29A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_162;                // 0x29C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x29F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x2A18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x2A40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x2A68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x2A90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x2AB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x2AE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x2B08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x2B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x2B58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x2B80(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x2BA8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x2C28(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x2C58(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x2CD8(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_14;              // 0x2D08(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x2D90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x2DC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x2E40(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x2E70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x2E98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x2F18(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_13;              // 0x2F48(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x2FD0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x3000(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x3080(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_12;              // 0x30B0(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x3138(0x00A0)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_11;              // 0x31D8(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x3260(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x3290(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x3340(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x3370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x3398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x33C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x33E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x3410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x3438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x3460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x3488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x34B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x34D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x3500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x3528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x3550(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x3578(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x35F8(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_10;              // 0x3628(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x36B0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x36E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x3760(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x3790(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x3810(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_9;               // 0x3840(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x38C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x38F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x3978(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_8;               // 0x39A8(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x3A30(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x3A60(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x3B10(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x3B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x3B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x3B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x3BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x3BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x3C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x3C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x3C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x3C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x3CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x3CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x3CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x3D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x3D48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x3D70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x3D98(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x3E18(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_7;               // 0x3E48(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x3ED0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x3F00(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x3F80(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x3FB0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x4030(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_6;               // 0x4060(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x40E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x4118(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x4198(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_5;               // 0x41C8(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x4250(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x4280(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x4330(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x4360(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x4410(0x00A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x44B0(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x4570(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x45F0(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x4670(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x4730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x4758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x4780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x47A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x47D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x47F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x4820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x4848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x4870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x4898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x48C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x48E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x4910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x4938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x4960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x4988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x49B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x49D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x4A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x4A28(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_6;            // 0x4A50(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x4B20(0x0080)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x4BA0(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x4BD8(0x00F0)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_7;                    // 0x4CC8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x4D58(0x0030)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x4D88(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x4E58(0x0080)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x4ED8(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0x4F10(0x00F0)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_6;                    // 0x5000(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x5090(0x0030)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_5;                    // 0x50C0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x5150(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x5180(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_4;                    // 0x51A8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x5238(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x5268(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x5290(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x52B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x52E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x5308(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x5330(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_3;                    // 0x5358(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x53E8(0x0030)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_2;                    // 0x5418(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x54A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x54D8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x5500(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x5580(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x55B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x5630(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x5660(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x5710(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x5740(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x57F0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x5820(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x5910(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x59B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x5A30(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x5A60(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x5B00(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x5B80(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x5C00(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x5C30(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x5CE0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x5D10(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x5DC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x5DF0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x5E18(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x5E98(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x5EC8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x5F48(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x5F78(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x6028(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x60C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x60F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x6118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x6140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x6168(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x6190(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x61B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x61E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x6208(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x6288(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x62B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x6338(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x6368(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x63E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x6418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x6440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x6468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x6490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x64B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x64E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x6508(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x6530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x6558(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x6580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x65A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x65D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x65F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x6620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x6648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x6670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x6698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x66C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x66E8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x6710(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x6800(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x68A0(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x6990(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x6A10(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x6AB0(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x6B30(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x6C00(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x6C30(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x6D20(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x6DC0(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x6EB0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x6F30(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x6FD0(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x7050(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x7120(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x7150(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x7240(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x72E0(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x73D0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x7450(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x74F0(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x7570(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x7640(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x7670(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x7760(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x7800(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x78B0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x7930(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x79B0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x7A50(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x7AD0(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x7BA0(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x7C90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x7CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x7CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x7D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x7D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x7D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x7D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x7DB0(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_1;                    // 0x7DD8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x7E68(0x0030)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay;                      // 0x7E98(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x7F28(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_4;               // 0x7F58(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x7FE0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x8010(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x80C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x80F0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x81A0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x81D0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x8280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x82A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x82D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x82F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x8320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x8348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x8370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x8398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x83C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x83E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x8410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x8438(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x8460(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x84E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x8510(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x8590(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x85C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x85E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x8668(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x8698(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x8718(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x8748(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x87F8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x88B8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x88E8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x8998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x89C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x89E8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x8A10(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x8B00(0x00A0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x8BA0(0x0018)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x8BB8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x8C80(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x8D70(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x8DA0(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x8E90(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x8EC0(0x00B0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x8F70(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x9040(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x9068(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x90B0(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x9208(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x92C8(0x0048)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x9310(0x01E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x94F0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x9510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x9538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x9560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x9588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x95B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x95D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x9600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x9628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x9650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x9678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x96A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x96C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x96F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x9718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x9740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x9768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x9790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x97B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x97E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x9808(0x0028)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_3;               // 0x9830(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x98B8(0x00A0)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_2;               // 0x9958(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x99E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x9A10(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x9A90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x9AC0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x9B40(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x9B70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x9BF0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x9C20(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x9CA0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x9CD0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x9CF8(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x9D10(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x9D40(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x9DC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x9DF0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x9E70(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x9EA0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x9F50(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x9FF0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0xA018(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0xA038(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0xA060(0x00A0)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0xA100(0x00F8)()
	struct FAnimNode_BlendFaceFXAnimation         AnimGraphNode_BlendFaceFXAnimation;                // 0xA1F8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xA258(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0xA278(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xA298(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xA2C8(0x0158)()
	struct FAnimNode_EyeLookAt                    AnimGraphNode_EyeLookAt_1;                         // 0xA420(0x01C0)()
	struct FAnimNode_EyeLookAt                    AnimGraphNode_EyeLookAt;                           // 0xA5E0(0x01C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0xA7A0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0xA860(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0xA888(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0xA950(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0xA9F0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0xAA18(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xAA60(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0xABB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xABE0(0x0028)()
	struct FAnimNode_BatchModify                  AnimGraphNode_BatchModify;                         // 0xAC08(0x00D8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xACE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xAD00(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0xAD20(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0xAD68(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xAE70(0x00C0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0xAF30(0x0018)()
	uint8                                         Pad_AF48[0x8];                                     // 0xAF48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0xAF50(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0xB130(0x01E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0xB310(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xB358(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0xB3F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xB440(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0xB468(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0xB530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0xB558(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0xB580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0xB5A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0xB5D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0xB5F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0xB620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0xB648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0xB670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0xB698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0xB6C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0xB6E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0xB710(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0xB738(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0xB7B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0xB7E8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0xB810(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0xB890(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0xB8C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0xB8E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0xB968(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0xB998(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xBA18(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0xBA48(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0xBA70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xBAF0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xBB20(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0xBBD0(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xBC90(0x0048)()
