#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TPV_AnimBP_Marauder

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.ExecuteUbergraph_TPV_AnimBP_Marauder
// 0x0080 (0x0080 - 0x0000)
struct TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSyncGroupBetweenMarkers_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_18;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_19;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_20;                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocomotionAnimationSet*                K2Node_Event_NewLocomtionAnimationSet;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTPVPersonalitySet*                     K2Node_Event_Personality;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTPVPersonalitySet*                     K2Node_DynamicCast_AsTPVPersonality_Set;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponAnimations*                      K2Node_Event_NewWeaponAnimations;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimationsTPV_BP_C*              K2Node_DynamicCast_AsWeapon_Animations_TPV_BP;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMontagePlayingOnSlot_ReturnValue;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder");
static_assert(sizeof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder) == 0x000080, "Wrong size on TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, EntryPoint) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::EntryPoint' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_1) == 0x000007, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_1) == 0x000009, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000A, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_2) == 0x00000B, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_3) == 0x00000C, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_3) == 0x00000D, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_4) == 0x00000E, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_4) == 0x00000F, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_5) == 0x000010, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_5) == 0x000011, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanOR_ReturnValue_2) == 0x000012, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanOR_ReturnValue_3) == 0x000013, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_6) == 0x000014, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_6) == 0x000015, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_7) == 0x000016, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_7) == 0x000017, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_8) == 0x000018, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_9) == 0x000019, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_10) == 0x00001A, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_8) == 0x00001B, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_11) == 0x00001C, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_9) == 0x00001D, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_12) == 0x00001E, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanOR_ReturnValue_4) == 0x00001F, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanOR_ReturnValue_5) == 0x000020, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_13) == 0x000021, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_14) == 0x000022, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_10) == 0x000023, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_15) == 0x000024, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_11) == 0x000025, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_16) == 0x000026, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_17) == 0x000027, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_IsSyncGroupBetweenMarkers_ReturnValue) == 0x000028, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_IsSyncGroupBetweenMarkers_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_12) == 0x000029, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_18) == 0x00002A, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_13) == 0x00002B, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_19) == 0x00002C, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Not_PreBool_ReturnValue_14) == 0x00002D, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Not_PreBool_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_BooleanAND_ReturnValue_20) == 0x00002E, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_BooleanAND_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Abs_ReturnValue) == 0x000030, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_Event_DeltaTimeX) == 0x000038, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Abs_ReturnValue_1) == 0x00003C, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000040, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_Event_NewLocomtionAnimationSet) == 0x000048, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_Event_NewLocomtionAnimationSet' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_Event_Personality) == 0x000050, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_Event_Personality' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_DynamicCast_AsTPVPersonality_Set) == 0x000058, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_DynamicCast_AsTPVPersonality_Set' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_Event_NewWeaponAnimations) == 0x000068, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_Event_NewWeaponAnimations' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_DynamicCast_AsWeapon_Animations_TPV_BP) == 0x000070, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_DynamicCast_AsWeapon_Animations_TPV_BP' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_IsMontagePlayingOnSlot_ReturnValue) == 0x000079, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_IsMontagePlayingOnSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00007C, "Member 'TPV_AnimBP_Marauder_C_ExecuteUbergraph_TPV_AnimBP_Marauder::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.OnNewWeaponAnimations
// 0x0008 (0x0008 - 0x0000)
struct TPV_AnimBP_Marauder_C_OnNewWeaponAnimations final
{
public:
	class UWeaponAnimations*                      NewWeaponAnimations;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_OnNewWeaponAnimations) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_OnNewWeaponAnimations");
static_assert(sizeof(TPV_AnimBP_Marauder_C_OnNewWeaponAnimations) == 0x000008, "Wrong size on TPV_AnimBP_Marauder_C_OnNewWeaponAnimations");
static_assert(offsetof(TPV_AnimBP_Marauder_C_OnNewWeaponAnimations, NewWeaponAnimations) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_OnNewWeaponAnimations::NewWeaponAnimations' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.SetPersonality
// 0x0008 (0x0008 - 0x0000)
struct TPV_AnimBP_Marauder_C_SetPersonality final
{
public:
	class UTPVPersonalitySet*                     Personality;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_SetPersonality) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_SetPersonality");
static_assert(sizeof(TPV_AnimBP_Marauder_C_SetPersonality) == 0x000008, "Wrong size on TPV_AnimBP_Marauder_C_SetPersonality");
static_assert(offsetof(TPV_AnimBP_Marauder_C_SetPersonality, Personality) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_SetPersonality::Personality' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.OnNewLocomotionAnimationSet
// 0x0008 (0x0008 - 0x0000)
struct TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet final
{
public:
	class ULocomotionAnimationSet*                NewLocomtionAnimationSet;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet");
static_assert(sizeof(TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet) == 0x000008, "Wrong size on TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet");
static_assert(offsetof(TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet, NewLocomtionAnimationSet) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_OnNewLocomotionAnimationSet::NewLocomtionAnimationSet' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation");
static_assert(sizeof(TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation");
static_assert(offsetof(TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.DetermineIsCompanion
// 0x0030 (0x0030 - 0x0000)
struct TPV_AnimBP_Marauder_C_DetermineIsCompanion final
{
public:
	class UCompanionComponent*                    CompanionComponent;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PawnOwner;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCompanionComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_DetermineIsCompanion) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_DetermineIsCompanion");
static_assert(sizeof(TPV_AnimBP_Marauder_C_DetermineIsCompanion) == 0x000030, "Wrong size on TPV_AnimBP_Marauder_C_DetermineIsCompanion");
static_assert(offsetof(TPV_AnimBP_Marauder_C_DetermineIsCompanion, CompanionComponent) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_DetermineIsCompanion::CompanionComponent' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_DetermineIsCompanion, PawnOwner) == 0x000008, "Member 'TPV_AnimBP_Marauder_C_DetermineIsCompanion::PawnOwner' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_DetermineIsCompanion, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TPV_AnimBP_Marauder_C_DetermineIsCompanion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_DetermineIsCompanion, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'TPV_AnimBP_Marauder_C_DetermineIsCompanion::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_DetermineIsCompanion, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000020, "Member 'TPV_AnimBP_Marauder_C_DetermineIsCompanion::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_DetermineIsCompanion, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'TPV_AnimBP_Marauder_C_DetermineIsCompanion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.UpdateRunAnims
// 0x0018 (0x0018 - 0x0000)
struct TPV_AnimBP_Marauder_C_UpdateRunAnims final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_UpdateRunAnims) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_UpdateRunAnims");
static_assert(sizeof(TPV_AnimBP_Marauder_C_UpdateRunAnims) == 0x000018, "Wrong size on TPV_AnimBP_Marauder_C_UpdateRunAnims");
static_assert(offsetof(TPV_AnimBP_Marauder_C_UpdateRunAnims, Temp_bool_Variable) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_UpdateRunAnims::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_UpdateRunAnims, Temp_bool_Variable_1) == 0x000001, "Member 'TPV_AnimBP_Marauder_C_UpdateRunAnims::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_UpdateRunAnims, K2Node_Select_Default) == 0x000008, "Member 'TPV_AnimBP_Marauder_C_UpdateRunAnims::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TPV_AnimBP_Marauder_C_UpdateRunAnims, K2Node_Select_Default_1) == 0x000010, "Member 'TPV_AnimBP_Marauder_C_UpdateRunAnims::K2Node_Select_Default_1' has a wrong offset!");

// Function TPV_AnimBP_Marauder.TPV_AnimBP_Marauder_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TPV_AnimBP_Marauder_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TPV_AnimBP_Marauder_C_AnimGraph) == 0x000008, "Wrong alignment on TPV_AnimBP_Marauder_C_AnimGraph");
static_assert(sizeof(TPV_AnimBP_Marauder_C_AnimGraph) == 0x000010, "Wrong size on TPV_AnimBP_Marauder_C_AnimGraph");
static_assert(offsetof(TPV_AnimBP_Marauder_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TPV_AnimBP_Marauder_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

