#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrapTrigger_Box_x2_Abstract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TrapTrigger_Abstract_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TrapTrigger_Box_x2_Abstract.TrapTrigger_Box_x2_Abstract_C
// 0x0038 (0x0428 - 0x03F0)
class ATrapTrigger_Box_x2_Abstract_C : public ATrapTrigger_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TrapTrigger_Box_x2_Abstract_C;      // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Tripwire;                                          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ActivatorTrackingVolume;                           // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ActivationVolume;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTripwire;                                    // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TripwireScale;                                     // 0x0414(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaterialU;                                         // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaterialV;                                         // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TrapTrigger_Box_x2_Abstract(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnTrapTriggerDeployed_Event_0();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrapTrigger_Box_x2_Abstract_C">();
	}
	static class ATrapTrigger_Box_x2_Abstract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrapTrigger_Box_x2_Abstract_C>();
	}
};
static_assert(alignof(ATrapTrigger_Box_x2_Abstract_C) == 0x000008, "Wrong alignment on ATrapTrigger_Box_x2_Abstract_C");
static_assert(sizeof(ATrapTrigger_Box_x2_Abstract_C) == 0x000428, "Wrong size on ATrapTrigger_Box_x2_Abstract_C");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, UberGraphFrame_TrapTrigger_Box_x2_Abstract_C) == 0x0003F0, "Member 'ATrapTrigger_Box_x2_Abstract_C::UberGraphFrame_TrapTrigger_Box_x2_Abstract_C' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, Tripwire) == 0x0003F8, "Member 'ATrapTrigger_Box_x2_Abstract_C::Tripwire' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, ActivatorTrackingVolume) == 0x000400, "Member 'ATrapTrigger_Box_x2_Abstract_C::ActivatorTrackingVolume' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, ActivationVolume) == 0x000408, "Member 'ATrapTrigger_Box_x2_Abstract_C::ActivationVolume' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, EnableTripwire) == 0x000410, "Member 'ATrapTrigger_Box_x2_Abstract_C::EnableTripwire' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, TripwireScale) == 0x000414, "Member 'ATrapTrigger_Box_x2_Abstract_C::TripwireScale' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, MaterialU) == 0x000420, "Member 'ATrapTrigger_Box_x2_Abstract_C::MaterialU' has a wrong offset!");
static_assert(offsetof(ATrapTrigger_Box_x2_Abstract_C, MaterialV) == 0x000424, "Member 'ATrapTrigger_Box_x2_Abstract_C::MaterialV' has a wrong offset!");

}

