#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TripBlade_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TripBlade_AnimBP.TripBlade_AnimBP_C.ExecuteUbergraph_TripBlade_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP) == 0x000004, "Wrong alignment on TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP");
static_assert(sizeof(TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP) == 0x000004, "Wrong size on TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP");
static_assert(offsetof(TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP, EntryPoint) == 0x000000, "Member 'TripBlade_AnimBP_C_ExecuteUbergraph_TripBlade_AnimBP::EntryPoint' has a wrong offset!");

// Function TripBlade_AnimBP.TripBlade_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TripBlade_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TripBlade_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on TripBlade_AnimBP_C_AnimGraph");
static_assert(sizeof(TripBlade_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on TripBlade_AnimBP_C_AnimGraph");
static_assert(offsetof(TripBlade_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TripBlade_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

