#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TTDScanner_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TTDScanner_BP.TTDScanner_BP_C
// 0x0028 (0x03E8 - 0x03C0)
class UTTDScanner_BP_C final : public UTTDEnemyScanner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutContents;                                   // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInContents;                                    // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInFactionImage;                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TTDScanner_BP(int32 EntryPoint);
	void WidgetAnimationEvt_FadeOutContents_K2Node_WidgetAnimationEvent_0();
	void StopFactionImageAnimation();
	void OnMakeInvisible();
	void OnMakeVisible();
	void OnFactionImageLoaded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TTDScanner_BP_C">();
	}
	static class UTTDScanner_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTTDScanner_BP_C>();
	}
};
static_assert(alignof(UTTDScanner_BP_C) == 0x000008, "Wrong alignment on UTTDScanner_BP_C");
static_assert(sizeof(UTTDScanner_BP_C) == 0x0003E8, "Wrong size on UTTDScanner_BP_C");
static_assert(offsetof(UTTDScanner_BP_C, UberGraphFrame) == 0x0003C0, "Member 'UTTDScanner_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTTDScanner_BP_C, FadeOutContents) == 0x0003C8, "Member 'UTTDScanner_BP_C::FadeOutContents' has a wrong offset!");
static_assert(offsetof(UTTDScanner_BP_C, FadeInContents) == 0x0003D0, "Member 'UTTDScanner_BP_C::FadeInContents' has a wrong offset!");
static_assert(offsetof(UTTDScanner_BP_C, FadeInFactionImage) == 0x0003D8, "Member 'UTTDScanner_BP_C::FadeInFactionImage' has a wrong offset!");
static_assert(offsetof(UTTDScanner_BP_C, Image_0) == 0x0003E0, "Member 'UTTDScanner_BP_C::Image_0' has a wrong offset!");

}

