#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialPopupStyle_Simple_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialPopupStyle_Simple_BP.TutorialPopupStyle_Simple_BP_C
// 0x0038 (0x0438 - 0x0400)
class UTutorialPopupStyle_Simple_BP_C final : public UTutorialPopupStyleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MascotImageFadeIn;                                 // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonHorizontalBox;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackingBotInst;                                    // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialPopupStyle_Simple_BP(int32 EntryPoint);
	void FadeInMascotImage();
	void SetNewBackingMaterialHeight(float NewHeight);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialPopupStyle_Simple_BP_C">();
	}
	static class UTutorialPopupStyle_Simple_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialPopupStyle_Simple_BP_C>();
	}
};
static_assert(alignof(UTutorialPopupStyle_Simple_BP_C) == 0x000008, "Wrong alignment on UTutorialPopupStyle_Simple_BP_C");
static_assert(sizeof(UTutorialPopupStyle_Simple_BP_C) == 0x000438, "Wrong size on UTutorialPopupStyle_Simple_BP_C");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, UberGraphFrame) == 0x000400, "Member 'UTutorialPopupStyle_Simple_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, MascotImageFadeIn) == 0x000408, "Member 'UTutorialPopupStyle_Simple_BP_C::MascotImageFadeIn' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, Background) == 0x000410, "Member 'UTutorialPopupStyle_Simple_BP_C::Background' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, ButtonHorizontalBox) == 0x000418, "Member 'UTutorialPopupStyle_Simple_BP_C::ButtonHorizontalBox' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, Frame) == 0x000420, "Member 'UTutorialPopupStyle_Simple_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, InvalidationBox_0) == 0x000428, "Member 'UTutorialPopupStyle_Simple_BP_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Simple_BP_C, BackingBotInst) == 0x000430, "Member 'UTutorialPopupStyle_Simple_BP_C::BackingBotInst' has a wrong offset!");

}

