#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialPopupStyle_Corporate_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialPopupStyle_Corporate_BP.TutorialPopupStyle_Corporate_BP_C
// 0x0060 (0x0460 - 0x0400)
class UTutorialPopupStyle_Corporate_BP_C final : public UTutorialPopupStyleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MascotImageFadeIn;                                 // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackingBotLeft;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingBotRight;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingFill;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingTopLeft;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackingTopRight;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         OfferButtonContainerBox;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackingBotInst;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialPopupStyle_Corporate_BP(int32 EntryPoint);
	void FadeInMascotImage();
	void Construct();
	void SetNewBackingMaterialHeight(float NewHeight);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialPopupStyle_Corporate_BP_C">();
	}
	static class UTutorialPopupStyle_Corporate_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialPopupStyle_Corporate_BP_C>();
	}
};
static_assert(alignof(UTutorialPopupStyle_Corporate_BP_C) == 0x000008, "Wrong alignment on UTutorialPopupStyle_Corporate_BP_C");
static_assert(sizeof(UTutorialPopupStyle_Corporate_BP_C) == 0x000460, "Wrong size on UTutorialPopupStyle_Corporate_BP_C");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, UberGraphFrame) == 0x000400, "Member 'UTutorialPopupStyle_Corporate_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, MascotImageFadeIn) == 0x000408, "Member 'UTutorialPopupStyle_Corporate_BP_C::MascotImageFadeIn' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, BackingBotLeft) == 0x000410, "Member 'UTutorialPopupStyle_Corporate_BP_C::BackingBotLeft' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, BackingBotRight) == 0x000418, "Member 'UTutorialPopupStyle_Corporate_BP_C::BackingBotRight' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, BackingFill) == 0x000420, "Member 'UTutorialPopupStyle_Corporate_BP_C::BackingFill' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, BackingTopLeft) == 0x000428, "Member 'UTutorialPopupStyle_Corporate_BP_C::BackingTopLeft' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, BackingTopRight) == 0x000430, "Member 'UTutorialPopupStyle_Corporate_BP_C::BackingTopRight' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, Image_7) == 0x000438, "Member 'UTutorialPopupStyle_Corporate_BP_C::Image_7' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, Image_8) == 0x000440, "Member 'UTutorialPopupStyle_Corporate_BP_C::Image_8' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, InvalidationBox_0) == 0x000448, "Member 'UTutorialPopupStyle_Corporate_BP_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, OfferButtonContainerBox) == 0x000450, "Member 'UTutorialPopupStyle_Corporate_BP_C::OfferButtonContainerBox' has a wrong offset!");
static_assert(offsetof(UTutorialPopupStyle_Corporate_BP_C, BackingBotInst) == 0x000458, "Member 'UTutorialPopupStyle_Corporate_BP_C::BackingBotInst' has a wrong offset!");

}

