#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialPopupStyle_Corporate_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function TutorialPopupStyle_Corporate_BP.TutorialPopupStyle_Corporate_BP_C.ExecuteUbergraph_TutorialPopupStyle_Corporate_BP
// 0x0018 (0x0018 - 0x0000)
struct TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewHeight;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP) == 0x000008, "Wrong alignment on TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP");
static_assert(sizeof(TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP) == 0x000018, "Wrong size on TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP");
static_assert(offsetof(TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP, EntryPoint) == 0x000000, "Member 'TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP, K2Node_Event_NewHeight) == 0x000010, "Member 'TutorialPopupStyle_Corporate_BP_C_ExecuteUbergraph_TutorialPopupStyle_Corporate_BP::K2Node_Event_NewHeight' has a wrong offset!");

// Function TutorialPopupStyle_Corporate_BP.TutorialPopupStyle_Corporate_BP_C.SetNewBackingMaterialHeight
// 0x0004 (0x0004 - 0x0000)
struct TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight final
{
public:
	float                                         NewHeight;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight) == 0x000004, "Wrong alignment on TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight");
static_assert(sizeof(TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight) == 0x000004, "Wrong size on TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight");
static_assert(offsetof(TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight, NewHeight) == 0x000000, "Member 'TutorialPopupStyle_Corporate_BP_C_SetNewBackingMaterialHeight::NewHeight' has a wrong offset!");

}

