#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendingContainer_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Engine_structs.hpp"
#include "ContainerBase_BP_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass VendingContainer_BP.VendingContainer_BP_C
// 0x0248 (0x06F0 - 0x04A8)
class AVendingContainer_BP_C : public AContainerBase_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_VendingContainer_BP_C;              // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           akambient;                                         // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVendorComponent*                       Vendor;                                            // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hologram;                                          // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FConversationDescription               JingleConversation;                                // 0x04F8(0x01F8)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_VendingContainer_BP(int32 EntryPoint);
	void BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature(class AActor* Initiator);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VendingContainer_BP_C">();
	}
	static class AVendingContainer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVendingContainer_BP_C>();
	}
};
static_assert(alignof(AVendingContainer_BP_C) == 0x000008, "Wrong alignment on AVendingContainer_BP_C");
static_assert(sizeof(AVendingContainer_BP_C) == 0x0006F0, "Wrong size on AVendingContainer_BP_C");
static_assert(offsetof(AVendingContainer_BP_C, UberGraphFrame_VendingContainer_BP_C) == 0x0004A8, "Member 'AVendingContainer_BP_C::UberGraphFrame_VendingContainer_BP_C' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, akambient) == 0x0004B0, "Member 'AVendingContainer_BP_C::akambient' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, Vendor) == 0x0004B8, "Member 'AVendingContainer_BP_C::Vendor' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, SpotLight) == 0x0004C0, "Member 'AVendingContainer_BP_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, StaticMesh7) == 0x0004C8, "Member 'AVendingContainer_BP_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, StaticMesh4) == 0x0004D0, "Member 'AVendingContainer_BP_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, StaticMesh3) == 0x0004D8, "Member 'AVendingContainer_BP_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, StaticMesh2) == 0x0004E0, "Member 'AVendingContainer_BP_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, Hologram) == 0x0004E8, "Member 'AVendingContainer_BP_C::Hologram' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, Frame) == 0x0004F0, "Member 'AVendingContainer_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(AVendingContainer_BP_C, JingleConversation) == 0x0004F8, "Member 'AVendingContainer_BP_C::JingleConversation' has a wrong offset!");

}

