#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendingContainer_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function VendingContainer_BP.VendingContainer_BP_C.BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature final
{
public:
	class AActor*                                 Initiator;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature) == 0x000008, "Wrong alignment on VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature");
static_assert(sizeof(VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature) == 0x000008, "Wrong size on VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature");
static_assert(offsetof(VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature, Initiator) == 0x000000, "Member 'VendingContainer_BP_C_BndEvt__OCLComponent_K2Node_ComponentBoundEvent_0_OCLCloseStart__DelegateSignature::Initiator' has a wrong offset!");

// Function VendingContainer_BP.VendingContainer_BP_C.ExecuteUbergraph_VendingContainer_BP
// 0x0048 (0x0048 - 0x0000)
struct VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	ECheckBranches                                CallFunc_StartConversationByDescription_Branches;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversationByDescription_InstanceID; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversationByDescription_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_CanStartConversationByDescription_Branches; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartConversationByDescription_ReturnValue; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Initiator;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP) == 0x000008, "Wrong alignment on VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP");
static_assert(sizeof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP) == 0x000048, "Wrong size on VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, EntryPoint) == 0x000000, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, Temp_struct_Variable) == 0x000008, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, CallFunc_StartConversationByDescription_Branches) == 0x000018, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::CallFunc_StartConversationByDescription_Branches' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, CallFunc_StartConversationByDescription_InstanceID) == 0x00001C, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::CallFunc_StartConversationByDescription_InstanceID' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, CallFunc_StartConversationByDescription_ReturnValue) == 0x000020, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::CallFunc_StartConversationByDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, CallFunc_CanStartConversationByDescription_Branches) == 0x000021, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::CallFunc_CanStartConversationByDescription_Branches' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, CallFunc_CanStartConversationByDescription_ReturnValue) == 0x000022, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::CallFunc_CanStartConversationByDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000023, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x000024, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, Temp_delegate_Variable) == 0x000028, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000038, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP, K2Node_ComponentBoundEvent_Initiator) == 0x000040, "Member 'VendingContainer_BP_C_ExecuteUbergraph_VendingContainer_BP::K2Node_ComponentBoundEvent_Initiator' has a wrong offset!");

}

