#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendorWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VendorWidget_BP.VendorWidget_BP_C
// 0x0078 (0x0698 - 0x0620)
class UVendorWidget_BP_C final : public UVendorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PurchaseAnimation;                                 // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FactionImageFadeIn;                                // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackground1_BP_C*                      Background;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFlavorTextWidget_BP_C*                 FlavorTextWidget;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPageAnchor1_BP_C*                      PageAnchorLeft;                                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPageAnchor2_BP_C*                      PageAnchorRight;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PurchaseAnim1;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PurchaseAnim2;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smoke;                                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smoke_Behind;                                      // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USurvivalBarGroupWidget_BP_C*           SurvivalBar;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VendorWidget_BP(int32 EntryPoint);
	void OnAnimationSoldJunk();
	void OnAnimationSoldItem();
	void OnAnimationRepairedItem();
	void OnAnimationBoughtItem();
	void OnSetCurrentPage(EVendorPages Page, bool bAnimate);
	void FadeInFactionImage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VendorWidget_BP_C">();
	}
	static class UVendorWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVendorWidget_BP_C>();
	}
};
static_assert(alignof(UVendorWidget_BP_C) == 0x000008, "Wrong alignment on UVendorWidget_BP_C");
static_assert(sizeof(UVendorWidget_BP_C) == 0x000698, "Wrong size on UVendorWidget_BP_C");
static_assert(offsetof(UVendorWidget_BP_C, UberGraphFrame) == 0x000620, "Member 'UVendorWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, PurchaseAnimation) == 0x000628, "Member 'UVendorWidget_BP_C::PurchaseAnimation' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, FactionImageFadeIn) == 0x000630, "Member 'UVendorWidget_BP_C::FactionImageFadeIn' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, Background) == 0x000638, "Member 'UVendorWidget_BP_C::Background' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, FlavorTextWidget) == 0x000640, "Member 'UVendorWidget_BP_C::FlavorTextWidget' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, Image_0) == 0x000648, "Member 'UVendorWidget_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, Image_1) == 0x000650, "Member 'UVendorWidget_BP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, Image_2) == 0x000658, "Member 'UVendorWidget_BP_C::Image_2' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, PageAnchorLeft) == 0x000660, "Member 'UVendorWidget_BP_C::PageAnchorLeft' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, PageAnchorRight) == 0x000668, "Member 'UVendorWidget_BP_C::PageAnchorRight' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, PurchaseAnim1) == 0x000670, "Member 'UVendorWidget_BP_C::PurchaseAnim1' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, PurchaseAnim2) == 0x000678, "Member 'UVendorWidget_BP_C::PurchaseAnim2' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, Smoke) == 0x000680, "Member 'UVendorWidget_BP_C::Smoke' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, Smoke_Behind) == 0x000688, "Member 'UVendorWidget_BP_C::Smoke_Behind' has a wrong offset!");
static_assert(offsetof(UVendorWidget_BP_C, SurvivalBar) == 0x000690, "Member 'UVendorWidget_BP_C::SurvivalBar' has a wrong offset!");

}

