#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VideoScreen_ShipAI

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VideoScreen_ShipAI.VideoScreen_ShipAI_C
// 0x0130 (0x0510 - 0x03E0)
class UVideoScreen_ShipAI_C final : public UConversationInstance
{
public:
	class FName                                   ScreenState;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MaterialSlotName;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       Screen;                                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        PhineasCaptureActor;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        SophiaCaptureActor;                                // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        AntonCaptureActor;                                 // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentSpeaker;                                    // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FSpeakerGameDataReferenceID>    VideoScreenSpeakers;                               // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSpeakerGameDataReferenceID            ShipAISpeaker;                                     // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AZero001_ShipAI_C*                      SK_Screen;                                         // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        DockingAuthority_CaptureActor;                     // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        OrsonCaptureActor;                                 // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        ChairmanCaptureActor;                              // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        GrahamCaptureActor;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpeakerGameDataReferenceID            PlayerSpeaker;                                     // 0x0470(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     ScreenOnMaterial;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ScreenOffMaterial;                                 // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpeakerGameDataReferenceID            Player;                                            // 0x0498(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ship_ScreenOn;                                     // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ScreenOnSound;                                     // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ScreenOffSound;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        WealthyRecluseCaptureActor;                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        MissingPersonCaptureActor;                         // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        HPSWorkerCaptureActor;                             // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        SCFixerCaptureActor;                               // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        AdminCapture;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        ConstableCapture;                                  // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASceneCapture2D*                        SedrikCapture;                                     // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASceneCapture2D*>                AllCaptureActors;                                  // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	bool ConversationStarted(class AActor* Speaker, const struct FGuid& Guid, int32 NodeID);
	bool ConversationEnded(const struct FGuid& Guid);
	bool ConversationNodeChanged(class AActor* Character, class AActor* Camera, class AActor* Audio, int32 NodeID);
	void Play_Screen_On();
	void Play_Screen_Off();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VideoScreen_ShipAI_C">();
	}
	static class UVideoScreen_ShipAI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVideoScreen_ShipAI_C>();
	}
};
static_assert(alignof(UVideoScreen_ShipAI_C) == 0x000010, "Wrong alignment on UVideoScreen_ShipAI_C");
static_assert(sizeof(UVideoScreen_ShipAI_C) == 0x000510, "Wrong size on UVideoScreen_ShipAI_C");
static_assert(offsetof(UVideoScreen_ShipAI_C, ScreenState) == 0x0003E0, "Member 'UVideoScreen_ShipAI_C::ScreenState' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, MaterialSlotName) == 0x0003E8, "Member 'UVideoScreen_ShipAI_C::MaterialSlotName' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, Screen) == 0x0003F0, "Member 'UVideoScreen_ShipAI_C::Screen' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, PhineasCaptureActor) == 0x0003F8, "Member 'UVideoScreen_ShipAI_C::PhineasCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, SophiaCaptureActor) == 0x000400, "Member 'UVideoScreen_ShipAI_C::SophiaCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, AntonCaptureActor) == 0x000408, "Member 'UVideoScreen_ShipAI_C::AntonCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, CurrentSpeaker) == 0x000410, "Member 'UVideoScreen_ShipAI_C::CurrentSpeaker' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, VideoScreenSpeakers) == 0x000420, "Member 'UVideoScreen_ShipAI_C::VideoScreenSpeakers' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ShipAISpeaker) == 0x000430, "Member 'UVideoScreen_ShipAI_C::ShipAISpeaker' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, SK_Screen) == 0x000448, "Member 'UVideoScreen_ShipAI_C::SK_Screen' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, DockingAuthority_CaptureActor) == 0x000450, "Member 'UVideoScreen_ShipAI_C::DockingAuthority_CaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, OrsonCaptureActor) == 0x000458, "Member 'UVideoScreen_ShipAI_C::OrsonCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ChairmanCaptureActor) == 0x000460, "Member 'UVideoScreen_ShipAI_C::ChairmanCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, GrahamCaptureActor) == 0x000468, "Member 'UVideoScreen_ShipAI_C::GrahamCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, PlayerSpeaker) == 0x000470, "Member 'UVideoScreen_ShipAI_C::PlayerSpeaker' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ScreenOnMaterial) == 0x000488, "Member 'UVideoScreen_ShipAI_C::ScreenOnMaterial' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ScreenOffMaterial) == 0x000490, "Member 'UVideoScreen_ShipAI_C::ScreenOffMaterial' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, Player) == 0x000498, "Member 'UVideoScreen_ShipAI_C::Player' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ship_ScreenOn) == 0x0004B0, "Member 'UVideoScreen_ShipAI_C::ship_ScreenOn' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ScreenOnSound) == 0x0004B8, "Member 'UVideoScreen_ShipAI_C::ScreenOnSound' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ScreenOffSound) == 0x0004C0, "Member 'UVideoScreen_ShipAI_C::ScreenOffSound' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, WealthyRecluseCaptureActor) == 0x0004C8, "Member 'UVideoScreen_ShipAI_C::WealthyRecluseCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, MissingPersonCaptureActor) == 0x0004D0, "Member 'UVideoScreen_ShipAI_C::MissingPersonCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, HPSWorkerCaptureActor) == 0x0004D8, "Member 'UVideoScreen_ShipAI_C::HPSWorkerCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, SCFixerCaptureActor) == 0x0004E0, "Member 'UVideoScreen_ShipAI_C::SCFixerCaptureActor' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, AdminCapture) == 0x0004E8, "Member 'UVideoScreen_ShipAI_C::AdminCapture' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, ConstableCapture) == 0x0004F0, "Member 'UVideoScreen_ShipAI_C::ConstableCapture' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, SedrikCapture) == 0x0004F8, "Member 'UVideoScreen_ShipAI_C::SedrikCapture' has a wrong offset!");
static_assert(offsetof(UVideoScreen_ShipAI_C, AllCaptureActors) == 0x000500, "Member 'UVideoScreen_ShipAI_C::AllCaptureActors' has a wrong offset!");

}

