#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSelect_BP

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponSelect_BP.WeaponSelect_BP_C.ExecuteUbergraph_WeaponSelect_BP
// 0x0178 (0x0178 - 0x0000)
struct WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 WeaponIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bEquipped, int32 AmmoIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_2; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_3; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_4; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWeaponRadialBackgroundSection_BP_C*> K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_5; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_6; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWeaponRadialBackgroundSection_BP_C*> K2Node_MakeArray_Array_1;                          // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWeaponRadialBackgroundSection_BP_C*> K2Node_MakeArray_Array_2;                          // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_3;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAmmoSectionValid_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeaponSectionValid_ReturnValue;         // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSectionValid_ReturnValue;               // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Select_Default_5;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_Select_Default_6;                           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_WeaponIndex;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEquipped;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_AmmoIndex;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP) == 0x000008, "Wrong alignment on WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP");
static_assert(sizeof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP) == 0x000178, "Wrong size on WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, EntryPoint) == 0x000000, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable) == 0x000004, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_byte_Variable) == 0x000005, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_byte_Variable_1) == 0x000006, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable_1) == 0x000007, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_byte_Variable_2) == 0x000008, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_byte_Variable_3) == 0x000009, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable_2) == 0x00000A, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_byte_Variable_4) == 0x00000B, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_byte_Variable_5) == 0x00000C, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Event_MyGeometry) == 0x000030, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP) == 0x000070, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_1) == 0x000080, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_NormalizeAxis_ReturnValue) == 0x00008C, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Abs_ReturnValue) == 0x000090, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000094, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_MakeVector2D_ReturnValue) == 0x000098, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_2) == 0x0000A0, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_2' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_3) == 0x0000A8, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_3' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_4) == 0x0000B0, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_4' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_5) == 0x0000C8, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_5' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_6) == 0x0000D0, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_GetBackgroundSection_AsHUDRadial_Section_BP_6' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_MakeArray_Array_1) == 0x0000E0, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_MakeArray_Array_2) == 0x0000F0, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable_3) == 0x000100, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_int_Array_Index_Variable) == 0x000104, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Array_Get_Item) == 0x000108, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_IsAmmoSectionValid_ReturnValue) == 0x000110, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_IsAmmoSectionValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_IsWeaponSectionValid_ReturnValue) == 0x000111, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_IsWeaponSectionValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_IsSectionValid_ReturnValue) == 0x000112, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_IsSectionValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000113, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_BooleanAND_ReturnValue) == 0x000114, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default) == 0x000115, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000116, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000117, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_BooleanOR_ReturnValue) == 0x000118, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000119, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default_1) == 0x00011A, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default_2) == 0x00011B, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default_3) == 0x000120, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable_4) == 0x000128, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default_4) == 0x000130, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable_5) == 0x000138, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_bool_Variable_6) == 0x000139, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default_5) == 0x000140, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_Select_Default_6) == 0x000148, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000150, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000151, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_CustomEvent_WeaponIndex) == 0x000154, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_CustomEvent_WeaponIndex' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_CustomEvent_bEquipped) == 0x000158, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_CustomEvent_bEquipped' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_CustomEvent_AmmoIndex) == 0x00015C, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_CustomEvent_AmmoIndex' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_CustomEvent_Index) == 0x000160, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, Temp_int_Loop_Counter_Variable) == 0x000164, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000168, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000169, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP, K2Node_ComponentBoundEvent_Index) == 0x000170, "Member 'WeaponSelect_BP_C_ExecuteUbergraph_WeaponSelect_BP::K2Node_ComponentBoundEvent_Index' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature) == 0x000004, "Wrong alignment on WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature");
static_assert(sizeof(WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature) == 0x000004, "Wrong size on WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature");
static_assert(offsetof(WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature, Index_0) == 0x000000, "Member 'WeaponSelect_BP_C_BndEvt__Radial_K2Node_ComponentBoundEvent_1_SectionSelectedSignature__DelegateSignature::Index_0' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.OnSectionSelected
// 0x0004 (0x0004 - 0x0000)
struct WeaponSelect_BP_C_OnSectionSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_OnSectionSelected) == 0x000004, "Wrong alignment on WeaponSelect_BP_C_OnSectionSelected");
static_assert(sizeof(WeaponSelect_BP_C_OnSectionSelected) == 0x000004, "Wrong size on WeaponSelect_BP_C_OnSectionSelected");
static_assert(offsetof(WeaponSelect_BP_C_OnSectionSelected, Index_0) == 0x000000, "Member 'WeaponSelect_BP_C_OnSectionSelected::Index_0' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.OnSetAmmoEquippedDelegate_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0 final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmmoIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0) == 0x000004, "Wrong alignment on WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0");
static_assert(sizeof(WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0) == 0x000008, "Wrong size on WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0");
static_assert(offsetof(WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0, bEquipped) == 0x000000, "Member 'WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0::bEquipped' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0, AmmoIndex) == 0x000004, "Member 'WeaponSelect_BP_C_OnSetAmmoEquippedDelegate_Event_0::AmmoIndex' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.OnSetWeaponEquippedDelegate_Event_0
// 0x0004 (0x0004 - 0x0000)
struct WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0 final
{
public:
	int32                                         WeaponIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0) == 0x000004, "Wrong alignment on WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0");
static_assert(sizeof(WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0) == 0x000004, "Wrong size on WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0");
static_assert(offsetof(WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0, WeaponIndex) == 0x000000, "Member 'WeaponSelect_BP_C_OnSetWeaponEquippedDelegate_Event_0::WeaponIndex' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.Tick
// 0x003C (0x003C - 0x0000)
struct WeaponSelect_BP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_Tick) == 0x000004, "Wrong alignment on WeaponSelect_BP_C_Tick");
static_assert(sizeof(WeaponSelect_BP_C_Tick) == 0x00003C, "Wrong size on WeaponSelect_BP_C_Tick");
static_assert(offsetof(WeaponSelect_BP_C_Tick, MyGeometry) == 0x000000, "Member 'WeaponSelect_BP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_Tick, InDeltaTime) == 0x000038, "Member 'WeaponSelect_BP_C_Tick::InDeltaTime' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.OnIntro
// 0x0014 (0x0014 - 0x0000)
struct WeaponSelect_BP_C_OnIntro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSelect_BP_C_OnIntro) == 0x000004, "Wrong alignment on WeaponSelect_BP_C_OnIntro");
static_assert(sizeof(WeaponSelect_BP_C_OnIntro) == 0x000014, "Wrong size on WeaponSelect_BP_C_OnIntro");
static_assert(offsetof(WeaponSelect_BP_C_OnIntro, AnimationCompleteCallback) == 0x000000, "Member 'WeaponSelect_BP_C_OnIntro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_OnIntro, ReturnValue) == 0x000010, "Member 'WeaponSelect_BP_C_OnIntro::ReturnValue' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.GetBackgroundSection
// 0x0020 (0x0020 - 0x0000)
struct WeaponSelect_BP_C_GetBackgroundSection final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    AsHUDRadial_Section_BP;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponRadialBackgroundSection_BP_C*    K2Node_DynamicCast_AsWeapon_Radial_Background_Section_BP; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSelect_BP_C_GetBackgroundSection) == 0x000008, "Wrong alignment on WeaponSelect_BP_C_GetBackgroundSection");
static_assert(sizeof(WeaponSelect_BP_C_GetBackgroundSection) == 0x000020, "Wrong size on WeaponSelect_BP_C_GetBackgroundSection");
static_assert(offsetof(WeaponSelect_BP_C_GetBackgroundSection, Object) == 0x000000, "Member 'WeaponSelect_BP_C_GetBackgroundSection::Object' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_GetBackgroundSection, AsHUDRadial_Section_BP) == 0x000008, "Member 'WeaponSelect_BP_C_GetBackgroundSection::AsHUDRadial_Section_BP' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_GetBackgroundSection, K2Node_DynamicCast_AsWeapon_Radial_Background_Section_BP) == 0x000010, "Member 'WeaponSelect_BP_C_GetBackgroundSection::K2Node_DynamicCast_AsWeapon_Radial_Background_Section_BP' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_GetBackgroundSection, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WeaponSelect_BP_C_GetBackgroundSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.UpdateBackgroundVisibility
// 0x0030 (0x0030 - 0x0000)
struct WeaponSelect_BP_C_UpdateBackgroundVisibility final
{
public:
	TArray<class UWeaponRadialBackgroundSection_BP_C*> TargetArray;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         IndexToTest;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_UpdateBackgroundVisibility) == 0x000008, "Wrong alignment on WeaponSelect_BP_C_UpdateBackgroundVisibility");
static_assert(sizeof(WeaponSelect_BP_C_UpdateBackgroundVisibility) == 0x000030, "Wrong size on WeaponSelect_BP_C_UpdateBackgroundVisibility");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, TargetArray) == 0x000000, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::TargetArray' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, IndexToTest) == 0x000010, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::IndexToTest' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_UpdateBackgroundVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WeaponSelect_BP_C_UpdateBackgroundVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WeaponSelect_BP.WeaponSelect_BP_C.SetBackgroundVisibility
// 0x0028 (0x0028 - 0x0000)
struct WeaponSelect_BP_C_SetBackgroundVisibility final
{
public:
	TArray<class UWeaponRadialBackgroundSection_BP_C*> Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponRadialBackgroundSection_BP_C*    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSelect_BP_C_SetBackgroundVisibility) == 0x000008, "Wrong alignment on WeaponSelect_BP_C_SetBackgroundVisibility");
static_assert(sizeof(WeaponSelect_BP_C_SetBackgroundVisibility) == 0x000028, "Wrong size on WeaponSelect_BP_C_SetBackgroundVisibility");
static_assert(offsetof(WeaponSelect_BP_C_SetBackgroundVisibility, Array) == 0x000000, "Member 'WeaponSelect_BP_C_SetBackgroundVisibility::Array' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_SetBackgroundVisibility, Index_0) == 0x000010, "Member 'WeaponSelect_BP_C_SetBackgroundVisibility::Index_0' has a wrong offset!");
static_assert(offsetof(WeaponSelect_BP_C_SetBackgroundVisibility, Enabled) == 0x000014, "Member 'WeaponSelect_BP_C_SetBackgroundVisibility::Enabled' has a wrong offset!");
