#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkbenchBase_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WorkbenchBase_BP.WorkbenchBase_BP_C.ExecuteUbergraph_WorkbenchBase_BP
// 0x00A8 (0x00A8 - 0x0000)
struct WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP) == 0x000004, "Wrong alignment on WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP");
static_assert(sizeof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP) == 0x0000A8, "Wrong size on WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP");
static_assert(offsetof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP, EntryPoint) == 0x000000, "Member 'WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000014, "Member 'WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000020, "Member 'WorkbenchBase_BP_C_ExecuteUbergraph_WorkbenchBase_BP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");

// Function WorkbenchBase_BP.WorkbenchBase_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WorkbenchBase_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkbenchBase_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on WorkbenchBase_BP_C_ReceiveTick");
static_assert(sizeof(WorkbenchBase_BP_C_ReceiveTick) == 0x000004, "Wrong size on WorkbenchBase_BP_C_ReceiveTick");
static_assert(offsetof(WorkbenchBase_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WorkbenchBase_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

