#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_FX_Deserter_Town

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 0001_FX_Deserter_Town.0001_FX_Deserter_Town_C
// 0x0048 (0x0308 - 0x02C0)
class AZero001_FX_Deserter_Town_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Mister_C*                           BP_Mister5_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister6_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister7_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister8_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister4_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister3_2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mister_C*                           BP_Mister_2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_0001_FX_Deserter_Town(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"0001_FX_Deserter_Town_C">();
	}
	static class AZero001_FX_Deserter_Town_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero001_FX_Deserter_Town_C>();
	}
};
static_assert(alignof(AZero001_FX_Deserter_Town_C) == 0x000008, "Wrong alignment on AZero001_FX_Deserter_Town_C");
static_assert(sizeof(AZero001_FX_Deserter_Town_C) == 0x000308, "Wrong size on AZero001_FX_Deserter_Town_C");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, UberGraphFrame) == 0x0002C0, "Member 'AZero001_FX_Deserter_Town_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister5_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002C8, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister5_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister6_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002D0, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister6_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister7_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002D8, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister7_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister8_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002E0, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister8_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister4_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002E8, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister4_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister3_2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002F0, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister3_2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x0002F8, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_FX_Deserter_Town_C, BP_Mister_2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty) == 0x000300, "Member 'AZero001_FX_Deserter_Town_C::BP_Mister_2_ExecuteUbergraph_0001_FX_Deserter_Town_RefProperty' has a wrong offset!");

}

