#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero006_SD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function 0006_SD.0006_SD_C.ExecuteUbergraph_0006_SD
// 0x0014 (0x0014 - 0x0000)
struct Zero006_SD_C_ExecuteUbergraph_0006_SD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero006_SD_C_ExecuteUbergraph_0006_SD) == 0x000004, "Wrong alignment on Zero006_SD_C_ExecuteUbergraph_0006_SD");
static_assert(sizeof(Zero006_SD_C_ExecuteUbergraph_0006_SD) == 0x000014, "Wrong size on Zero006_SD_C_ExecuteUbergraph_0006_SD");
static_assert(offsetof(Zero006_SD_C_ExecuteUbergraph_0006_SD, EntryPoint) == 0x000000, "Member 'Zero006_SD_C_ExecuteUbergraph_0006_SD::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero006_SD_C_ExecuteUbergraph_0006_SD, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Zero006_SD_C_ExecuteUbergraph_0006_SD::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero006_SD_C_ExecuteUbergraph_0006_SD, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'Zero006_SD_C_ExecuteUbergraph_0006_SD::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

}

