#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero006_SCR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Indiana_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass 0006_SCR.0006_SCR_C
// 0x0020 (0x02E0 - 0x02C0)
class AZero006_SCR_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AEncounter*                             Enc_Marauders2_ExecuteUbergraph_0006_SCR_RefProperty; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEncounter*                             Enc_Marauders1_ExecuteUbergraph_0006_SCR_RefProperty; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABarkVolume_Companion_Generic_C*        BarkVolume_Companion_Generic_2_ExecuteUbergraph_0006_SCR_RefProperty; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__PKUP_Ellie_Saber_2_K2Node_ActorBoundEvent_2_OnPickup__DelegateSignature(class AActor* Initiator);
	void BndEvt__SQ_0001_Abernathy_Medicine_Pickup_2_K2Node_ActorBoundEvent_3_OnPickup__DelegateSignature(class AActor* Initiator);
	void ReceiveBeginPlay();
	void BndEvt__DOOR_first_aid_room_K2Node_ActorBoundEvent_4_OCLUnlocked__DelegateSignature(class AActor* Initiator);
	void BndEvt__Enc_Marauders1_K2Node_ActorBoundEvent_0_EncounterComplete__DelegateSignature();
	void BndEvt__Enc_Marauders2_K2Node_ActorBoundEvent_5_EncounterComplete__DelegateSignature();
	void BndEvt__SQ_0005_ThomasBook01_Pickup_26_K2Node_ActorBoundEvent_0_OnPickup__DelegateSignature(class AActor* Initiator);
	void ExecuteUbergraph_0006_SCR(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"0006_SCR_C">();
	}
	static class AZero006_SCR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero006_SCR_C>();
	}
};
static_assert(alignof(AZero006_SCR_C) == 0x000008, "Wrong alignment on AZero006_SCR_C");
static_assert(sizeof(AZero006_SCR_C) == 0x0002E0, "Wrong size on AZero006_SCR_C");
static_assert(offsetof(AZero006_SCR_C, UberGraphFrame) == 0x0002C0, "Member 'AZero006_SCR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero006_SCR_C, Enc_Marauders2_ExecuteUbergraph_0006_SCR_RefProperty) == 0x0002C8, "Member 'AZero006_SCR_C::Enc_Marauders2_ExecuteUbergraph_0006_SCR_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero006_SCR_C, Enc_Marauders1_ExecuteUbergraph_0006_SCR_RefProperty) == 0x0002D0, "Member 'AZero006_SCR_C::Enc_Marauders1_ExecuteUbergraph_0006_SCR_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero006_SCR_C, BarkVolume_Companion_Generic_2_ExecuteUbergraph_0006_SCR_RefProperty) == 0x0002D8, "Member 'AZero006_SCR_C::BarkVolume_Companion_Generic_2_ExecuteUbergraph_0006_SCR_RefProperty' has a wrong offset!");

}

