#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_FX

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function 0001_FX.0001_FX_C.ExecuteUbergraph_0001_FX
// 0x0050 (0x0050 - 0x0000)
struct Zero001_FX_C_ExecuteUbergraph_0001_FX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero001_FX_C_ExecuteUbergraph_0001_FX) == 0x000008, "Wrong alignment on Zero001_FX_C_ExecuteUbergraph_0001_FX");
static_assert(sizeof(Zero001_FX_C_ExecuteUbergraph_0001_FX) == 0x000050, "Wrong size on Zero001_FX_C_ExecuteUbergraph_0001_FX");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, EntryPoint) == 0x000000, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_CustomEvent_OverlappedActor_1) == 0x000028, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_CustomEvent_OverlappedActor_1' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_CustomEvent_OtherActor_1) == 0x000030, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_CustomEvent_OverlappedActor) == 0x000038, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_CustomEvent_OtherActor) == 0x000040, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, CallFunc_IsGlobalValue_Result) == 0x000049, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::CallFunc_IsGlobalValue_Result' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, CallFunc_IsGlobalValue_ReturnValue) == 0x00004A, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::CallFunc_IsGlobalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_ExecuteUbergraph_0001_FX, K2Node_SwitchEnum_CmpSuccess) == 0x00004B, "Member 'Zero001_FX_C_ExecuteUbergraph_0001_FX::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function 0001_FX.0001_FX_C.Deactivate_Ash
// 0x0010 (0x0010 - 0x0000)
struct Zero001_FX_C_Deactivate_Ash final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_FX_C_Deactivate_Ash) == 0x000008, "Wrong alignment on Zero001_FX_C_Deactivate_Ash");
static_assert(sizeof(Zero001_FX_C_Deactivate_Ash) == 0x000010, "Wrong size on Zero001_FX_C_Deactivate_Ash");
static_assert(offsetof(Zero001_FX_C_Deactivate_Ash, OverlappedActor) == 0x000000, "Member 'Zero001_FX_C_Deactivate_Ash::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_Deactivate_Ash, OtherActor) == 0x000008, "Member 'Zero001_FX_C_Deactivate_Ash::OtherActor' has a wrong offset!");

// Function 0001_FX.0001_FX_C.Activate_Ash
// 0x0010 (0x0010 - 0x0000)
struct Zero001_FX_C_Activate_Ash final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_FX_C_Activate_Ash) == 0x000008, "Wrong alignment on Zero001_FX_C_Activate_Ash");
static_assert(sizeof(Zero001_FX_C_Activate_Ash) == 0x000010, "Wrong size on Zero001_FX_C_Activate_Ash");
static_assert(offsetof(Zero001_FX_C_Activate_Ash, OverlappedActor) == 0x000000, "Member 'Zero001_FX_C_Activate_Ash::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_FX_C_Activate_Ash, OtherActor) == 0x000008, "Member 'Zero001_FX_C_Activate_Ash::OtherActor' has a wrong offset!");

}

