#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_FX_Deserter_Town

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function 0001_FX_Deserter_Town.0001_FX_Deserter_Town_C.ExecuteUbergraph_0001_FX_Deserter_Town
// 0x000C (0x000C - 0x0000)
struct Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_1;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_1;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town) == 0x000004, "Wrong alignment on Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town");
static_assert(sizeof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town) == 0x00000C, "Wrong size on Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, EntryPoint) == 0x000000, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, CallFunc_IsGlobalValue_Result) == 0x000004, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::CallFunc_IsGlobalValue_Result' has a wrong offset!");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, CallFunc_IsGlobalValue_ReturnValue) == 0x000005, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::CallFunc_IsGlobalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, CallFunc_IsGlobalValue_Result_1) == 0x000007, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::CallFunc_IsGlobalValue_Result_1' has a wrong offset!");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, CallFunc_IsGlobalValue_ReturnValue_1) == 0x000008, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::CallFunc_IsGlobalValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town, K2Node_SwitchEnum_CmpSuccess_1) == 0x000009, "Member 'Zero001_FX_Deserter_Town_C_ExecuteUbergraph_0001_FX_Deserter_Town::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

