#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_LT

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 0001_LT.0001_LT_C
// 0x0040 (0x0300 - 0x02C0)
class AZero001_LT_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FParticleSysParam>              Exterior_Weather_Params_Default;                   // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FParticleSysParam>              Exterior_Weather_Params;                           // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_DynamicTOD_C*                       None_ExecuteUbergraph_0001_LT_RefProperty;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEVLightSwitch_C*                       Botanical_Lab_LightSwitch_EdGraph_0_RefProperty;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEVLightSwitch_C*                       EmeraldVale_LightSwitch_EdGraph_1_RefProperty;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_0001_LT(int32 EntryPoint);
	void WeatherStop();
	void ReceiveBeginPlay();
	void WeatherEnable();
	void HandleBotanicalLabLightingChanges();
	void HandleEdgewaterLightingChanges();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"0001_LT_C">();
	}
	static class AZero001_LT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero001_LT_C>();
	}
};
static_assert(alignof(AZero001_LT_C) == 0x000008, "Wrong alignment on AZero001_LT_C");
static_assert(sizeof(AZero001_LT_C) == 0x000300, "Wrong size on AZero001_LT_C");
static_assert(offsetof(AZero001_LT_C, UberGraphFrame) == 0x0002C0, "Member 'AZero001_LT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZero001_LT_C, Exterior_Weather_Params_Default) == 0x0002C8, "Member 'AZero001_LT_C::Exterior_Weather_Params_Default' has a wrong offset!");
static_assert(offsetof(AZero001_LT_C, Exterior_Weather_Params) == 0x0002D8, "Member 'AZero001_LT_C::Exterior_Weather_Params' has a wrong offset!");
static_assert(offsetof(AZero001_LT_C, None_ExecuteUbergraph_0001_LT_RefProperty) == 0x0002E8, "Member 'AZero001_LT_C::None_ExecuteUbergraph_0001_LT_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_LT_C, Botanical_Lab_LightSwitch_EdGraph_0_RefProperty) == 0x0002F0, "Member 'AZero001_LT_C::Botanical_Lab_LightSwitch_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AZero001_LT_C, EmeraldVale_LightSwitch_EdGraph_1_RefProperty) == 0x0002F8, "Member 'AZero001_LT_C::EmeraldVale_LightSwitch_EdGraph_1_RefProperty' has a wrong offset!");

}

