#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_OnStatusEffectApplied

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function Base_OnStatusEffectApplied.Base_OnStatusEffectApplied_C.RunDecisionTree
// 0x0098 (0x0098 - 0x0000)
struct Base_OnStatusEffectApplied_C_RunDecisionTree final
{
public:
	class AIndianaAiCharacter*                    Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EventType;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIEventInfo*                           EventInfo;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDecisionTreeRequestPriority                  OutPriority;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDecisionTreeRequestData*>       ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
	TArray<class UDecisionTreeRequestData*>       K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	class UAIEventInfo_StatusEffect*              K2Node_DynamicCast_AsAIEvent_Info_Status_Effect;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDecisionTreeRequestData*>       K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm)
	class UDisableStatusEffect*                   K2Node_DynamicCast_AsDisable_Status_Effect;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDecisionTreeRequestData*>       K2Node_MakeArray_Array_2;                          // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDecisionTreeRequestData*>       K2Node_MakeArray_Array_3;                          // 0x0088(0x0010)(ReferenceParm)
};
static_assert(alignof(Base_OnStatusEffectApplied_C_RunDecisionTree) == 0x000008, "Wrong alignment on Base_OnStatusEffectApplied_C_RunDecisionTree");
static_assert(sizeof(Base_OnStatusEffectApplied_C_RunDecisionTree) == 0x000098, "Wrong size on Base_OnStatusEffectApplied_C_RunDecisionTree");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, Owner) == 0x000000, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::Owner' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, EventType) == 0x000008, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::EventType' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, EventInfo) == 0x000010, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::EventInfo' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, OutPriority) == 0x000018, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::OutPriority' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, ReturnValue) == 0x000020, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_MakeArray_Array) == 0x000030, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_DynamicCast_AsAIEvent_Info_Status_Effect) == 0x000040, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_DynamicCast_AsAIEvent_Info_Status_Effect' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_MakeArray_Array_1) == 0x000050, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_DynamicCast_AsDisable_Status_Effect) == 0x000060, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_DynamicCast_AsDisable_Status_Effect' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_MakeArray_Array_2) == 0x000070, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000080, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000081, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_OnStatusEffectApplied_C_RunDecisionTree, K2Node_MakeArray_Array_3) == 0x000088, "Member 'Base_OnStatusEffectApplied_C_RunDecisionTree::K2Node_MakeArray_Array_3' has a wrong offset!");

}

