#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseCharacterDeath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BaseCharacterDeath.BaseCharacterDeath_C.ApplyDeathMaterials
// 0x0068 (0x0068 - 0x0000)
struct BaseCharacterDeath_C_ApplyDeathMaterials final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_2;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Death_Materials_Start_Transition;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_Death_Materials_Character_MIDs;           // 0x0050(0x0010)(ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_Death_Materials_Teeth_MID;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_ApplyDeathMaterials) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_ApplyDeathMaterials");
static_assert(sizeof(BaseCharacterDeath_C_ApplyDeathMaterials) == 0x000068, "Wrong size on BaseCharacterDeath_C_ApplyDeathMaterials");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, Temp_int_Variable) == 0x000000, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, Temp_int_Variable_1) == 0x000004, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, Temp_int_Variable_2) == 0x000010, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Add_IntInt_ReturnValue_2) == 0x000014, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Array_Get_Item) == 0x000018, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Array_Length_ReturnValue_2) == 0x000044, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Less_IntInt_ReturnValue_2) == 0x000048, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Death_Materials_Start_Transition) == 0x000049, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Death_Materials_Start_Transition' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Death_Materials_Character_MIDs) == 0x000050, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Death_Materials_Character_MIDs' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_ApplyDeathMaterials, CallFunc_Death_Materials_Teeth_MID) == 0x000060, "Member 'BaseCharacterDeath_C_ApplyDeathMaterials::CallFunc_Death_Materials_Teeth_MID' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.TriggerParticlesOnBreakSockets
// 0x0060 (0x0060 - 0x0000)
struct BaseCharacterDeath_C_TriggerParticlesOnBreakSockets final
{
public:
	bool                                          TriggerImpactSpray;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachedSocket;                                    // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DetachedSocket;                                    // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnPooledEmitterAttached_ReturnValue_2; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_TriggerParticlesOnBreakSockets");
static_assert(sizeof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets) == 0x000060, "Wrong size on BaseCharacterDeath_C_TriggerParticlesOnBreakSockets");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, TriggerImpactSpray) == 0x000000, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::TriggerImpactSpray' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, AttachedSocket) == 0x000004, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::AttachedSocket' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, DetachedSocket) == 0x00000C, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::DetachedSocket' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_MakeLiteralByte_ReturnValue) == 0x000014, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000015, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Array_Get_Item) == 0x000020, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_SpawnPooledEmitterAttached_ReturnValue) == 0x000030, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_SpawnPooledEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_MakeLiteralInt_ReturnValue) == 0x00003C, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_SpawnPooledEmitterAttached_ReturnValue_1) == 0x000040, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_SpawnPooledEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000049, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00004C, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnBreakSockets, CallFunc_SpawnPooledEmitterAttached_ReturnValue_2) == 0x000058, "Member 'BaseCharacterDeath_C_TriggerParticlesOnBreakSockets::CallFunc_SpawnPooledEmitterAttached_ReturnValue_2' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.FindAndPostAudioEvents
// 0x0010 (0x0010 - 0x0000)
struct BaseCharacterDeath_C_FindAndPostAudioEvents final
{
public:
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_FindAndPostAudioEvents) == 0x000004, "Wrong alignment on BaseCharacterDeath_C_FindAndPostAudioEvents");
static_assert(sizeof(BaseCharacterDeath_C_FindAndPostAudioEvents) == 0x000010, "Wrong size on BaseCharacterDeath_C_FindAndPostAudioEvents");
static_assert(offsetof(BaseCharacterDeath_C_FindAndPostAudioEvents, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000000, "Member 'BaseCharacterDeath_C_FindAndPostAudioEvents::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_FindAndPostAudioEvents, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x000008, "Member 'BaseCharacterDeath_C_FindAndPostAudioEvents::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.CalcBodyTypeImpact
// 0x0090 (0x0090 - 0x0000)
struct BaseCharacterDeath_C_CalcBodyTypeImpact final
{
public:
	class UClass*                                 NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaAiCharacter*                    K2Node_DynamicCast_AsIndiana_Ai_Character;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaAiCharacter*                    K2Node_DynamicCast_AsIndiana_Ai_Character_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcImpactVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_CalcBodyTypeImpact) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_CalcBodyTypeImpact");
static_assert(sizeof(BaseCharacterDeath_C_CalcBodyTypeImpact) == 0x000090, "Wrong size on BaseCharacterDeath_C_CalcBodyTypeImpact");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, NewLocalVar_0) == 0x000000, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, K2Node_DynamicCast_AsIndiana_Ai_Character) == 0x000010, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::K2Node_DynamicCast_AsIndiana_Ai_Character' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000028, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, K2Node_DynamicCast_AsIndiana_Ai_Character_1) == 0x000038, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::K2Node_DynamicCast_AsIndiana_Ai_Character_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000041, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000042, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x000043, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_BooleanOR_ReturnValue) == 0x000044, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_BooleanAND_ReturnValue) == 0x000045, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x00004C, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_CalcImpactVector_ReturnValue) == 0x000050, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_CalcImpactVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_BreakVector_X) == 0x00005C, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_BreakVector_Y) == 0x000060, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_BreakVector_Z) == 0x000064, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_Divide_VectorInt_ReturnValue) == 0x000068, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_Divide_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_Abs_ReturnValue) == 0x000074, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CalcBodyTypeImpact, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000084, "Member 'BaseCharacterDeath_C_CalcBodyTypeImpact::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.TriggerParticlesOnSpine
// 0x0030 (0x0030 - 0x0000)
struct BaseCharacterDeath_C_TriggerParticlesOnSpine final
{
public:
	class UParticleSystem*                        EmitterTemplate;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_TriggerParticlesOnSpine) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_TriggerParticlesOnSpine");
static_assert(sizeof(BaseCharacterDeath_C_TriggerParticlesOnSpine) == 0x000030, "Wrong size on BaseCharacterDeath_C_TriggerParticlesOnSpine");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnSpine, EmitterTemplate) == 0x000000, "Member 'BaseCharacterDeath_C_TriggerParticlesOnSpine::EmitterTemplate' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnSpine, CallFunc_GetCenterOfMass_ReturnValue) == 0x000008, "Member 'BaseCharacterDeath_C_TriggerParticlesOnSpine::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnSpine, CallFunc_FindClosestBone_K2_BoneLocation) == 0x000014, "Member 'BaseCharacterDeath_C_TriggerParticlesOnSpine::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnSpine, CallFunc_FindClosestBone_K2_ReturnValue) == 0x000020, "Member 'BaseCharacterDeath_C_TriggerParticlesOnSpine::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerParticlesOnSpine, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000028, "Member 'BaseCharacterDeath_C_TriggerParticlesOnSpine::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.CreateAshPile
// 0x0020 (0x0020 - 0x0000)
struct BaseCharacterDeath_C_CreateAshPile final
{
public:
	class UStaticMesh*                            LootablePile;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LootablePileMaterial;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Ash_MID;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_SpawnAshPile_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_CreateAshPile) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_CreateAshPile");
static_assert(sizeof(BaseCharacterDeath_C_CreateAshPile) == 0x000020, "Wrong size on BaseCharacterDeath_C_CreateAshPile");
static_assert(offsetof(BaseCharacterDeath_C_CreateAshPile, LootablePile) == 0x000000, "Member 'BaseCharacterDeath_C_CreateAshPile::LootablePile' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CreateAshPile, LootablePileMaterial) == 0x000008, "Member 'BaseCharacterDeath_C_CreateAshPile::LootablePileMaterial' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CreateAshPile, Ash_MID) == 0x000010, "Member 'BaseCharacterDeath_C_CreateAshPile::Ash_MID' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_CreateAshPile, CallFunc_SpawnAshPile_ReturnValue) == 0x000018, "Member 'BaseCharacterDeath_C_CreateAshPile::CallFunc_SpawnAshPile_ReturnValue' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.UpdateTransitionCompletionDelay
// 0x000C (0x000C - 0x0000)
struct BaseCharacterDeath_C_UpdateTransitionCompletionDelay final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_UpdateTransitionCompletionDelay) == 0x000004, "Wrong alignment on BaseCharacterDeath_C_UpdateTransitionCompletionDelay");
static_assert(sizeof(BaseCharacterDeath_C_UpdateTransitionCompletionDelay) == 0x00000C, "Wrong size on BaseCharacterDeath_C_UpdateTransitionCompletionDelay");
static_assert(offsetof(BaseCharacterDeath_C_UpdateTransitionCompletionDelay, Delta) == 0x000000, "Member 'BaseCharacterDeath_C_UpdateTransitionCompletionDelay::Delta' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdateTransitionCompletionDelay, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'BaseCharacterDeath_C_UpdateTransitionCompletionDelay::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdateTransitionCompletionDelay, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'BaseCharacterDeath_C_UpdateTransitionCompletionDelay::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.UpdatePileDissolve
// 0x0020 (0x0020 - 0x0000)
struct BaseCharacterDeath_C_UpdatePileDissolve final
{
public:
	float                                         CurrentTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveDuration;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_UpdatePileDissolve) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_UpdatePileDissolve");
static_assert(sizeof(BaseCharacterDeath_C_UpdatePileDissolve) == 0x000020, "Wrong size on BaseCharacterDeath_C_UpdatePileDissolve");
static_assert(offsetof(BaseCharacterDeath_C_UpdatePileDissolve, CurrentTime) == 0x000000, "Member 'BaseCharacterDeath_C_UpdatePileDissolve::CurrentTime' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdatePileDissolve, DissolveDuration) == 0x000004, "Member 'BaseCharacterDeath_C_UpdatePileDissolve::DissolveDuration' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdatePileDissolve, Material) == 0x000008, "Member 'BaseCharacterDeath_C_UpdatePileDissolve::Material' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdatePileDissolve, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'BaseCharacterDeath_C_UpdatePileDissolve::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdatePileDissolve, CallFunc_MapRangeClamped_ReturnValue) == 0x000014, "Member 'BaseCharacterDeath_C_UpdatePileDissolve::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_UpdatePileDissolve, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BaseCharacterDeath_C_UpdatePileDissolve::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.TriggerNiagaraDeathParticles
// 0x0070 (0x0070 - 0x0000)
struct BaseCharacterDeath_C_TriggerNiagaraDeathParticles final
{
public:
	class UNiagaraSystem*                         SystemTemplate;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetAllAppearanceRelatedMeshes_Meshes;     // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_TriggerNiagaraDeathParticles");
static_assert(sizeof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles) == 0x000070, "Wrong size on BaseCharacterDeath_C_TriggerNiagaraDeathParticles");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, SystemTemplate) == 0x000000, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::SystemTemplate' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, Temp_int_Variable) == 0x000008, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_GetAllAppearanceRelatedMeshes_Meshes) == 0x000010, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_GetAllAppearanceRelatedMeshes_Meshes' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Array_Get_Item) == 0x000028, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000030, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000040, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Contains_ReturnValue) == 0x00005C, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Contains_ReturnValue_1) == 0x000064, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Contains_ReturnValue_2) == 0x000065, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_BooleanOR_ReturnValue) == 0x000066, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_Array_LastIndex_ReturnValue) == 0x000068, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_BooleanOR_ReturnValue_1) == 0x00006C, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathParticles, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006D, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathParticles::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BaseCharacterDeath.BaseCharacterDeath_C.TriggerNiagaraDeathAOE
// 0x0038 (0x0038 - 0x0000)
struct BaseCharacterDeath_C_TriggerNiagaraDeathAOE final
{
public:
	class UNiagaraSystem*                         SystemTemplate;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseCharacterDeath_C_TriggerNiagaraDeathAOE) == 0x000008, "Wrong alignment on BaseCharacterDeath_C_TriggerNiagaraDeathAOE");
static_assert(sizeof(BaseCharacterDeath_C_TriggerNiagaraDeathAOE) == 0x000038, "Wrong size on BaseCharacterDeath_C_TriggerNiagaraDeathAOE");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathAOE, SystemTemplate) == 0x000000, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathAOE::SystemTemplate' has a wrong offset!");
static_assert(offsetof(BaseCharacterDeath_C_TriggerNiagaraDeathAOE, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'BaseCharacterDeath_C_TriggerNiagaraDeathAOE::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
