#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Beam_Launcher_Abstract

#include "Basic.hpp"


namespace SDK::Params
{

// Function Beam_Launcher_Abstract.Beam_Launcher_Abstract_C.ExecuteUbergraph_Beam_Launcher_Abstract
// 0x0050 (0x0050 - 0x0000)
struct Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Instigator)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Instigator)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Instigator_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract) == 0x000008, "Wrong alignment on Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract");
static_assert(sizeof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract) == 0x000050, "Wrong size on Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, EntryPoint) == 0x000000, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::EntryPoint' has a wrong offset!");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, K2Node_CustomEvent_Instigator_1) == 0x000038, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::K2Node_CustomEvent_Instigator_1' has a wrong offset!");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, K2Node_CustomEvent_Instigator) == 0x000040, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000048, "Member 'Beam_Launcher_Abstract_C_ExecuteUbergraph_Beam_Launcher_Abstract::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function Beam_Launcher_Abstract.Beam_Launcher_Abstract_C.OnDestructibleDestroyed_Event_Base
// 0x0008 (0x0008 - 0x0000)
struct Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base) == 0x000008, "Wrong alignment on Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base");
static_assert(sizeof(Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base) == 0x000008, "Wrong size on Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base");
static_assert(offsetof(Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base, Instigator_0) == 0x000000, "Member 'Beam_Launcher_Abstract_C_OnDestructibleDestroyed_Event_Base::Instigator_0' has a wrong offset!");

// Function Beam_Launcher_Abstract.Beam_Launcher_Abstract_C.OnDestructibleDamaged_Event_Base
// 0x0008 (0x0008 - 0x0000)
struct Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base) == 0x000008, "Wrong alignment on Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base");
static_assert(sizeof(Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base) == 0x000008, "Wrong size on Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base");
static_assert(offsetof(Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base, Instigator_0) == 0x000000, "Member 'Beam_Launcher_Abstract_C_OnDestructibleDamaged_Event_Base::Instigator_0' has a wrong offset!");

}

