#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Beam_Launcher_Abstract

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Beam_Launcher_Abstract.Beam_Launcher_Abstract_C
// 0x0028 (0x05D0 - 0x05A8)
class ABeam_Launcher_Abstract_C : public ABeamLauncher
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        EmissionPoint;                                     // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PS_Death;                                          // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PS_Offset;                                         // 0x05C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Beam_Launcher_Abstract(int32 EntryPoint);
	void OnDestructibleDestroyed_Event_Base(class AActor* Instigator_0);
	void OnDestructibleDamaged_Event_Base(class AActor* Instigator_0);
	void OnDestructiblePristine_Event_Base();
	void ReceiveDeployOrder();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Beam_Launcher_Abstract_C">();
	}
	static class ABeam_Launcher_Abstract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABeam_Launcher_Abstract_C>();
	}
};
static_assert(alignof(ABeam_Launcher_Abstract_C) == 0x000008, "Wrong alignment on ABeam_Launcher_Abstract_C");
static_assert(sizeof(ABeam_Launcher_Abstract_C) == 0x0005D0, "Wrong size on ABeam_Launcher_Abstract_C");
static_assert(offsetof(ABeam_Launcher_Abstract_C, UberGraphFrame) == 0x0005A8, "Member 'ABeam_Launcher_Abstract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABeam_Launcher_Abstract_C, EmissionPoint) == 0x0005B0, "Member 'ABeam_Launcher_Abstract_C::EmissionPoint' has a wrong offset!");
static_assert(offsetof(ABeam_Launcher_Abstract_C, PS_Death) == 0x0005B8, "Member 'ABeam_Launcher_Abstract_C::PS_Death' has a wrong offset!");
static_assert(offsetof(ABeam_Launcher_Abstract_C, PS_Offset) == 0x0005C0, "Member 'ABeam_Launcher_Abstract_C::PS_Offset' has a wrong offset!");

}

