#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Aurora_A

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Aurora_A.BP_Aurora_A_C.ExecuteUbergraph_BP_Aurora_A
// 0x002C (0x002C - 0x0000)
struct BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeTimeSeconds_1;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_FadeTimeSeconds;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReversing_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RuntimeCurveGetFloatValue_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A) == 0x000004, "Wrong alignment on BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A");
static_assert(sizeof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A) == 0x00002C, "Wrong size on BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, EntryPoint) == 0x000000, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, K2Node_CustomEvent_FadeTimeSeconds_1) == 0x000004, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::K2Node_CustomEvent_FadeTimeSeconds_1' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, K2Node_CustomEvent_FadeTimeSeconds) == 0x000010, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::K2Node_CustomEvent_FadeTimeSeconds' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000014, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_IsReversing_ReturnValue) == 0x00001C, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_IsReversing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_IsPlaying_ReturnValue) == 0x00001D, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000020, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A, CallFunc_RuntimeCurveGetFloatValue_ReturnValue) == 0x000028, "Member 'BP_Aurora_A_C_ExecuteUbergraph_BP_Aurora_A::CallFunc_RuntimeCurveGetFloatValue_ReturnValue' has a wrong offset!");

// Function BP_Aurora_A.BP_Aurora_A_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Aurora_A_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Aurora_A_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Aurora_A_C_ReceiveTick");
static_assert(sizeof(BP_Aurora_A_C_ReceiveTick) == 0x000004, "Wrong size on BP_Aurora_A_C_ReceiveTick");
static_assert(offsetof(BP_Aurora_A_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Aurora_A_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Aurora_A.BP_Aurora_A_C.FadeIn
// 0x0004 (0x0004 - 0x0000)
struct BP_Aurora_A_C_FadeIn final
{
public:
	float                                         FadeTimeSeconds;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Aurora_A_C_FadeIn) == 0x000004, "Wrong alignment on BP_Aurora_A_C_FadeIn");
static_assert(sizeof(BP_Aurora_A_C_FadeIn) == 0x000004, "Wrong size on BP_Aurora_A_C_FadeIn");
static_assert(offsetof(BP_Aurora_A_C_FadeIn, FadeTimeSeconds) == 0x000000, "Member 'BP_Aurora_A_C_FadeIn::FadeTimeSeconds' has a wrong offset!");

// Function BP_Aurora_A.BP_Aurora_A_C.FadeOut
// 0x0004 (0x0004 - 0x0000)
struct BP_Aurora_A_C_FadeOut final
{
public:
	float                                         FadeTimeSeconds;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Aurora_A_C_FadeOut) == 0x000004, "Wrong alignment on BP_Aurora_A_C_FadeOut");
static_assert(sizeof(BP_Aurora_A_C_FadeOut) == 0x000004, "Wrong size on BP_Aurora_A_C_FadeOut");
static_assert(offsetof(BP_Aurora_A_C_FadeOut, FadeTimeSeconds) == 0x000000, "Member 'BP_Aurora_A_C_FadeOut::FadeTimeSeconds' has a wrong offset!");

// Function BP_Aurora_A.BP_Aurora_A_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Aurora_A_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Aurora_A_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Aurora_A_C_UserConstructionScript");
static_assert(sizeof(BP_Aurora_A_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Aurora_A_C_UserConstructionScript");
static_assert(offsetof(BP_Aurora_A_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'BP_Aurora_A_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'BP_Aurora_A_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_Aurora_A_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Aurora_A_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_Aurora_A_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function BP_Aurora_A.BP_Aurora_A_C.Set Emissive
// 0x0004 (0x0004 - 0x0000)
struct BP_Aurora_A_C_Set_Emissive final
{
public:
	float                                         Emissive_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Aurora_A_C_Set_Emissive) == 0x000004, "Wrong alignment on BP_Aurora_A_C_Set_Emissive");
static_assert(sizeof(BP_Aurora_A_C_Set_Emissive) == 0x000004, "Wrong size on BP_Aurora_A_C_Set_Emissive");
static_assert(offsetof(BP_Aurora_A_C_Set_Emissive, Emissive_0) == 0x000000, "Member 'BP_Aurora_A_C_Set_Emissive::Emissive_0' has a wrong offset!");

}

