#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Cleo_CeilingLight_Dim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Cleo_CeilingLight_Dim.BP_Cleo_CeilingLight_Dim_C
// 0x0040 (0x02F8 - 0x02B8)
class ABP_Cleo_CeilingLight_Dim_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    Fog;                                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    PlayerLight;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Interior;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Player_Light_Position;                             // 0x02E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Cleo_CeilingLight_Dim(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Cleo_CeilingLight_Dim_C">();
	}
	static class ABP_Cleo_CeilingLight_Dim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Cleo_CeilingLight_Dim_C>();
	}
};
static_assert(alignof(ABP_Cleo_CeilingLight_Dim_C) == 0x000008, "Wrong alignment on ABP_Cleo_CeilingLight_Dim_C");
static_assert(sizeof(ABP_Cleo_CeilingLight_Dim_C) == 0x0002F8, "Wrong size on ABP_Cleo_CeilingLight_Dim_C");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_Cleo_CeilingLight_Dim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, Fog) == 0x0002C0, "Member 'ABP_Cleo_CeilingLight_Dim_C::Fog' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, PlayerLight) == 0x0002C8, "Member 'ABP_Cleo_CeilingLight_Dim_C::PlayerLight' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, Interior) == 0x0002D0, "Member 'ABP_Cleo_CeilingLight_Dim_C::Interior' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, SpotLight1) == 0x0002D8, "Member 'ABP_Cleo_CeilingLight_Dim_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, StaticMesh) == 0x0002E0, "Member 'ABP_Cleo_CeilingLight_Dim_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, Player_Light_Position) == 0x0002E8, "Member 'ABP_Cleo_CeilingLight_Dim_C::Player_Light_Position' has a wrong offset!");
static_assert(offsetof(ABP_Cleo_CeilingLight_Dim_C, UseLight) == 0x0002F4, "Member 'ABP_Cleo_CeilingLight_Dim_C::UseLight' has a wrong offset!");

}

