#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENV_URB_Ext_EV_Stairs02_2m

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ENV_URB_Ext_EV_Stairs02_2m.BP_ENV_URB_Ext_EV_Stairs02_2m_C
// 0x0018 (0x02D0 - 0x02B8)
class ABP_ENV_URB_Ext_EV_Stairs02_2m_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ENV_URB_Ext_EV_Stairs02_2m;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ENV_URB_Ext_EV_Stairs02_2m_C">();
	}
	static class ABP_ENV_URB_Ext_EV_Stairs02_2m_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ENV_URB_Ext_EV_Stairs02_2m_C>();
	}
};
static_assert(alignof(ABP_ENV_URB_Ext_EV_Stairs02_2m_C) == 0x000008, "Wrong alignment on ABP_ENV_URB_Ext_EV_Stairs02_2m_C");
static_assert(sizeof(ABP_ENV_URB_Ext_EV_Stairs02_2m_C) == 0x0002D0, "Wrong size on ABP_ENV_URB_Ext_EV_Stairs02_2m_C");
static_assert(offsetof(ABP_ENV_URB_Ext_EV_Stairs02_2m_C, Box) == 0x0002B8, "Member 'ABP_ENV_URB_Ext_EV_Stairs02_2m_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ENV_URB_Ext_EV_Stairs02_2m_C, ENV_URB_Ext_EV_Stairs02_2m) == 0x0002C0, "Member 'ABP_ENV_URB_Ext_EV_Stairs02_2m_C::ENV_URB_Ext_EV_Stairs02_2m' has a wrong offset!");
static_assert(offsetof(ABP_ENV_URB_Ext_EV_Stairs02_2m_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_ENV_URB_Ext_EV_Stairs02_2m_C::DefaultSceneRoot' has a wrong offset!");

}

