#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MID_Creation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MID_Creation.BP_MID_Creation_C
// 0x0100 (0x03B8 - 0x02B8)
class ABP_MID_Creation_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_Index;                                    // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Scalar_Param_Names;                                // 0x02F8(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 Scalar_Param_Value;                                // 0x0308(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Vector_Param_Names;                                // 0x0318(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   Vector_Param_Values;                               // 0x0328(0x0010)(Edit, BlueprintVisible)
	bool                                          Set_Values;                                        // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Static_Mesh;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_PS;                                            // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use_Static_Mesh;                                   // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        PS;                                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Params_To_Adjust;                                  // 0x0358(0x0010)(Edit, BlueprintVisible)
	bool                                          Use_Decal;                                         // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Actor_Param_Adjust;                                // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Param_Subtract;                                    // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Decal_Scale;                                       // 0x0370(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Tex_Param_Names;                                   // 0x0380(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture*>                       Textures;                                          // 0x0390(0x0010)(Edit, BlueprintVisible)
	bool                                          Grab_Triggers;                                     // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Trigger_Volume_Bound_C*>     Triggers;                                          // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MID_Creation(int32 EntryPoint);
	void Exited();
	void Entered();
	void Bind();
	void PS_MID_Creation();
	void MID_Param_Set();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Set_Material_Parameters();
	void Actor_Param_Adjustment();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MID_Creation_C">();
	}
	static class ABP_MID_Creation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MID_Creation_C>();
	}
};
static_assert(alignof(ABP_MID_Creation_C) == 0x000008, "Wrong alignment on ABP_MID_Creation_C");
static_assert(sizeof(ABP_MID_Creation_C) == 0x0003B8, "Wrong size on ABP_MID_Creation_C");
static_assert(offsetof(ABP_MID_Creation_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_MID_Creation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Decal) == 0x0002C0, "Member 'ABP_MID_Creation_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, ParticleSystem) == 0x0002C8, "Member 'ABP_MID_Creation_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, StaticMesh) == 0x0002D0, "Member 'ABP_MID_Creation_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Billboard) == 0x0002D8, "Member 'ABP_MID_Creation_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Material) == 0x0002E0, "Member 'ABP_MID_Creation_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Mid) == 0x0002E8, "Member 'ABP_MID_Creation_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Material_Index) == 0x0002F0, "Member 'ABP_MID_Creation_C::Material_Index' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Scalar_Param_Names) == 0x0002F8, "Member 'ABP_MID_Creation_C::Scalar_Param_Names' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Scalar_Param_Value) == 0x000308, "Member 'ABP_MID_Creation_C::Scalar_Param_Value' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Vector_Param_Names) == 0x000318, "Member 'ABP_MID_Creation_C::Vector_Param_Names' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Vector_Param_Values) == 0x000328, "Member 'ABP_MID_Creation_C::Vector_Param_Values' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Set_Values) == 0x000338, "Member 'ABP_MID_Creation_C::Set_Values' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Static_Mesh) == 0x000340, "Member 'ABP_MID_Creation_C::Static_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Use_PS) == 0x000348, "Member 'ABP_MID_Creation_C::Use_PS' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Use_Static_Mesh) == 0x000349, "Member 'ABP_MID_Creation_C::Use_Static_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, PS) == 0x000350, "Member 'ABP_MID_Creation_C::PS' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Params_To_Adjust) == 0x000358, "Member 'ABP_MID_Creation_C::Params_To_Adjust' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Use_Decal) == 0x000368, "Member 'ABP_MID_Creation_C::Use_Decal' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Actor_Param_Adjust) == 0x000369, "Member 'ABP_MID_Creation_C::Actor_Param_Adjust' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Param_Subtract) == 0x00036C, "Member 'ABP_MID_Creation_C::Param_Subtract' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Decal_Scale) == 0x000370, "Member 'ABP_MID_Creation_C::Decal_Scale' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Tex_Param_Names) == 0x000380, "Member 'ABP_MID_Creation_C::Tex_Param_Names' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Textures) == 0x000390, "Member 'ABP_MID_Creation_C::Textures' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Grab_Triggers) == 0x0003A0, "Member 'ABP_MID_Creation_C::Grab_Triggers' has a wrong offset!");
static_assert(offsetof(ABP_MID_Creation_C, Triggers) == 0x0003A8, "Member 'ABP_MID_Creation_C::Triggers' has a wrong offset!");

}

