#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RectLightTurnOff

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RectLightTurnOff.BP_RectLightTurnOff_C.ExecuteUbergraph_BP_RectLightTurnOff
// 0x0010 (0x0010 - 0x0000)
struct BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff) == 0x000004, "Wrong alignment on BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff");
static_assert(sizeof(BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff) == 0x000010, "Wrong size on BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff");
static_assert(offsetof(BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff, EntryPoint) == 0x000000, "Member 'BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_RectLightTurnOff_C_ExecuteUbergraph_BP_RectLightTurnOff::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_RectLightTurnOff.BP_RectLightTurnOff_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RectLightTurnOff_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RectLightTurnOff_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RectLightTurnOff_C_ReceiveTick");
static_assert(sizeof(BP_RectLightTurnOff_C_ReceiveTick) == 0x000004, "Wrong size on BP_RectLightTurnOff_C_ReceiveTick");
static_assert(offsetof(BP_RectLightTurnOff_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RectLightTurnOff_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

