#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Table_Tungsten

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Table_Tungsten.BP_Table_Tungsten_C
// 0x0038 (0x02F0 - 0x02B8)
class ABP_Table_Tungsten_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttenuationRadius;                                 // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightOn;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LightColor;                                        // 0x02D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightTemperature;                                  // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Table_Tungsten_C">();
	}
	static class ABP_Table_Tungsten_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Table_Tungsten_C>();
	}
};
static_assert(alignof(ABP_Table_Tungsten_C) == 0x000008, "Wrong alignment on ABP_Table_Tungsten_C");
static_assert(sizeof(ABP_Table_Tungsten_C) == 0x0002F0, "Wrong size on ABP_Table_Tungsten_C");
static_assert(offsetof(ABP_Table_Tungsten_C, PointLight) == 0x0002B8, "Member 'ABP_Table_Tungsten_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, StaticMesh) == 0x0002C0, "Member 'ABP_Table_Tungsten_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, Intensity) == 0x0002C8, "Member 'ABP_Table_Tungsten_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, AttenuationRadius) == 0x0002CC, "Member 'ABP_Table_Tungsten_C::AttenuationRadius' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, LightOn) == 0x0002D0, "Member 'ABP_Table_Tungsten_C::LightOn' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, LightColor) == 0x0002D4, "Member 'ABP_Table_Tungsten_C::LightColor' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, LightTemperature) == 0x0002E4, "Member 'ABP_Table_Tungsten_C::LightTemperature' has a wrong offset!");
static_assert(offsetof(ABP_Table_Tungsten_C, UseLight) == 0x0002E8, "Member 'ABP_Table_Tungsten_C::UseLight' has a wrong offset!");

}

