#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CauseDamageReticle_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function CauseDamageReticle_BP.CauseDamageReticle_BP_C.ExecuteUbergraph_CauseDamageReticle_BP
// 0x0020 (0x0020 - 0x0000)
struct CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP) == 0x000008, "Wrong alignment on CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP");
static_assert(sizeof(CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP) == 0x000020, "Wrong size on CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP");
static_assert(offsetof(CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP, EntryPoint) == 0x000000, "Member 'CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'CauseDamageReticle_BP_C_ExecuteUbergraph_CauseDamageReticle_BP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

