#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_Burn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CE_Burn.CE_Burn_C.ExecuteUbergraph_CE_Burn
// 0x0078 (0x0078 - 0x0000)
struct CE_Burn_C_ExecuteUbergraph_CE_Burn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Ratio;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRestoredFromSave;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaAiCharacter*                    K2Node_DynamicCast_AsIndiana_Ai_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CE_Burn_C_ExecuteUbergraph_CE_Burn) == 0x000008, "Wrong alignment on CE_Burn_C_ExecuteUbergraph_CE_Burn");
static_assert(sizeof(CE_Burn_C_ExecuteUbergraph_CE_Burn) == 0x000078, "Wrong size on CE_Burn_C_ExecuteUbergraph_CE_Burn");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, EntryPoint) == 0x000000, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::EntryPoint' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, K2Node_Event_Target) == 0x000008, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, K2Node_Event_Ratio) == 0x000010, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::K2Node_Event_Ratio' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, K2Node_Event_bRestoredFromSave) == 0x000014, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::K2Node_Event_bRestoredFromSave' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, K2Node_DynamicCast_AsIndiana_Ai_Character) == 0x000018, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::K2Node_DynamicCast_AsIndiana_Ai_Character' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_ClassIsChildOf_ReturnValue) == 0x000030, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000031, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000038, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, K2Node_Event_Target_1) == 0x000040, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_GetCenterOfMass_ReturnValue) == 0x000048, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_FindClosestBone_K2_BoneLocation) == 0x000054, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_FindClosestBone_K2_ReturnValue) == 0x000060, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000068, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ExecuteUbergraph_CE_Burn, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'CE_Burn_C_ExecuteUbergraph_CE_Burn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CE_Burn.CE_Burn_C.ReceiveApplyEffect
// 0x0010 (0x0010 - 0x0000)
struct CE_Burn_C_ReceiveApplyEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRestoredFromSave;                                 // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CE_Burn_C_ReceiveApplyEffect) == 0x000008, "Wrong alignment on CE_Burn_C_ReceiveApplyEffect");
static_assert(sizeof(CE_Burn_C_ReceiveApplyEffect) == 0x000010, "Wrong size on CE_Burn_C_ReceiveApplyEffect");
static_assert(offsetof(CE_Burn_C_ReceiveApplyEffect, Target) == 0x000000, "Member 'CE_Burn_C_ReceiveApplyEffect::Target' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ReceiveApplyEffect, Ratio) == 0x000008, "Member 'CE_Burn_C_ReceiveApplyEffect::Ratio' has a wrong offset!");
static_assert(offsetof(CE_Burn_C_ReceiveApplyEffect, bRestoredFromSave) == 0x00000C, "Member 'CE_Burn_C_ReceiveApplyEffect::bRestoredFromSave' has a wrong offset!");

// Function CE_Burn.CE_Burn_C.ReceiveClearEffect
// 0x0008 (0x0008 - 0x0000)
struct CE_Burn_C_ReceiveClearEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CE_Burn_C_ReceiveClearEffect) == 0x000008, "Wrong alignment on CE_Burn_C_ReceiveClearEffect");
static_assert(sizeof(CE_Burn_C_ReceiveClearEffect) == 0x000008, "Wrong size on CE_Burn_C_ReceiveClearEffect");
static_assert(offsetof(CE_Burn_C_ReceiveClearEffect, Target) == 0x000000, "Member 'CE_Burn_C_ReceiveClearEffect::Target' has a wrong offset!");

}

