#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_NRay_AoE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CE_NRay_AoE.CE_NRay_AoE_C.ExecuteUbergraph_CE_NRay_AoE
// 0x0090 (0x0090 - 0x0000)
struct CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Ratio;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRestoredFromSave;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	class UParticleSystemComponent*               CallFunc_GetComponentByTag_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE) == 0x000008, "Wrong alignment on CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE");
static_assert(sizeof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE) == 0x000090, "Wrong size on CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, EntryPoint) == 0x000000, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::EntryPoint' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, K2Node_Event_Target_1) == 0x000008, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, K2Node_Event_Target) == 0x000010, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, K2Node_Event_Ratio) == 0x000018, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::K2Node_Event_Ratio' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, K2Node_Event_bRestoredFromSave) == 0x00001C, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::K2Node_Event_bRestoredFromSave' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, K2Node_MakeArray_Array) == 0x000020, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_GetComponentByTag_ReturnValue) == 0x000030, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_GetComponentByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_GetObjectClass_ReturnValue) == 0x000038, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_ClassIsChildOf_ReturnValue) == 0x000041, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000048, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000050, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_GetCenterOfMass_ReturnValue) == 0x00005C, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_FindClosestBone_K2_BoneLocation) == 0x000068, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_FindClosestBone_K2_ReturnValue) == 0x000074, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000080, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'CE_NRay_AoE_C_ExecuteUbergraph_CE_NRay_AoE::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function CE_NRay_AoE.CE_NRay_AoE_C.ReceiveApplyEffect
// 0x0010 (0x0010 - 0x0000)
struct CE_NRay_AoE_C_ReceiveApplyEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRestoredFromSave;                                 // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CE_NRay_AoE_C_ReceiveApplyEffect) == 0x000008, "Wrong alignment on CE_NRay_AoE_C_ReceiveApplyEffect");
static_assert(sizeof(CE_NRay_AoE_C_ReceiveApplyEffect) == 0x000010, "Wrong size on CE_NRay_AoE_C_ReceiveApplyEffect");
static_assert(offsetof(CE_NRay_AoE_C_ReceiveApplyEffect, Target) == 0x000000, "Member 'CE_NRay_AoE_C_ReceiveApplyEffect::Target' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ReceiveApplyEffect, Ratio) == 0x000008, "Member 'CE_NRay_AoE_C_ReceiveApplyEffect::Ratio' has a wrong offset!");
static_assert(offsetof(CE_NRay_AoE_C_ReceiveApplyEffect, bRestoredFromSave) == 0x00000C, "Member 'CE_NRay_AoE_C_ReceiveApplyEffect::bRestoredFromSave' has a wrong offset!");

// Function CE_NRay_AoE.CE_NRay_AoE_C.ReceiveClearEffect
// 0x0008 (0x0008 - 0x0000)
struct CE_NRay_AoE_C_ReceiveClearEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CE_NRay_AoE_C_ReceiveClearEffect) == 0x000008, "Wrong alignment on CE_NRay_AoE_C_ReceiveClearEffect");
static_assert(sizeof(CE_NRay_AoE_C_ReceiveClearEffect) == 0x000008, "Wrong size on CE_NRay_AoE_C_ReceiveClearEffect");
static_assert(offsetof(CE_NRay_AoE_C_ReceiveClearEffect, Target) == 0x000000, "Member 'CE_NRay_AoE_C_ReceiveClearEffect::Target' has a wrong offset!");

}

