#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Compass_BP

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Compass_BP.Compass_BP_C.ExecuteUbergraph_Compass_BP
// 0x0058 (0x0058 - 0x0000)
struct Compass_BP_C_ExecuteUbergraph_Compass_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Compass_BP_C_ExecuteUbergraph_Compass_BP) == 0x000008, "Wrong alignment on Compass_BP_C_ExecuteUbergraph_Compass_BP");
static_assert(sizeof(Compass_BP_C_ExecuteUbergraph_Compass_BP) == 0x000058, "Wrong size on Compass_BP_C_ExecuteUbergraph_Compass_BP");
static_assert(offsetof(Compass_BP_C_ExecuteUbergraph_Compass_BP, EntryPoint) == 0x000000, "Member 'Compass_BP_C_ExecuteUbergraph_Compass_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Compass_BP_C_ExecuteUbergraph_Compass_BP, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'Compass_BP_C_ExecuteUbergraph_Compass_BP::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Compass_BP_C_ExecuteUbergraph_Compass_BP, K2Node_Event_MyGeometry) == 0x000010, "Member 'Compass_BP_C_ExecuteUbergraph_Compass_BP::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Compass_BP_C_ExecuteUbergraph_Compass_BP, K2Node_Event_InDeltaTime) == 0x000048, "Member 'Compass_BP_C_ExecuteUbergraph_Compass_BP::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Compass_BP_C_ExecuteUbergraph_Compass_BP, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000050, "Member 'Compass_BP_C_ExecuteUbergraph_Compass_BP::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function Compass_BP.Compass_BP_C.Tick
// 0x003C (0x003C - 0x0000)
struct Compass_BP_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Compass_BP_C_Tick) == 0x000004, "Wrong alignment on Compass_BP_C_Tick");
static_assert(sizeof(Compass_BP_C_Tick) == 0x00003C, "Wrong size on Compass_BP_C_Tick");
static_assert(offsetof(Compass_BP_C_Tick, MyGeometry) == 0x000000, "Member 'Compass_BP_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Compass_BP_C_Tick, InDeltaTime) == 0x000038, "Member 'Compass_BP_C_Tick::InDeltaTime' has a wrong offset!");

}

