#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComputerBase_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ComputerBase_BP.ComputerBase_BP_C
// 0x0040 (0x0470 - 0x0430)
class AComputerBase_BP_C : public AComputerTerminal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConversationFramingComponent*          ConversationFraming;                               // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComputerTerminalWC_3D_C*               ComputerTerminalWC_3D;                             // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConversationRegisterComponent*         CRC_DEPRECATED;                                    // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AudioComponentClass;                               // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComputerTerminalAudioComponent*        AudioComponent;                                    // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ScreenMaterialSlotName;                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ComputerBase_BP(int32 EntryPoint);
	void OnComputerHackLoopStop_Event_0(class AActor* Initiator);
	void StopHackingAudio();
	void PlayHackInterruptedAudio();
	void PlayHackStartAudio();
	void PlayHackSuccessAudio();
	void PlayInsufficientSkillAudio();
	void PlayLockedAudio();
	void PlayUnlockAttemptedLockedAudio();
	void PlayUnlockedAudio();
	void PlayUseAudio();
	void OnComputerHackInterrupted_Event_0(class AActor* Initiator);
	void OnComputerHackStart_Event_0(class AActor* Initiator, uint8 HackSeconds, uint8 HackNumResources);
	void OnComputerHackSuccess_Event_0(class AActor* Initiator);
	void OnComputerInsufficientSkill_Event_0(class AActor* Initiator);
	void OnComputerLocked_Event_0(class AActor* Initiator);
	void OnComputerUnlockAttemptedLocked_Event_0(class AActor* Initiator);
	void OnComputerUnlocked_Event_0(class AActor* Initiator);
	void OnComputerUse_Event_0(class AActor* Initiator);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	bool IsLocked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComputerBase_BP_C">();
	}
	static class AComputerBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AComputerBase_BP_C>();
	}
};
static_assert(alignof(AComputerBase_BP_C) == 0x000008, "Wrong alignment on AComputerBase_BP_C");
static_assert(sizeof(AComputerBase_BP_C) == 0x000470, "Wrong size on AComputerBase_BP_C");
static_assert(offsetof(AComputerBase_BP_C, UberGraphFrame) == 0x000430, "Member 'AComputerBase_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, ConversationFraming) == 0x000438, "Member 'AComputerBase_BP_C::ConversationFraming' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, ComputerTerminalWC_3D) == 0x000440, "Member 'AComputerBase_BP_C::ComputerTerminalWC_3D' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, CRC_DEPRECATED) == 0x000448, "Member 'AComputerBase_BP_C::CRC_DEPRECATED' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, StaticMesh) == 0x000450, "Member 'AComputerBase_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, AudioComponentClass) == 0x000458, "Member 'AComputerBase_BP_C::AudioComponentClass' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, AudioComponent) == 0x000460, "Member 'AComputerBase_BP_C::AudioComponent' has a wrong offset!");
static_assert(offsetof(AComputerBase_BP_C, ScreenMaterialSlotName) == 0x000468, "Member 'AComputerBase_BP_C::ScreenMaterialSlotName' has a wrong offset!");

}

