#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComTower_Holo_BP_B

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ComTower_Holo_BP_B.ComTower_Holo_BP_B_C.ExecuteUbergraph_ComTower_Holo_BP_B
// 0x00A0 (0x00A0 - 0x0000)
struct ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B) == 0x000004, "Wrong alignment on ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B");
static_assert(sizeof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B) == 0x0000A0, "Wrong size on ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B");
static_assert(offsetof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B, EntryPoint) == 0x000000, "Member 'ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B::EntryPoint' has a wrong offset!");
static_assert(offsetof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000018, "Member 'ComTower_Holo_BP_B_C_ExecuteUbergraph_ComTower_Holo_BP_B::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");

// Function ComTower_Holo_BP_B.ComTower_Holo_BP_B_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ComTower_Holo_BP_B_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComTower_Holo_BP_B_C_ReceiveTick) == 0x000004, "Wrong alignment on ComTower_Holo_BP_B_C_ReceiveTick");
static_assert(sizeof(ComTower_Holo_BP_B_C_ReceiveTick) == 0x000004, "Wrong size on ComTower_Holo_BP_B_C_ReceiveTick");
static_assert(offsetof(ComTower_Holo_BP_B_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ComTower_Holo_BP_B_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

