#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CorrosiveCharacterDeath

#include "Basic.hpp"


namespace SDK::Params
{

// Function CorrosiveCharacterDeath.CorrosiveCharacterDeath_C.ExecuteUbergraph_CorrosiveCharacterDeath
// 0x0068 (0x0068 - 0x0000)
struct CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent_1;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath) == 0x000008, "Wrong alignment on CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath");
static_assert(sizeof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath) == 0x000068, "Wrong size on CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, EntryPoint) == 0x000000, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, Temp_int_Variable) == 0x000004, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, Temp_int_Variable_1) == 0x000008, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, K2Node_Event_InDeathComponent_1) == 0x000018, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::K2Node_Event_InDeathComponent_1' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, K2Node_Event_Delta) == 0x000020, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Array_Get_Item) == 0x000028, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Lerp_ReturnValue) == 0x00004C, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, K2Node_Event_InDeathComponent) == 0x000058, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::K2Node_Event_InDeathComponent' has a wrong offset!");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath, Temp_bool_IsClosed_Variable) == 0x000060, "Member 'CorrosiveCharacterDeath_C_ExecuteUbergraph_CorrosiveCharacterDeath::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function CorrosiveCharacterDeath.CorrosiveCharacterDeath_C.ExecuteOnReload
// 0x0008 (0x0008 - 0x0000)
struct CorrosiveCharacterDeath_C_ExecuteOnReload final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CorrosiveCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong alignment on CorrosiveCharacterDeath_C_ExecuteOnReload");
static_assert(sizeof(CorrosiveCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong size on CorrosiveCharacterDeath_C_ExecuteOnReload");
static_assert(offsetof(CorrosiveCharacterDeath_C_ExecuteOnReload, InDeathComponent) == 0x000000, "Member 'CorrosiveCharacterDeath_C_ExecuteOnReload::InDeathComponent' has a wrong offset!");

// Function CorrosiveCharacterDeath.CorrosiveCharacterDeath_C.Tick
// 0x0004 (0x0004 - 0x0000)
struct CorrosiveCharacterDeath_C_Tick final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CorrosiveCharacterDeath_C_Tick) == 0x000004, "Wrong alignment on CorrosiveCharacterDeath_C_Tick");
static_assert(sizeof(CorrosiveCharacterDeath_C_Tick) == 0x000004, "Wrong size on CorrosiveCharacterDeath_C_Tick");
static_assert(offsetof(CorrosiveCharacterDeath_C_Tick, Delta) == 0x000000, "Member 'CorrosiveCharacterDeath_C_Tick::Delta' has a wrong offset!");

// Function CorrosiveCharacterDeath.CorrosiveCharacterDeath_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct CorrosiveCharacterDeath_C_Execute final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CorrosiveCharacterDeath_C_Execute) == 0x000008, "Wrong alignment on CorrosiveCharacterDeath_C_Execute");
static_assert(sizeof(CorrosiveCharacterDeath_C_Execute) == 0x000008, "Wrong size on CorrosiveCharacterDeath_C_Execute");
static_assert(offsetof(CorrosiveCharacterDeath_C_Execute, InDeathComponent) == 0x000000, "Member 'CorrosiveCharacterDeath_C_Execute::InDeathComponent' has a wrong offset!");

}

