#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CREA_Canid_AnimBP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CombatEnum_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CREA_Canid_AnimBP.CREA_Canid_AnimBP_C
// 0x18F0 (0x22D0 - 0x09E0)
class UCREA_Canid_AnimBP_C final : public UQuadrupedAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0A18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0A40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0A68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0A90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0AB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0AE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0B08(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0B88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0BB8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0C38(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0C68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0C90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0CB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0CE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0D30(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_3;                    // 0x0D58(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0DE8(0x0030)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_2;                    // 0x0E18(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0EA8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0F00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0F28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0F50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0F78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0FA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0FC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0FF0(0x0028)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed_1;               // 0x1018(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x10A0(0x0030)()
	struct FAnimNode_RandomSequenceNamed          AnimGraphNode_RandomSequenceNamed;                 // 0x10D0(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1158(0x0030)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x1188(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1208(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x1238(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x12E8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1318(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x13C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x13F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1490(0x0028)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay_1;                    // 0x14B8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1548(0x0030)()
	struct FAnimNode_LocomotionPlay               AnimGraphNode_LocomotionPlay;                      // 0x1578(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1608(0x0030)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x1638(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x16B8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x16E8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1798(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1838(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1868(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x1918(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1960(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x19A8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x19F0(0x00A0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1A90(0x0018)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1AA8(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x1AC8(0x00F8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1BC0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1BE0(0x00A0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x1C80(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1D10(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1D58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1D80(0x0028)()
	uint8                                         Pad_1DA8[0x8];                                     // 0x1DA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_CurveSlot                    AnimGraphNode_CurveSlot;                           // 0x1DB0(0x00B0)()
	struct FAnimNode_BatchJointDriver             AnimGraphNode_BatchJointDriver;                    // 0x1E60(0x01E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2040(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x2088(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2150(0x0158)()
	class UCREA_Canid_WeaponAnimations_C*         WeaponAnimationsBP;                                // 0x22A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECombatEnum                                   CombatEnum;                                        // 0x22B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomIdle;                                        // 0x22B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B2[0x2];                                     // 0x22B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitFlinchActive;                                   // 0x22B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionDirection;                              // 0x22B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionRate;                                   // 0x22BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHitReactType                                 HitReactionType;                                   // 0x22C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CREA_Canid_AnimBP(int32 EntryPoint);
	void OnNewWeaponAnimations(class UWeaponAnimations* NewWeaponAnimations);
	void AnimNotify_TurnOffRandomIdle();
	void AnimNotify_RandomIdle();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnRebuildAnimationSetData();
	void NeutralTransition();
	void CombatTransition();
	void UpdateAnimBP();
	void CheckHitFlinches();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CREA_Canid_AnimBP_C">();
	}
	static class UCREA_Canid_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCREA_Canid_AnimBP_C>();
	}
};
static_assert(alignof(UCREA_Canid_AnimBP_C) == 0x000010, "Wrong alignment on UCREA_Canid_AnimBP_C");
static_assert(sizeof(UCREA_Canid_AnimBP_C) == 0x0022D0, "Wrong size on UCREA_Canid_AnimBP_C");
static_assert(offsetof(UCREA_Canid_AnimBP_C, UberGraphFrame) == 0x0009E0, "Member 'UCREA_Canid_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_Root) == 0x0009E8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_25) == 0x000A18, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_24) == 0x000A40, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_23) == 0x000A68, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_22) == 0x000A90, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_21) == 0x000AB8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_20) == 0x000AE0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000B08, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_11) == 0x000B88, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000BB8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_10) == 0x000C38, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_19) == 0x000C68, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_18) == 0x000C90, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_17) == 0x000CB8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_16) == 0x000CE0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_15) == 0x000D08, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_14) == 0x000D30, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LocomotionPlay_3) == 0x000D58, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LocomotionPlay_3' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_9) == 0x000DE8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LocomotionPlay_2) == 0x000E18, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LocomotionPlay_2' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_8) == 0x000EA8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x000ED8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x000F00, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x000F28, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x000F50, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x000F78, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000FA0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000FC8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000FF0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_RandomSequenceNamed_1) == 0x001018, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_RandomSequenceNamed_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_7) == 0x0010A0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_RandomSequenceNamed) == 0x0010D0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_RandomSequenceNamed' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_6) == 0x001158, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_RandomPlayer_1) == 0x001188, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_RandomPlayer_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001208, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateMachine_3) == 0x001238, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0012E8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateMachine_2) == 0x001318, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x0013C8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0013F0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x001418, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x001440, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001468, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TransitionResult) == 0x001490, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LocomotionPlay_1) == 0x0014B8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LocomotionPlay_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_3) == 0x001548, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LocomotionPlay) == 0x001578, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LocomotionPlay' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_2) == 0x001608, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_RandomPlayer) == 0x001638, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_RandomPlayer' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0016B8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x0016E8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001798, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateResult) == 0x001838, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_StateMachine) == 0x001868, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_Slot_4) == 0x001918, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_Slot_3) == 0x001960, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_Slot_2) == 0x0019A8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x0019F0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LocalRefPose) == 0x001A90, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001AA8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_LegIK) == 0x001AC8, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_LegIK' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001BC0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001BE0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_PoseSnapshot) == 0x001C80, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_Slot_1) == 0x001D10, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001D58, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001D80, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_CurveSlot) == 0x001DB0, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_CurveSlot' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_BatchJointDriver) == 0x001E60, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_BatchJointDriver' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_Slot) == 0x002040, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x002088, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002150, "Member 'UCREA_Canid_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, WeaponAnimationsBP) == 0x0022A8, "Member 'UCREA_Canid_AnimBP_C::WeaponAnimationsBP' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, CombatEnum) == 0x0022B0, "Member 'UCREA_Canid_AnimBP_C::CombatEnum' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, RandomIdle) == 0x0022B1, "Member 'UCREA_Canid_AnimBP_C::RandomIdle' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, HitFlinchActive) == 0x0022B4, "Member 'UCREA_Canid_AnimBP_C::HitFlinchActive' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, HitReactionDirection) == 0x0022B8, "Member 'UCREA_Canid_AnimBP_C::HitReactionDirection' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, HitReactionRate) == 0x0022BC, "Member 'UCREA_Canid_AnimBP_C::HitReactionRate' has a wrong offset!");
static_assert(offsetof(UCREA_Canid_AnimBP_C, HitReactionType) == 0x0022C0, "Member 'UCREA_Canid_AnimBP_C::HitReactionType' has a wrong offset!");

}

