#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRITTER_Bird_FlyOff_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CRITTER_Bird_FlyOff_AnimBP.CRITTER_Bird_FlyOff_AnimBP_C.ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP) == 0x000004, "Wrong alignment on CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP");
static_assert(sizeof(CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP) == 0x000004, "Wrong size on CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP");
static_assert(offsetof(CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP, EntryPoint) == 0x000000, "Member 'CRITTER_Bird_FlyOff_AnimBP_C_ExecuteUbergraph_CRITTER_Bird_FlyOff_AnimBP::EntryPoint' has a wrong offset!");

// Function CRITTER_Bird_FlyOff_AnimBP.CRITTER_Bird_FlyOff_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph");
static_assert(sizeof(CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph");
static_assert(offsetof(CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'CRITTER_Bird_FlyOff_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

