#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drink_Rizzo_SpectrumVodkaYellow

#include "Basic.hpp"


namespace SDK::Params
{

// Function Drink_Rizzo_SpectrumVodkaYellow.Drink_Rizzo_SpectrumVodkaYellow_C.ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow
// 0x0020 (0x0020 - 0x0000)
struct Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Objective;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ObjectiveName;                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow) == 0x000008, "Wrong alignment on Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow");
static_assert(sizeof(Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow) == 0x000020, "Wrong size on Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow");
static_assert(offsetof(Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow, EntryPoint) == 0x000000, "Member 'Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow, K2Node_Event_Objective) == 0x000008, "Member 'Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow::K2Node_Event_Objective' has a wrong offset!");
static_assert(offsetof(Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow, K2Node_Event_ObjectiveName) == 0x000010, "Member 'Drink_Rizzo_SpectrumVodkaYellow_C_ExecuteUbergraph_Drink_Rizzo_SpectrumVodkaYellow::K2Node_Event_ObjectiveName' has a wrong offset!");

// Function Drink_Rizzo_SpectrumVodkaYellow.Drink_Rizzo_SpectrumVodkaYellow_C.SetObjective
// 0x0018 (0x0018 - 0x0000)
struct Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective final
{
public:
	class AActor*                                 Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ObjectiveName;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective) == 0x000008, "Wrong alignment on Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective");
static_assert(sizeof(Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective) == 0x000018, "Wrong size on Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective");
static_assert(offsetof(Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective, Objective) == 0x000000, "Member 'Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective::Objective' has a wrong offset!");
static_assert(offsetof(Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective, ObjectiveName) == 0x000008, "Member 'Drink_Rizzo_SpectrumVodkaYellow_C_SetObjective::ObjectiveName' has a wrong offset!");

}

