#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DST_Mine_Base_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DST_Mine_Base_BP.DST_Mine_Base_BP_C.ExecuteUbergraph_DST_Mine_Base_BP
// 0x00E0 (0x00E0 - 0x0000)
struct DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Instigator)>     K2Node_CreateDelegate_OutputDelegate;              // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDecalMaterial_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP) == 0x000008, "Wrong alignment on DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP");
static_assert(sizeof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP) == 0x0000E0, "Wrong size on DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, EntryPoint) == 0x000000, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000004, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000020, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_GetHealth_ReturnValue) == 0x000028, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, K2Node_CustomEvent_Instigator) == 0x000030, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000038, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000044, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000050, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000058, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000064, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x00007C, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_ComposeRotators_ReturnValue) == 0x000088, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000098, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x0000A0, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0000A8, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, K2Node_CreateDelegate_OutputDelegate) == 0x0000AC, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_GetDecalMaterial_ReturnValue) == 0x0000C0, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_GetDecalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C8, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_GetDecalMaterial_ReturnValue_1) == 0x0000D0, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_GetDecalMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000D8, "Member 'DST_Mine_Base_BP_C_ExecuteUbergraph_DST_Mine_Base_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function DST_Mine_Base_BP.DST_Mine_Base_BP_C.OnDestructibleDestroyed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0 final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0) == 0x000008, "Wrong alignment on DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0");
static_assert(sizeof(DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0) == 0x000008, "Wrong size on DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0");
static_assert(offsetof(DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0, Instigator_0) == 0x000000, "Member 'DST_Mine_Base_BP_C_OnDestructibleDestroyed_Event_0::Instigator_0' has a wrong offset!");

// Function DST_Mine_Base_BP.DST_Mine_Base_BP_C.SetLightParameters
// 0x0024 (0x0024 - 0x0000)
struct DST_Mine_Base_BP_C_SetLightParameters final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpecularScale_0;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temperature_0;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttenuationRadius_0;                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DST_Mine_Base_BP_C_SetLightParameters) == 0x000004, "Wrong alignment on DST_Mine_Base_BP_C_SetLightParameters");
static_assert(sizeof(DST_Mine_Base_BP_C_SetLightParameters) == 0x000024, "Wrong size on DST_Mine_Base_BP_C_SetLightParameters");
static_assert(offsetof(DST_Mine_Base_BP_C_SetLightParameters, Color) == 0x000000, "Member 'DST_Mine_Base_BP_C_SetLightParameters::Color' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_SetLightParameters, LightIntensity) == 0x000004, "Member 'DST_Mine_Base_BP_C_SetLightParameters::LightIntensity' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_SetLightParameters, SpecularScale_0) == 0x000008, "Member 'DST_Mine_Base_BP_C_SetLightParameters::SpecularScale_0' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_SetLightParameters, Temperature_0) == 0x00000C, "Member 'DST_Mine_Base_BP_C_SetLightParameters::Temperature_0' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_SetLightParameters, AttenuationRadius_0) == 0x000010, "Member 'DST_Mine_Base_BP_C_SetLightParameters::AttenuationRadius_0' has a wrong offset!");
static_assert(offsetof(DST_Mine_Base_BP_C_SetLightParameters, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000014, "Member 'DST_Mine_Base_BP_C_SetLightParameters::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");

// Function DST_Mine_Base_BP.DST_Mine_Base_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct DST_Mine_Base_BP_C_UserConstructionScript final
{
public:
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DST_Mine_Base_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on DST_Mine_Base_BP_C_UserConstructionScript");
static_assert(sizeof(DST_Mine_Base_BP_C_UserConstructionScript) == 0x000010, "Wrong size on DST_Mine_Base_BP_C_UserConstructionScript");
static_assert(offsetof(DST_Mine_Base_BP_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000000, "Member 'DST_Mine_Base_BP_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");

}

