#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnergyCharacterDeath

#include "Basic.hpp"


namespace SDK::Params
{

// Function EnergyCharacterDeath.EnergyCharacterDeath_C.ExecuteUbergraph_EnergyCharacterDeath
// 0x0078 (0x0078 - 0x0000)
struct EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent_1;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       CallFunc_MID_Creation_Skeletal_MIDs;               // 0x0048(0x0010)(ReferenceParm)
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateAshPile_Ash_MID;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath) == 0x000008, "Wrong alignment on EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath");
static_assert(sizeof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath) == 0x000078, "Wrong size on EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, EntryPoint) == 0x000000, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, Temp_int_Variable) == 0x000004, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, Temp_int_Variable_1) == 0x000008, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, K2Node_Event_InDeathComponent_1) == 0x000018, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::K2Node_Event_InDeathComponent_1' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, K2Node_Event_Delta) == 0x000020, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Array_Get_Item) == 0x000028, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_MID_Creation_Skeletal_MIDs) == 0x000048, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_MID_Creation_Skeletal_MIDs' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, K2Node_Event_InDeathComponent) == 0x000058, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::K2Node_Event_InDeathComponent' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Lerp_ReturnValue) == 0x000068, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00006C, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath, CallFunc_CreateAshPile_Ash_MID) == 0x000070, "Member 'EnergyCharacterDeath_C_ExecuteUbergraph_EnergyCharacterDeath::CallFunc_CreateAshPile_Ash_MID' has a wrong offset!");

// Function EnergyCharacterDeath.EnergyCharacterDeath_C.ExecuteOnReload
// 0x0008 (0x0008 - 0x0000)
struct EnergyCharacterDeath_C_ExecuteOnReload final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnergyCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong alignment on EnergyCharacterDeath_C_ExecuteOnReload");
static_assert(sizeof(EnergyCharacterDeath_C_ExecuteOnReload) == 0x000008, "Wrong size on EnergyCharacterDeath_C_ExecuteOnReload");
static_assert(offsetof(EnergyCharacterDeath_C_ExecuteOnReload, InDeathComponent) == 0x000000, "Member 'EnergyCharacterDeath_C_ExecuteOnReload::InDeathComponent' has a wrong offset!");

// Function EnergyCharacterDeath.EnergyCharacterDeath_C.Tick
// 0x0004 (0x0004 - 0x0000)
struct EnergyCharacterDeath_C_Tick final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnergyCharacterDeath_C_Tick) == 0x000004, "Wrong alignment on EnergyCharacterDeath_C_Tick");
static_assert(sizeof(EnergyCharacterDeath_C_Tick) == 0x000004, "Wrong size on EnergyCharacterDeath_C_Tick");
static_assert(offsetof(EnergyCharacterDeath_C_Tick, Delta) == 0x000000, "Member 'EnergyCharacterDeath_C_Tick::Delta' has a wrong offset!");

// Function EnergyCharacterDeath.EnergyCharacterDeath_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct EnergyCharacterDeath_C_Execute final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnergyCharacterDeath_C_Execute) == 0x000008, "Wrong alignment on EnergyCharacterDeath_C_Execute");
static_assert(sizeof(EnergyCharacterDeath_C_Execute) == 0x000008, "Wrong size on EnergyCharacterDeath_C_Execute");
static_assert(offsetof(EnergyCharacterDeath_C_Execute, InDeathComponent) == 0x000000, "Member 'EnergyCharacterDeath_C_Execute::InDeathComponent' has a wrong offset!");

}

