#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ex_0015_ShipInt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ex_0015_ShipInt.Ex_0015_ShipInt_C
// 0x0028 (0x02E8 - 0x02C0)
class AEx_0015_ShipInt_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APointLight*                            PointLight66_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             CH_CeilingLight_9_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             CH_CeilingLight_10_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APointLight*                            PointLight86_9_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ex_0015_ShipInt(int32 EntryPoint);
	void StartCargoSpotlightsLit();
	void TurnOnCargoSpotlights();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ex_0015_ShipInt_C">();
	}
	static class AEx_0015_ShipInt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEx_0015_ShipInt_C>();
	}
};
static_assert(alignof(AEx_0015_ShipInt_C) == 0x000008, "Wrong alignment on AEx_0015_ShipInt_C");
static_assert(sizeof(AEx_0015_ShipInt_C) == 0x0002E8, "Wrong size on AEx_0015_ShipInt_C");
static_assert(offsetof(AEx_0015_ShipInt_C, UberGraphFrame) == 0x0002C0, "Member 'AEx_0015_ShipInt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_C, PointLight66_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty) == 0x0002C8, "Member 'AEx_0015_ShipInt_C::PointLight66_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_C, CH_CeilingLight_9_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty) == 0x0002D0, "Member 'AEx_0015_ShipInt_C::CH_CeilingLight_9_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_C, CH_CeilingLight_10_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty) == 0x0002D8, "Member 'AEx_0015_ShipInt_C::CH_CeilingLight_10_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_C, PointLight86_9_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty) == 0x0002E0, "Member 'AEx_0015_ShipInt_C::PointLight86_9_ExecuteUbergraph_Ex_0015_ShipInt_RefProperty' has a wrong offset!");

}

