#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ex_0015_ShipInt_Scr

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ex_0015_ShipInt_Scr.Ex_0015_ShipInt_Scr_C
// 0x23E8 (0x26A8 - 0x02C0)
class AEx_0015_ShipInt_Scr_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FConversationDescription               ShipAI_Node_219;                                   // 0x02C8(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Node_220;                                   // 0x04C0(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_31;                                    // 0x06B8(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_46;                                    // 0x08B0(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_Workbench;                             // 0x0AA8(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_EngineRoom;                            // 0x0CA0(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_PowerRegulator;                        // 0x0E98(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_CrewQuarters;                          // 0x1090(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_LootEntrance;                          // 0x1288(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_LootCargoHold;                         // 0x1480(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_LootGalley;                            // 0x1678(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_RespecMachine;                         // 0x1870(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_NavConsole;                            // 0x1A68(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_CameraEntrance;                        // 0x1C60(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_CameraCargoHold;                       // 0x1E58(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_CameraEngineRoom;                      // 0x2050(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_CameraGalley;                          // 0x2248(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FConversationDescription               ShipAI_Bark_SealedDoors;                           // 0x2440(0x01F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinTimeBetweenADABarks;                            // 0x2638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTimeBetweenADABarks;                            // 0x263C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ADAMarauderBarks;                                  // 0x2640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AShipFakeDoor_BP_C*                     TRANS_fake_ship_outer_door_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMax_Comp_Male_C*                       COMP_max_ev_crash_site_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEXAM_Power_Regulator_Housing_C*        EXAM_ship_power_regulator_housing_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       STATIC_ship_regulator_housing_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       STATIC_regulator_post_install_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZero001_ShipAI_C*                      NPC_ship_ai_ev_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWorkbench_A_BP_C*                      Workbench_A_fake_player_ship_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Zero0_FirstShipTakeOff_2_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrigger_Saveable_PlayerOnly_Box_C*     TRIG_cargobay_spotlights_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty; // 0x2690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMax_Comp_Male_C*                       COMP_max_ev_crash_site_EdGraph_1_RefProperty;      // 0x2698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerVolume*                         Ship_Volume_EdGraph_3_RefProperty;                 // 0x26A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ex_0015_ShipInt_Scr(int32 EntryPoint);
	void EnableCargoLightTrigger();
	void BndEvt__Ex_0015_ShipInt_Scr_TRIG_bark_cargobay_spotlights_K2Node_ActorBoundEvent_25_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void Playership_flyoff();
	void HandleSpotlightVisibility();
	void HandleRestartingFakeShipFX();
	void BndEvt__POI_fake_ship_workbench_K2Node_ActorBoundEvent_15_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__Ship_Volume_K2Node_ActorBoundEvent_106_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void CutOffShipWorkbenchBark(const struct FInteractionDescription& Description);
	void BndEvt__TRIG_bark_ada_camera_entrance_K2Node_ActorBoundEvent_24_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__Parts_Weapon_Pickup_2_K2Node_ActorBoundEvent_23_OnPickup__DelegateSignature(class AActor* Initiator);
	void BndEvt__Ship_Volume_K2Node_ActorBoundEvent_125_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void PlayPeriodicADABark();
	void HandlePeriodicADABarks();
	void BndEvt__EXAM_ship_power_regulator_housing_K2Node_ActorBoundEvent_1_OnInteract__DelegateSignature(class AActor* Actor);
	void BndEvt__LockerContainer_A_BP8_K2Node_ActorBoundEvent_22_OCLUnlocked__DelegateSignature(class AActor* Initiator);
	void BndEvt__TRIG_bark_ada_sealed_door_bathroom_K2Node_ActorBoundEvent_21_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_sealed_door_SAM_K2Node_ActorBoundEvent_20_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_sealed_door_capt_quarters_K2Node_ActorBoundEvent_19_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_camera_galley_K2Node_ActorBoundEvent_18_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_camera_engine_room_K2Node_ActorBoundEvent_17_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_camera_cargo_hold_K2Node_ActorBoundEvent_16_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_nav_console_K2Node_ActorBoundEvent_14_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_respecc_machine_K2Node_ActorBoundEvent_13_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_crew_quarters_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_engine_room_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__TRIG_bark_ada_workbench_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void HandleVicarBark();
	void MakeMaxInteractableAgain();
	void BndEvt__LockerContainer_A_BP7_K2Node_ActorBoundEvent_10_ItemStackDelegate__DelegateSignature(const struct FItemStack& Item);
	void BndEvt__LockerContainer_A_BP8_K2Node_ActorBoundEvent_9_ItemStackDelegate__DelegateSignature(const struct FItemStack& Item);
	void BndEvt__SawedOffFlechette_Pickup_Damaged_2_K2Node_ActorBoundEvent_8_OnPickup__DelegateSignature(class AActor* Initiator);
	void BndEvt__TossballStick_Pickup2_K2Node_ActorBoundEvent_7_OnPickup__DelegateSignature(class AActor* Initiator);
	void BndEvt__Pickup3_K2Node_ActorBoundEvent_6_OnPickup__DelegateSignature(class AActor* Initiator);
	void BndEvt__FridgeContainer_A_BP7_K2Node_ActorBoundEvent_4_ItemStackDelegate__DelegateSignature(const struct FItemStack& Item);
	void BndEvt__HatchDoor_BP_A_176_K2Node_ActorBoundEvent_32_OnInteract__DelegateSignature(class AActor* Actor);
	void On_Takeoff_End(bool bSkipped);
	void BndEvt__HatchDoor_BP_A2_K2Node_ActorBoundEvent_3_OnInteract__DelegateSignature(class AActor* Actor);
	void BndEvt__TRIG_ship_ai_bark_02_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void ReceiveBeginPlay();
	void BndEvt__TRIG_ship_ai_bark_01_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void Objective_1_Var_Check();
	void HandleStuffOnTakeoff();
	void CheckForVicarOnShip();
	void CheckForPcOnShip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ex_0015_ShipInt_Scr_C">();
	}
	static class AEx_0015_ShipInt_Scr_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEx_0015_ShipInt_Scr_C>();
	}
};
static_assert(alignof(AEx_0015_ShipInt_Scr_C) == 0x000008, "Wrong alignment on AEx_0015_ShipInt_Scr_C");
static_assert(sizeof(AEx_0015_ShipInt_Scr_C) == 0x0026A8, "Wrong size on AEx_0015_ShipInt_Scr_C");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, UberGraphFrame) == 0x0002C0, "Member 'AEx_0015_ShipInt_Scr_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Node_219) == 0x0002C8, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Node_219' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Node_220) == 0x0004C0, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Node_220' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_31) == 0x0006B8, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_31' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_46) == 0x0008B0, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_46' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_Workbench) == 0x000AA8, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_Workbench' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_EngineRoom) == 0x000CA0, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_EngineRoom' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_PowerRegulator) == 0x000E98, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_PowerRegulator' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_CrewQuarters) == 0x001090, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_CrewQuarters' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_LootEntrance) == 0x001288, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_LootEntrance' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_LootCargoHold) == 0x001480, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_LootCargoHold' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_LootGalley) == 0x001678, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_LootGalley' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_RespecMachine) == 0x001870, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_RespecMachine' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_NavConsole) == 0x001A68, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_NavConsole' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_CameraEntrance) == 0x001C60, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_CameraEntrance' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_CameraCargoHold) == 0x001E58, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_CameraCargoHold' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_CameraEngineRoom) == 0x002050, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_CameraEngineRoom' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_CameraGalley) == 0x002248, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_CameraGalley' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ShipAI_Bark_SealedDoors) == 0x002440, "Member 'AEx_0015_ShipInt_Scr_C::ShipAI_Bark_SealedDoors' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, MinTimeBetweenADABarks) == 0x002638, "Member 'AEx_0015_ShipInt_Scr_C::MinTimeBetweenADABarks' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, MaxTimeBetweenADABarks) == 0x00263C, "Member 'AEx_0015_ShipInt_Scr_C::MaxTimeBetweenADABarks' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, ADAMarauderBarks) == 0x002640, "Member 'AEx_0015_ShipInt_Scr_C::ADAMarauderBarks' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, TRANS_fake_ship_outer_door_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002650, "Member 'AEx_0015_ShipInt_Scr_C::TRANS_fake_ship_outer_door_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, COMP_max_ev_crash_site_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002658, "Member 'AEx_0015_ShipInt_Scr_C::COMP_max_ev_crash_site_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, EXAM_ship_power_regulator_housing_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002660, "Member 'AEx_0015_ShipInt_Scr_C::EXAM_ship_power_regulator_housing_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, STATIC_ship_regulator_housing_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002668, "Member 'AEx_0015_ShipInt_Scr_C::STATIC_ship_regulator_housing_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, STATIC_regulator_post_install_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002670, "Member 'AEx_0015_ShipInt_Scr_C::STATIC_regulator_post_install_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, NPC_ship_ai_ev_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002678, "Member 'AEx_0015_ShipInt_Scr_C::NPC_ship_ai_ev_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, Workbench_A_fake_player_ship_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002680, "Member 'AEx_0015_ShipInt_Scr_C::Workbench_A_fake_player_ship_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, Zero0_FirstShipTakeOff_2_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002688, "Member 'AEx_0015_ShipInt_Scr_C::Zero0_FirstShipTakeOff_2_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, TRIG_cargobay_spotlights_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty) == 0x002690, "Member 'AEx_0015_ShipInt_Scr_C::TRIG_cargobay_spotlights_ExecuteUbergraph_Ex_0015_ShipInt_Scr_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, COMP_max_ev_crash_site_EdGraph_1_RefProperty) == 0x002698, "Member 'AEx_0015_ShipInt_Scr_C::COMP_max_ev_crash_site_EdGraph_1_RefProperty' has a wrong offset!");
static_assert(offsetof(AEx_0015_ShipInt_Scr_C, Ship_Volume_EdGraph_3_RefProperty) == 0x0026A0, "Member 'AEx_0015_ShipInt_Scr_C::Ship_Volume_EdGraph_3_RefProperty' has a wrong offset!");

}

