#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EXAM_Power_Regulator_Housing

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "ExaminableActorBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EXAM_Power_Regulator_Housing.EXAM_Power_Regulator_Housing_C
// 0x0018 (0x0328 - 0x0310)
class AEXAM_Power_Regulator_Housing_C final : public AExaminableActorBase_BP_C
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLocString                             RequiresPowerRegulatorString;                      // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLocString                             InstallPowerREgulatorString;                       // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	struct FLocString GetInteractLocString() const;
	EInteractionType GetInteraction(const struct FInteractionDescription& Description, const struct FInteractPayload& Payload, float InteractDistance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EXAM_Power_Regulator_Housing_C">();
	}
	static class AEXAM_Power_Regulator_Housing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEXAM_Power_Regulator_Housing_C>();
	}
};
static_assert(alignof(AEXAM_Power_Regulator_Housing_C) == 0x000008, "Wrong alignment on AEXAM_Power_Regulator_Housing_C");
static_assert(sizeof(AEXAM_Power_Regulator_Housing_C) == 0x000328, "Wrong size on AEXAM_Power_Regulator_Housing_C");
static_assert(offsetof(AEXAM_Power_Regulator_Housing_C, StaticMesh) == 0x000310, "Member 'AEXAM_Power_Regulator_Housing_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AEXAM_Power_Regulator_Housing_C, RequiresPowerRegulatorString) == 0x000318, "Member 'AEXAM_Power_Regulator_Housing_C::RequiresPowerRegulatorString' has a wrong offset!");
static_assert(offsetof(AEXAM_Power_Regulator_Housing_C, InstallPowerREgulatorString) == 0x000320, "Member 'AEXAM_Power_Regulator_Housing_C::InstallPowerREgulatorString' has a wrong offset!");

}

