#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_VFX_NextGen

#include "Basic.hpp"


namespace SDK::Params
{

// Function FL_VFX_NextGen.FL_VFX_NextGen_C.Set Radial VFX Size by Impact Radius
// 0x0108 (0x0108 - 0x0000)
struct FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius final
{
public:
	float                                         Outer_Radius;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impact_Size;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<float, float>                            Sizes_Steps;                                       // 0x0018(0x0050)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<float, float>                            K2Node_MakeVariable_MakeVariableOutput;            // 0x0078(0x0050)()
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_Map_Keys_Keys;                            // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius) == 0x000008, "Wrong alignment on FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius");
static_assert(sizeof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius) == 0x000108, "Wrong size on FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, Outer_Radius) == 0x000000, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::Outer_Radius' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, __WorldContext) == 0x000008, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, Impact_Size) == 0x000010, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::Impact_Size' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, Sizes_Steps) == 0x000018, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::Sizes_Steps' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, Temp_bool_Variable) == 0x000068, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, Temp_int_Variable) == 0x00006C, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, K2Node_MakeVariable_MakeVariableOutput) == 0x000078, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Map_Values_Values) == 0x0000C8, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Map_Length_ReturnValue) == 0x0000D8, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Array_Get_Item) == 0x0000DC, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Map_Keys_Keys) == 0x0000E8, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_BooleanAND_ReturnValue) == 0x0000F8, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Array_Get_Item_1) == 0x0000FC, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Less_FloatFloat_ReturnValue) == 0x000100, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000101, "Member 'FL_VFX_NextGen_C_Set_Radial_VFX_Size_by_Impact_Radius::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function FL_VFX_NextGen.FL_VFX_NextGen_C.Set Bullet VFX Size by Impact Radius
// 0x0108 (0x0108 - 0x0000)
struct FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius final
{
public:
	float                                         Outer_Radius;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impact_Size;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<float, float>                            Sizes_Steps;                                       // 0x0018(0x0050)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<float, float>                            K2Node_MakeVariable_MakeVariableOutput;            // 0x0078(0x0050)()
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_Map_Keys_Keys;                            // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius) == 0x000008, "Wrong alignment on FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius");
static_assert(sizeof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius) == 0x000108, "Wrong size on FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, Outer_Radius) == 0x000000, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::Outer_Radius' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, __WorldContext) == 0x000008, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, Impact_Size) == 0x000010, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::Impact_Size' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, Sizes_Steps) == 0x000018, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::Sizes_Steps' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, Temp_bool_Variable) == 0x000068, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, Temp_int_Variable) == 0x00006C, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, K2Node_MakeVariable_MakeVariableOutput) == 0x000078, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Map_Values_Values) == 0x0000C8, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Map_Length_ReturnValue) == 0x0000D8, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Array_Get_Item) == 0x0000DC, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Map_Keys_Keys) == 0x0000E8, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_BooleanAND_ReturnValue) == 0x0000F8, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Array_Get_Item_1) == 0x0000FC, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Less_FloatFloat_ReturnValue) == 0x000100, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000101, "Member 'FL_VFX_NextGen_C_Set_Bullet_VFX_Size_by_Impact_Radius::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

