#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericListEntryWidget_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GenericListEntryWidget_BP.GenericListEntryWidget_BP_C.ExecuteUbergraph_GenericListEntryWidget_BP
// 0x0138 (0x0138 - 0x0000)
struct GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue_1;             // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0050(0x0028)()
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_3;                // 0x0078(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x00A8(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x00D8(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0108(0x0030)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP) == 0x000008, "Wrong alignment on GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP");
static_assert(sizeof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP) == 0x000138, "Wrong size on GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, EntryPoint) == 0x000000, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, CallFunc_GetColorByType_ReturnValue) == 0x000004, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, CallFunc_GetColorByType_ReturnValue_1) == 0x000014, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::CallFunc_GetColorByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, K2Node_MakeStruct_SlateColor_1) == 0x000050, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, K2Node_ComponentBoundEvent_Event_3) == 0x000078, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::K2Node_ComponentBoundEvent_Event_3' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, K2Node_ComponentBoundEvent_Event_2) == 0x0000A8, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, K2Node_ComponentBoundEvent_Event_1) == 0x0000D8, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");
static_assert(offsetof(GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP, K2Node_ComponentBoundEvent_Event) == 0x000108, "Member 'GenericListEntryWidget_BP_C_ExecuteUbergraph_GenericListEntryWidget_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");

// Function GenericListEntryWidget_BP.GenericListEntryWidget_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_5_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntryWidget_BP.GenericListEntryWidget_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_4_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntryWidget_BP.GenericListEntryWidget_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function GenericListEntryWidget_BP.GenericListEntryWidget_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'GenericListEntryWidget_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

