#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hazard_Abstract

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Hazard_Abstract.Hazard_Abstract_C
// 0x00C0 (0x0440 - 0x0380)
class AHazard_Abstract_C : public AHazard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_Hazard;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   EnableStateLabel;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   SeverityLabel;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   HazardTypeLabel;                                   // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisabledString;                                    // 0x03B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsNiagara;                                         // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EnabledString;                                     // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FParticleSysParam>              PS_Instance_Params_Base;                           // 0x03E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FParticleSysParam>              PS_Instance_Params_Scaled;                         // 0x03F8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FParticleSysParam>              PS_Params_Custom;                                  // 0x0408(0x0010)(Edit, BlueprintVisible)
	class UParticleSystem*                        PS_Hazard_Template;                                // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PSScaleInheritance;                                // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Move_PS_Dynamically;                               // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Set_Custom_Params;                                 // 0x0425(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_426[0x2];                                      // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHazardAudioComponent*                  HazardAudioComponent;                              // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HazardAudioComponentClass;                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_Hazard_Template;                                // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Hazard_Abstract(int32 EntryPoint);
	void OnHazardDisabling_Event_Base();
	void OnHazardEnabling_Event_Base();
	void OnHazardEnabled_Event_Base();
	void OnHazardDisabled_Event_Base();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Setup_VFX_to_Volume();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hazard_Abstract_C">();
	}
	static class AHazard_Abstract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHazard_Abstract_C>();
	}
};
static_assert(alignof(AHazard_Abstract_C) == 0x000008, "Wrong alignment on AHazard_Abstract_C");
static_assert(sizeof(AHazard_Abstract_C) == 0x000440, "Wrong size on AHazard_Abstract_C");
static_assert(offsetof(AHazard_Abstract_C, UberGraphFrame) == 0x000380, "Member 'AHazard_Abstract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, PS_Hazard) == 0x000388, "Member 'AHazard_Abstract_C::PS_Hazard' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, Niagara) == 0x000390, "Member 'AHazard_Abstract_C::Niagara' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, EnableStateLabel) == 0x000398, "Member 'AHazard_Abstract_C::EnableStateLabel' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, SeverityLabel) == 0x0003A0, "Member 'AHazard_Abstract_C::SeverityLabel' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, HazardTypeLabel) == 0x0003A8, "Member 'AHazard_Abstract_C::HazardTypeLabel' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, DisabledString) == 0x0003B0, "Member 'AHazard_Abstract_C::DisabledString' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, IsNiagara) == 0x0003C8, "Member 'AHazard_Abstract_C::IsNiagara' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, EnabledString) == 0x0003D0, "Member 'AHazard_Abstract_C::EnabledString' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, PS_Instance_Params_Base) == 0x0003E8, "Member 'AHazard_Abstract_C::PS_Instance_Params_Base' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, PS_Instance_Params_Scaled) == 0x0003F8, "Member 'AHazard_Abstract_C::PS_Instance_Params_Scaled' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, PS_Params_Custom) == 0x000408, "Member 'AHazard_Abstract_C::PS_Params_Custom' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, PS_Hazard_Template) == 0x000418, "Member 'AHazard_Abstract_C::PS_Hazard_Template' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, PSScaleInheritance) == 0x000420, "Member 'AHazard_Abstract_C::PSScaleInheritance' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, Move_PS_Dynamically) == 0x000424, "Member 'AHazard_Abstract_C::Move_PS_Dynamically' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, Set_Custom_Params) == 0x000425, "Member 'AHazard_Abstract_C::Set_Custom_Params' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, HazardAudioComponent) == 0x000428, "Member 'AHazard_Abstract_C::HazardAudioComponent' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, HazardAudioComponentClass) == 0x000430, "Member 'AHazard_Abstract_C::HazardAudioComponentClass' has a wrong offset!");
static_assert(offsetof(AHazard_Abstract_C, NS_Hazard_Template) == 0x000438, "Member 'AHazard_Abstract_C::NS_Hazard_Template' has a wrong offset!");

}

