#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Intercom_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Engine_structs.hpp"
#include "SwitchBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Intercom_BP.Intercom_BP_C
// 0x0238 (0x05A0 - 0x0368)
class AIntercom_BP_C : public ASwitchBase_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Intercom_BP_C;                      // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConversationFramingComponent*          ConversationFraming;                               // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Knob;                                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         KnobAnimation_alpha_C4C936CF4E73EA1BF1CE78A3D771D354; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            KnobAnimation__Direction_C4C936CF4E73EA1BF1CE78A3D771D354; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     KnobAnimation;                                     // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Time;                                     // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConversationDescription               ConversationDescription;                           // 0x03A0(0x01F8)(Edit, BlueprintVisible)
	bool                                          AutoGenerateOverrides;                             // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Intercom_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnSetState(bool IsOn, bool InstantAnimation);
	void KnobAnimation__UpdateFunc();
	void KnobAnimation__FinishedFunc();
	void UserConstructionScript();
	void SetState(int32 StateIndex, bool IgnoreSound, bool InstantAnimation, bool* Unused);

	EInteractionType GetInteraction(const struct FInteractionDescription& Description, const struct FInteractPayload& Payload, float InteractDistance) const;
	struct FGuid GetSpeakerGameDataID() const;
	struct FConversationDescription GetConversationDescription() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Intercom_BP_C">();
	}
	static class AIntercom_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntercom_BP_C>();
	}
};
static_assert(alignof(AIntercom_BP_C) == 0x000008, "Wrong alignment on AIntercom_BP_C");
static_assert(sizeof(AIntercom_BP_C) == 0x0005A0, "Wrong size on AIntercom_BP_C");
static_assert(offsetof(AIntercom_BP_C, UberGraphFrame_Intercom_BP_C) == 0x000368, "Member 'AIntercom_BP_C::UberGraphFrame_Intercom_BP_C' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, ConversationFraming) == 0x000370, "Member 'AIntercom_BP_C::ConversationFraming' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, Knob) == 0x000378, "Member 'AIntercom_BP_C::Knob' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, Frame) == 0x000380, "Member 'AIntercom_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, KnobAnimation_alpha_C4C936CF4E73EA1BF1CE78A3D771D354) == 0x000388, "Member 'AIntercom_BP_C::KnobAnimation_alpha_C4C936CF4E73EA1BF1CE78A3D771D354' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, KnobAnimation__Direction_C4C936CF4E73EA1BF1CE78A3D771D354) == 0x00038C, "Member 'AIntercom_BP_C::KnobAnimation__Direction_C4C936CF4E73EA1BF1CE78A3D771D354' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, KnobAnimation) == 0x000390, "Member 'AIntercom_BP_C::KnobAnimation' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, Timeline_Time) == 0x000398, "Member 'AIntercom_BP_C::Timeline_Time' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, ConversationDescription) == 0x0003A0, "Member 'AIntercom_BP_C::ConversationDescription' has a wrong offset!");
static_assert(offsetof(AIntercom_BP_C, AutoGenerateOverrides) == 0x000598, "Member 'AIntercom_BP_C::AutoGenerateOverrides' has a wrong offset!");

}

