#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Intercom_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Intercom_BP.Intercom_BP_C.ExecuteUbergraph_Intercom_BP
// 0x00E8 (0x00E8 - 0x0000)
struct Intercom_BP_C_ExecuteUbergraph_Intercom_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsOn;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InstantAnimation;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP) == 0x000008, "Wrong alignment on Intercom_BP_C_ExecuteUbergraph_Intercom_BP");
static_assert(sizeof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP) == 0x0000E8, "Wrong size on Intercom_BP_C_ExecuteUbergraph_Intercom_BP");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, EntryPoint) == 0x000000, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, CallFunc_RLerp_ReturnValue) == 0x000004, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, Temp_bool_Variable) == 0x000010, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, Temp_object_Variable) == 0x000018, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, Temp_object_Variable_1) == 0x000020, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, Temp_bool_Variable_1) == 0x000028, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, Temp_object_Variable_2) == 0x000030, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, Temp_object_Variable_3) == 0x000038, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, K2Node_CustomEvent_IsOn) == 0x000040, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::K2Node_CustomEvent_IsOn' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, K2Node_CustomEvent_InstantAnimation) == 0x000041, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::K2Node_CustomEvent_InstantAnimation' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, K2Node_Select_Default) == 0x000048, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, K2Node_Select_Default_1) == 0x000050, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000058, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_ExecuteUbergraph_Intercom_BP, CallFunc_GetTimelineLength_ReturnValue) == 0x0000E0, "Member 'Intercom_BP_C_ExecuteUbergraph_Intercom_BP::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");

// Function Intercom_BP.Intercom_BP_C.OnSetState
// 0x0002 (0x0002 - 0x0000)
struct Intercom_BP_C_OnSetState final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InstantAnimation;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Intercom_BP_C_OnSetState) == 0x000001, "Wrong alignment on Intercom_BP_C_OnSetState");
static_assert(sizeof(Intercom_BP_C_OnSetState) == 0x000002, "Wrong size on Intercom_BP_C_OnSetState");
static_assert(offsetof(Intercom_BP_C_OnSetState, IsOn) == 0x000000, "Member 'Intercom_BP_C_OnSetState::IsOn' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_OnSetState, InstantAnimation) == 0x000001, "Member 'Intercom_BP_C_OnSetState::InstantAnimation' has a wrong offset!");

// Function Intercom_BP.Intercom_BP_C.SetState
// 0x000C (0x000C - 0x0000)
struct Intercom_BP_C_SetState final
{
public:
	int32                                         StateIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreSound;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InstantAnimation;                                  // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Unused;                                            // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetState_Unused;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Intercom_BP_C_SetState) == 0x000004, "Wrong alignment on Intercom_BP_C_SetState");
static_assert(sizeof(Intercom_BP_C_SetState) == 0x00000C, "Wrong size on Intercom_BP_C_SetState");
static_assert(offsetof(Intercom_BP_C_SetState, StateIndex) == 0x000000, "Member 'Intercom_BP_C_SetState::StateIndex' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_SetState, IgnoreSound) == 0x000004, "Member 'Intercom_BP_C_SetState::IgnoreSound' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_SetState, InstantAnimation) == 0x000005, "Member 'Intercom_BP_C_SetState::InstantAnimation' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_SetState, Unused) == 0x000006, "Member 'Intercom_BP_C_SetState::Unused' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_SetState, CallFunc_Greater_IntInt_ReturnValue) == 0x000007, "Member 'Intercom_BP_C_SetState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_SetState, CallFunc_SetState_Unused) == 0x000008, "Member 'Intercom_BP_C_SetState::CallFunc_SetState_Unused' has a wrong offset!");

// Function Intercom_BP.Intercom_BP_C.GetInteraction
// 0x0048 (0x0048 - 0x0000)
struct Intercom_BP_C_GetInteraction final
{
public:
	struct FInteractionDescription                Description;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FInteractPayload                       Payload;                                           // 0x0028(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InteractDistance;                                  // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionType                              ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerInCombat_ReturnValue;             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Intercom_BP_C_GetInteraction) == 0x000008, "Wrong alignment on Intercom_BP_C_GetInteraction");
static_assert(sizeof(Intercom_BP_C_GetInteraction) == 0x000048, "Wrong size on Intercom_BP_C_GetInteraction");
static_assert(offsetof(Intercom_BP_C_GetInteraction, Description) == 0x000000, "Member 'Intercom_BP_C_GetInteraction::Description' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_GetInteraction, Payload) == 0x000028, "Member 'Intercom_BP_C_GetInteraction::Payload' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_GetInteraction, InteractDistance) == 0x000040, "Member 'Intercom_BP_C_GetInteraction::InteractDistance' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_GetInteraction, ReturnValue) == 0x000044, "Member 'Intercom_BP_C_GetInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_GetInteraction, CallFunc_IsPlayerInCombat_ReturnValue) == 0x000045, "Member 'Intercom_BP_C_GetInteraction::CallFunc_IsPlayerInCombat_ReturnValue' has a wrong offset!");

// Function Intercom_BP.Intercom_BP_C.GetSpeakerGameDataID
// 0x0020 (0x0020 - 0x0000)
struct Intercom_BP_C_GetSpeakerGameDataID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  InvalidGuid;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Intercom_BP_C_GetSpeakerGameDataID) == 0x000004, "Wrong alignment on Intercom_BP_C_GetSpeakerGameDataID");
static_assert(sizeof(Intercom_BP_C_GetSpeakerGameDataID) == 0x000020, "Wrong size on Intercom_BP_C_GetSpeakerGameDataID");
static_assert(offsetof(Intercom_BP_C_GetSpeakerGameDataID, ReturnValue) == 0x000000, "Member 'Intercom_BP_C_GetSpeakerGameDataID::ReturnValue' has a wrong offset!");
static_assert(offsetof(Intercom_BP_C_GetSpeakerGameDataID, InvalidGuid) == 0x000010, "Member 'Intercom_BP_C_GetSpeakerGameDataID::InvalidGuid' has a wrong offset!");

// Function Intercom_BP.Intercom_BP_C.GetConversationDescription
// 0x01F8 (0x01F8 - 0x0000)
struct Intercom_BP_C_GetConversationDescription final
{
public:
	struct FConversationDescription               ReturnValue;                                       // 0x0000(0x01F8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Intercom_BP_C_GetConversationDescription) == 0x000008, "Wrong alignment on Intercom_BP_C_GetConversationDescription");
static_assert(sizeof(Intercom_BP_C_GetConversationDescription) == 0x0001F8, "Wrong size on Intercom_BP_C_GetConversationDescription");
static_assert(offsetof(Intercom_BP_C_GetConversationDescription, ReturnValue) == 0x000000, "Member 'Intercom_BP_C_GetConversationDescription::ReturnValue' has a wrong offset!");

}

