#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransfer_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTransfer_BP.ItemTransfer_BP_C
// 0x0020 (0x03F0 - 0x03D0)
class UItemTransfer_BP_C final : public UItemTransferWidget
{
public:
	class UBackground1_BP_C*                      Background;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USurvivalBarGroupWidget_BP_C*           SurvivalBar;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTransfer_BP_C">();
	}
	static class UItemTransfer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTransfer_BP_C>();
	}
};
static_assert(alignof(UItemTransfer_BP_C) == 0x000008, "Wrong alignment on UItemTransfer_BP_C");
static_assert(sizeof(UItemTransfer_BP_C) == 0x0003F0, "Wrong size on UItemTransfer_BP_C");
static_assert(offsetof(UItemTransfer_BP_C, Background) == 0x0003D0, "Member 'UItemTransfer_BP_C::Background' has a wrong offset!");
static_assert(offsetof(UItemTransfer_BP_C, RetainerBox_0) == 0x0003D8, "Member 'UItemTransfer_BP_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UItemTransfer_BP_C, RetainerBox_1) == 0x0003E0, "Member 'UItemTransfer_BP_C::RetainerBox_1' has a wrong offset!");
static_assert(offsetof(UItemTransfer_BP_C, SurvivalBar) == 0x0003E8, "Member 'UItemTransfer_BP_C::SurvivalBar' has a wrong offset!");

}

