#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Joch_Flamethrower_Weapon_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function Joch_Flamethrower_Weapon_Base.Joch_Flamethrower_Weapon_Base_C.ExecuteUbergraph_Joch_Flamethrower_Weapon_Base
// 0x0010 (0x0010 - 0x0000)
struct Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base) == 0x000008, "Wrong alignment on Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base");
static_assert(sizeof(Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base) == 0x000010, "Wrong size on Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base");
static_assert(offsetof(Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base, EntryPoint) == 0x000000, "Member 'Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base, K2Node_Event_OtherActor) == 0x000008, "Member 'Joch_Flamethrower_Weapon_Base_C_ExecuteUbergraph_Joch_Flamethrower_Weapon_Base::K2Node_Event_OtherActor' has a wrong offset!");

// Function Joch_Flamethrower_Weapon_Base.Joch_Flamethrower_Weapon_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Joch_Flamethrower_Weapon_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Joch_Flamethrower_Weapon_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on Joch_Flamethrower_Weapon_Base_C_ReceiveTick");
static_assert(sizeof(Joch_Flamethrower_Weapon_Base_C_ReceiveTick) == 0x000004, "Wrong size on Joch_Flamethrower_Weapon_Base_C_ReceiveTick");
static_assert(offsetof(Joch_Flamethrower_Weapon_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Joch_Flamethrower_Weapon_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Joch_Flamethrower_Weapon_Base.Joch_Flamethrower_Weapon_Base_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Joch_Flamethrower_Weapon_Base_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

