#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LadderBase_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LadderBase_BP.LadderBase_BP_C
// 0x0030 (0x0348 - 0x0318)
class ALadderBase_BP_C : public ALadder
{
public:
	class UInteractableComponent*                 Interactable;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Interaction_Mesh_Top;                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Interaction_Mesh_Base;                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Visible_Mesh;                                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LadderBase_BP_C">();
	}
	static class ALadderBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALadderBase_BP_C>();
	}
};
static_assert(alignof(ALadderBase_BP_C) == 0x000008, "Wrong alignment on ALadderBase_BP_C");
static_assert(sizeof(ALadderBase_BP_C) == 0x000348, "Wrong size on ALadderBase_BP_C");
static_assert(offsetof(ALadderBase_BP_C, Interactable) == 0x000318, "Member 'ALadderBase_BP_C::Interactable' has a wrong offset!");
static_assert(offsetof(ALadderBase_BP_C, Interaction_Mesh_Top) == 0x000320, "Member 'ALadderBase_BP_C::Interaction_Mesh_Top' has a wrong offset!");
static_assert(offsetof(ALadderBase_BP_C, Arrow) == 0x000328, "Member 'ALadderBase_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(ALadderBase_BP_C, Interaction_Mesh_Base) == 0x000330, "Member 'ALadderBase_BP_C::Interaction_Mesh_Base' has a wrong offset!");
static_assert(offsetof(ALadderBase_BP_C, Visible_Mesh) == 0x000338, "Member 'ALadderBase_BP_C::Visible_Mesh' has a wrong offset!");
static_assert(offsetof(ALadderBase_BP_C, Scene) == 0x000340, "Member 'ALadderBase_BP_C::Scene' has a wrong offset!");

}

