#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ledger_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Ledger_BP.Ledger_BP_C
// 0x0080 (0x0498 - 0x0418)
class ULedger_BP_C final : public ULedgerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInCompanionItemViewer;                         // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutCharacter;                                  // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInCharacter;                                   // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fade;                                              // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackground1_BP_C*                      Background;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Edge;                                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPageAnchor1_BP_C*                      PageAnchor1_BP_C_0;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPageAnchor2_BP_C*                      PageAnchor2_BP_C_0;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootCanvas;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smoke;                                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smoke_Behind;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USurvivalBarGroupWidget_BP_C*           SurvivalBar;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TransitionsPlaybackSpeed;                          // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterRenderFadeTime;                           // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ledger_BP(int32 EntryPoint);
	void FadeInSharedItemViewer();
	void OnSetCurrentPage(ELedgerPages Page, bool bAnimate);
	void OnFinalizeMinimize();
	void OnFinalizeMaximize();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetupMaterialInstances(class UImage* Image, class UMaterialInstanceDynamic*& MaterialInstance, float& SizeX, float& SizeY);
	bool OnMinimize(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnMaximize(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnOutro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ledger_BP_C">();
	}
	static class ULedger_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULedger_BP_C>();
	}
};
static_assert(alignof(ULedger_BP_C) == 0x000008, "Wrong alignment on ULedger_BP_C");
static_assert(sizeof(ULedger_BP_C) == 0x000498, "Wrong size on ULedger_BP_C");
static_assert(offsetof(ULedger_BP_C, UberGraphFrame) == 0x000418, "Member 'ULedger_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, FadeInCompanionItemViewer) == 0x000420, "Member 'ULedger_BP_C::FadeInCompanionItemViewer' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, FadeOutCharacter) == 0x000428, "Member 'ULedger_BP_C::FadeOutCharacter' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, FadeInCharacter) == 0x000430, "Member 'ULedger_BP_C::FadeInCharacter' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Outro) == 0x000438, "Member 'ULedger_BP_C::Outro' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Intro) == 0x000440, "Member 'ULedger_BP_C::Intro' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Fade) == 0x000448, "Member 'ULedger_BP_C::Fade' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Background) == 0x000450, "Member 'ULedger_BP_C::Background' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Edge) == 0x000458, "Member 'ULedger_BP_C::Edge' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, PageAnchor1_BP_C_0) == 0x000460, "Member 'ULedger_BP_C::PageAnchor1_BP_C_0' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, PageAnchor2_BP_C_0) == 0x000468, "Member 'ULedger_BP_C::PageAnchor2_BP_C_0' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, RootCanvas) == 0x000470, "Member 'ULedger_BP_C::RootCanvas' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Smoke) == 0x000478, "Member 'ULedger_BP_C::Smoke' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, Smoke_Behind) == 0x000480, "Member 'ULedger_BP_C::Smoke_Behind' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, SurvivalBar) == 0x000488, "Member 'ULedger_BP_C::SurvivalBar' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, TransitionsPlaybackSpeed) == 0x000490, "Member 'ULedger_BP_C::TransitionsPlaybackSpeed' has a wrong offset!");
static_assert(offsetof(ULedger_BP_C, CharacterRenderFadeTime) == 0x000494, "Member 'ULedger_BP_C::CharacterRenderFadeTime' has a wrong offset!");

}

