#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapLegend_BP

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MapLegend_BP.MapLegend_BP_C
// 0x0058 (0x02D0 - 0x0278)
class UMapLegend_BP_C final : public UUserWidget
{
public:
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapLegend_BP_C">();
	}
	static class UMapLegend_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapLegend_BP_C>();
	}
};
static_assert(alignof(UMapLegend_BP_C) == 0x000008, "Wrong alignment on UMapLegend_BP_C");
static_assert(sizeof(UMapLegend_BP_C) == 0x0002D0, "Wrong size on UMapLegend_BP_C");
static_assert(offsetof(UMapLegend_BP_C, BackgroundPanelWidget) == 0x000278, "Member 'UMapLegend_BP_C::BackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_0) == 0x000280, "Member 'UMapLegend_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_1) == 0x000288, "Member 'UMapLegend_BP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_2) == 0x000290, "Member 'UMapLegend_BP_C::Image_2' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_3) == 0x000298, "Member 'UMapLegend_BP_C::Image_3' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_4) == 0x0002A0, "Member 'UMapLegend_BP_C::Image_4' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_5) == 0x0002A8, "Member 'UMapLegend_BP_C::Image_5' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_6) == 0x0002B0, "Member 'UMapLegend_BP_C::Image_6' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_7) == 0x0002B8, "Member 'UMapLegend_BP_C::Image_7' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_8) == 0x0002C0, "Member 'UMapLegend_BP_C::Image_8' has a wrong offset!");
static_assert(offsetof(UMapLegend_BP_C, Image_9) == 0x0002C8, "Member 'UMapLegend_BP_C::Image_9' has a wrong offset!");

}

