#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeleeLt_ImpactHammer_FPV_Visuals

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MeleeLt_ImpactHammer_FPV_Visuals.MeleeLt_ImpactHammer_FPV_Visuals_C.ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals
// 0x00D0 (0x00D0 - 0x0000)
struct MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponEvent                                  K2Node_Event_WeaponEvent;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventEffectParams                     K2Node_Event_Params;                               // 0x0020(0x0080)(ConstParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Hit_Flash_Scene_Color_Tint;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Hit_Flash_Delay_Duration;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals) == 0x000008, "Wrong alignment on MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals");
static_assert(sizeof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals) == 0x0000D0, "Wrong size on MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, EntryPoint) == 0x000000, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::EntryPoint' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, CallFunc_GetIndianaPC_ReturnValue) == 0x000008, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::CallFunc_GetIndianaPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, K2Node_Event_WeaponEvent) == 0x000018, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::K2Node_Event_WeaponEvent' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, K2Node_Event_Params) == 0x000020, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::K2Node_Event_Params' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000A0, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, CallFunc_Hit_Flash_Scene_Color_Tint) == 0x0000A8, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::CallFunc_Hit_Flash_Scene_Color_Tint' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, CallFunc_Hit_Flash_Delay_Duration) == 0x0000B8, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::CallFunc_Hit_Flash_Delay_Duration' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000BC, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals, K2Node_SwitchEnum_CmpSuccess) == 0x0000C8, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_ExecuteUbergraph_MeleeLt_ImpactHammer_FPV_Visuals::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function MeleeLt_ImpactHammer_FPV_Visuals.MeleeLt_ImpactHammer_FPV_Visuals_C.TriggerEventBP
// 0x0088 (0x0088 - 0x0000)
struct MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP final
{
public:
	EWeaponEvent                                  WeaponEvent;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventEffectParams                     Params_0;                                          // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP) == 0x000008, "Wrong alignment on MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP");
static_assert(sizeof(MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP) == 0x000088, "Wrong size on MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP, WeaponEvent) == 0x000000, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP::WeaponEvent' has a wrong offset!");
static_assert(offsetof(MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP, Params_0) == 0x000008, "Member 'MeleeLt_ImpactHammer_FPV_Visuals_C_TriggerEventBP::Params_0' has a wrong offset!");

}

