#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotoSynth

#include "Basic.hpp"

#include "MotoSynth_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "AudioMixer_classes.hpp"


namespace SDK
{

// Class MotoSynth.MotoSynthPreset
// 0x0068 (0x0098 - 0x0030)
class UMotoSynthPreset final : public UObject
{
public:
	struct FMotoSynthRuntimeSettings              Settings;                                          // 0x0030(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotoSynthPreset">();
	}
	static class UMotoSynthPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotoSynthPreset>();
	}
};
static_assert(alignof(UMotoSynthPreset) == 0x000008, "Wrong alignment on UMotoSynthPreset");
static_assert(sizeof(UMotoSynthPreset) == 0x000098, "Wrong size on UMotoSynthPreset");
static_assert(offsetof(UMotoSynthPreset, Settings) == 0x000030, "Member 'UMotoSynthPreset::Settings' has a wrong offset!");

// Class MotoSynth.MotoSynthSource
// 0x00D0 (0x0100 - 0x0030)
class UMotoSynthSource final : public UObject
{
public:
	bool                                          bConvertTo8Bit;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DownSampleFactor;                                  // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RPMCurve;                                          // 0x0038(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<float>                                 SourceData;                                        // 0x00C0(0x0010)(ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected)
	TArray<int16>                                 SourceDataPCM;                                     // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         SourceSampleRate;                                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGrainTableEntry>               GrainTable;                                        // 0x00E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotoSynthSource">();
	}
	static class UMotoSynthSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotoSynthSource>();
	}
};
static_assert(alignof(UMotoSynthSource) == 0x000008, "Wrong alignment on UMotoSynthSource");
static_assert(sizeof(UMotoSynthSource) == 0x000100, "Wrong size on UMotoSynthSource");
static_assert(offsetof(UMotoSynthSource, bConvertTo8Bit) == 0x000030, "Member 'UMotoSynthSource::bConvertTo8Bit' has a wrong offset!");
static_assert(offsetof(UMotoSynthSource, DownSampleFactor) == 0x000034, "Member 'UMotoSynthSource::DownSampleFactor' has a wrong offset!");
static_assert(offsetof(UMotoSynthSource, RPMCurve) == 0x000038, "Member 'UMotoSynthSource::RPMCurve' has a wrong offset!");
static_assert(offsetof(UMotoSynthSource, SourceData) == 0x0000C0, "Member 'UMotoSynthSource::SourceData' has a wrong offset!");
static_assert(offsetof(UMotoSynthSource, SourceDataPCM) == 0x0000D0, "Member 'UMotoSynthSource::SourceDataPCM' has a wrong offset!");
static_assert(offsetof(UMotoSynthSource, SourceSampleRate) == 0x0000E0, "Member 'UMotoSynthSource::SourceSampleRate' has a wrong offset!");
static_assert(offsetof(UMotoSynthSource, GrainTable) == 0x0000E8, "Member 'UMotoSynthSource::GrainTable' has a wrong offset!");

// Class MotoSynth.SynthComponentMoto
// 0x00C0 (0x07F0 - 0x0730)
class USynthComponentMoto final : public USynthComponent
{
public:
	class UMotoSynthPreset*                       MotoSynthPreset;                                   // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RPM;                                               // 0x0738(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73C[0xB4];                                     // 0x073C(0x00B4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetRPMRange(float* OutMinRPM, float* OutMaxRPM);
	void SetRPM(float InRPM, float InTimeSec);
	void SetSettings(const struct FMotoSynthRuntimeSettings& InSettings);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SynthComponentMoto">();
	}
	static class USynthComponentMoto* GetDefaultObj()
	{
		return GetDefaultObjImpl<USynthComponentMoto>();
	}
};
static_assert(alignof(USynthComponentMoto) == 0x000010, "Wrong alignment on USynthComponentMoto");
static_assert(sizeof(USynthComponentMoto) == 0x0007F0, "Wrong size on USynthComponentMoto");
static_assert(offsetof(USynthComponentMoto, MotoSynthPreset) == 0x000730, "Member 'USynthComponentMoto::MotoSynthPreset' has a wrong offset!");
static_assert(offsetof(USynthComponentMoto, RPM) == 0x000738, "Member 'USynthComponentMoto::RPM' has a wrong offset!");

}

