#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewSave_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function NewSave_BP.NewSave_BP_C.ExecuteUbergraph_NewSave_BP
// 0x00C8 (0x00C8 - 0x0000)
struct NewSave_BP_C_ExecuteUbergraph_NewSave_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_3;                // 0x0008(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x0038(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x0068(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0098(0x0030)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP) == 0x000008, "Wrong alignment on NewSave_BP_C_ExecuteUbergraph_NewSave_BP");
static_assert(sizeof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP) == 0x0000C8, "Wrong size on NewSave_BP_C_ExecuteUbergraph_NewSave_BP");
static_assert(offsetof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP, EntryPoint) == 0x000000, "Member 'NewSave_BP_C_ExecuteUbergraph_NewSave_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP, K2Node_ComponentBoundEvent_Event_3) == 0x000008, "Member 'NewSave_BP_C_ExecuteUbergraph_NewSave_BP::K2Node_ComponentBoundEvent_Event_3' has a wrong offset!");
static_assert(offsetof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP, K2Node_ComponentBoundEvent_Event_2) == 0x000038, "Member 'NewSave_BP_C_ExecuteUbergraph_NewSave_BP::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP, K2Node_ComponentBoundEvent_Event_1) == 0x000068, "Member 'NewSave_BP_C_ExecuteUbergraph_NewSave_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");
static_assert(offsetof(NewSave_BP_C_ExecuteUbergraph_NewSave_BP, K2Node_ComponentBoundEvent_Event) == 0x000098, "Member 'NewSave_BP_C_ExecuteUbergraph_NewSave_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");

// Function NewSave_BP.NewSave_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function NewSave_BP.NewSave_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function NewSave_BP.NewSave_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function NewSave_BP.NewSave_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'NewSave_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

