#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PageAnchor1_BP

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PageAnchor1_BP.PageAnchor1_BP_C
// 0x0020 (0x0298 - 0x0278)
class UPageAnchor1_BP_C final : public UUserWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PageAnchor1_BP_C">();
	}
	static class UPageAnchor1_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPageAnchor1_BP_C>();
	}
};
static_assert(alignof(UPageAnchor1_BP_C) == 0x000008, "Wrong alignment on UPageAnchor1_BP_C");
static_assert(sizeof(UPageAnchor1_BP_C) == 0x000298, "Wrong size on UPageAnchor1_BP_C");
static_assert(offsetof(UPageAnchor1_BP_C, Image_0) == 0x000278, "Member 'UPageAnchor1_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPageAnchor1_BP_C, Image_1) == 0x000280, "Member 'UPageAnchor1_BP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UPageAnchor1_BP_C, Image_2) == 0x000288, "Member 'UPageAnchor1_BP_C::Image_2' has a wrong offset!");
static_assert(offsetof(UPageAnchor1_BP_C, Image_3) == 0x000290, "Member 'UPageAnchor1_BP_C::Image_3' has a wrong offset!");

}

