#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialContextMenu_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function RadialContextMenu_BP.RadialContextMenu_BP_C.ExecuteUbergraph_RadialContextMenu_BP
// 0x0004 (0x0004 - 0x0000)
struct RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP) == 0x000004, "Wrong alignment on RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP");
static_assert(sizeof(RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP) == 0x000004, "Wrong size on RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP");
static_assert(offsetof(RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP, EntryPoint) == 0x000000, "Member 'RadialContextMenu_BP_C_ExecuteUbergraph_RadialContextMenu_BP::EntryPoint' has a wrong offset!");

// Function RadialContextMenu_BP.RadialContextMenu_BP_C.OnIntro
// 0x0014 (0x0014 - 0x0000)
struct RadialContextMenu_BP_C_OnIntro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RadialContextMenu_BP_C_OnIntro) == 0x000004, "Wrong alignment on RadialContextMenu_BP_C_OnIntro");
static_assert(sizeof(RadialContextMenu_BP_C_OnIntro) == 0x000014, "Wrong size on RadialContextMenu_BP_C_OnIntro");
static_assert(offsetof(RadialContextMenu_BP_C_OnIntro, AnimationCompleteCallback) == 0x000000, "Member 'RadialContextMenu_BP_C_OnIntro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(RadialContextMenu_BP_C_OnIntro, ReturnValue) == 0x000010, "Member 'RadialContextMenu_BP_C_OnIntro::ReturnValue' has a wrong offset!");

// Function RadialContextMenu_BP.RadialContextMenu_BP_C.OnOutro
// 0x0014 (0x0014 - 0x0000)
struct RadialContextMenu_BP_C_OnOutro final
{
public:
	TDelegate<void()>                             AnimationCompleteCallback;                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RadialContextMenu_BP_C_OnOutro) == 0x000004, "Wrong alignment on RadialContextMenu_BP_C_OnOutro");
static_assert(sizeof(RadialContextMenu_BP_C_OnOutro) == 0x000014, "Wrong size on RadialContextMenu_BP_C_OnOutro");
static_assert(offsetof(RadialContextMenu_BP_C_OnOutro, AnimationCompleteCallback) == 0x000000, "Member 'RadialContextMenu_BP_C_OnOutro::AnimationCompleteCallback' has a wrong offset!");
static_assert(offsetof(RadialContextMenu_BP_C_OnOutro, ReturnValue) == 0x000010, "Member 'RadialContextMenu_BP_C_OnOutro::ReturnValue' has a wrong offset!");

}

