#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBT_SentryBot_WeaponAnimations

#include "Basic.hpp"

#include "RBT_WeaponAnimations_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBT_SentryBot_WeaponAnimations.RBT_SentryBot_WeaponAnimations_C
// 0x0018 (0x02E8 - 0x02D0)
class URBT_SentryBot_WeaponAnimations_C : public URBT_WeaponAnimations_BP_C
{
public:
	class UBlendSpace1D*                          CombatLocomotion;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CombatShuffleLeftSequence;                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CombatShuffleRightSequence;                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBT_SentryBot_WeaponAnimations_C">();
	}
	static class URBT_SentryBot_WeaponAnimations_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URBT_SentryBot_WeaponAnimations_C>();
	}
};
static_assert(alignof(URBT_SentryBot_WeaponAnimations_C) == 0x000008, "Wrong alignment on URBT_SentryBot_WeaponAnimations_C");
static_assert(sizeof(URBT_SentryBot_WeaponAnimations_C) == 0x0002E8, "Wrong size on URBT_SentryBot_WeaponAnimations_C");
static_assert(offsetof(URBT_SentryBot_WeaponAnimations_C, CombatLocomotion) == 0x0002D0, "Member 'URBT_SentryBot_WeaponAnimations_C::CombatLocomotion' has a wrong offset!");
static_assert(offsetof(URBT_SentryBot_WeaponAnimations_C, CombatShuffleLeftSequence) == 0x0002D8, "Member 'URBT_SentryBot_WeaponAnimations_C::CombatShuffleLeftSequence' has a wrong offset!");
static_assert(offsetof(URBT_SentryBot_WeaponAnimations_C, CombatShuffleRightSequence) == 0x0002E0, "Member 'URBT_SentryBot_WeaponAnimations_C::CombatShuffleRightSequence' has a wrong offset!");

}

