#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveLoadDetail_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SaveLoadDetail_BP.SaveLoadDetail_BP_C.ExecuteUbergraph_SaveLoadDetail_BP
// 0x0138 (0x0138 - 0x0000)
struct SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_3;                // 0x0008(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x0038(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x0068(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0098(0x0030)(ConstParm, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D8(0x0028)()
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue_1;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0110(0x0028)()
};
static_assert(alignof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP) == 0x000008, "Wrong alignment on SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP");
static_assert(sizeof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP) == 0x000138, "Wrong size on SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, EntryPoint) == 0x000000, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, K2Node_ComponentBoundEvent_Event_3) == 0x000008, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::K2Node_ComponentBoundEvent_Event_3' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, K2Node_ComponentBoundEvent_Event_2) == 0x000038, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, K2Node_ComponentBoundEvent_Event_1) == 0x000068, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, K2Node_ComponentBoundEvent_Event) == 0x000098, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, CallFunc_GetColorByType_ReturnValue) == 0x0000C8, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, K2Node_MakeStruct_SlateColor) == 0x0000D8, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, CallFunc_GetColorByType_ReturnValue_1) == 0x000100, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::CallFunc_GetColorByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP, K2Node_MakeStruct_SlateColor_1) == 0x000110, "Member 'SaveLoadDetail_BP_C_ExecuteUbergraph_SaveLoadDetail_BP::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function SaveLoadDetail_BP.SaveLoadDetail_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function SaveLoadDetail_BP.SaveLoadDetail_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function SaveLoadDetail_BP.SaveLoadDetail_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_1_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function SaveLoadDetail_BP.SaveLoadDetail_BP_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'SaveLoadDetail_BP_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

