#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveLoadMenu_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveLoadMenu_BP.SaveLoadMenu_BP_C
// 0x0018 (0x03F0 - 0x03D8)
class USaveLoadMenu_BP_C final : public USaveLoadMenuWidget
{
public:
	class UWidgetAnimation*                       Outro;                                             // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnOutro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveLoadMenu_BP_C">();
	}
	static class USaveLoadMenu_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveLoadMenu_BP_C>();
	}
};
static_assert(alignof(USaveLoadMenu_BP_C) == 0x000008, "Wrong alignment on USaveLoadMenu_BP_C");
static_assert(sizeof(USaveLoadMenu_BP_C) == 0x0003F0, "Wrong size on USaveLoadMenu_BP_C");
static_assert(offsetof(USaveLoadMenu_BP_C, Outro) == 0x0003D8, "Member 'USaveLoadMenu_BP_C::Outro' has a wrong offset!");
static_assert(offsetof(USaveLoadMenu_BP_C, Intro) == 0x0003E0, "Member 'USaveLoadMenu_BP_C::Intro' has a wrong offset!");
static_assert(offsetof(USaveLoadMenu_BP_C, BackgroundPanelWidget) == 0x0003E8, "Member 'USaveLoadMenu_BP_C::BackgroundPanelWidget' has a wrong offset!");

}

