#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SE_GloopGunEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SE_GloopGunEffect.SE_GloopGunEffect_C.ExecuteUbergraph_SE_GloopGunEffect
// 0x0068 (0x0068 - 0x0000)
struct SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Ratio;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRestoredFromSave;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshComponent_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect) == 0x000008, "Wrong alignment on SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect");
static_assert(sizeof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect) == 0x000068, "Wrong size on SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, EntryPoint) == 0x000000, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, K2Node_Event_Target) == 0x000008, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, K2Node_Event_Target_1) == 0x000010, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, K2Node_Event_Ratio) == 0x000018, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::K2Node_Event_Ratio' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, K2Node_Event_bRestoredFromSave) == 0x00001C, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::K2Node_Event_bRestoredFromSave' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_GetSkeletalMeshComponent_ReturnValue) == 0x000020, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_GetSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_GetCenterOfMass_ReturnValue) == 0x000030, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_ClassIsChildOf_ReturnValue) == 0x00003C, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_FindClosestBone_K2_BoneLocation) == 0x000040, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_FindClosestBone_K2_ReturnValue) == 0x00004C, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000058, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'SE_GloopGunEffect_C_ExecuteUbergraph_SE_GloopGunEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SE_GloopGunEffect.SE_GloopGunEffect_C.ReceiveClearEffect
// 0x0008 (0x0008 - 0x0000)
struct SE_GloopGunEffect_C_ReceiveClearEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SE_GloopGunEffect_C_ReceiveClearEffect) == 0x000008, "Wrong alignment on SE_GloopGunEffect_C_ReceiveClearEffect");
static_assert(sizeof(SE_GloopGunEffect_C_ReceiveClearEffect) == 0x000008, "Wrong size on SE_GloopGunEffect_C_ReceiveClearEffect");
static_assert(offsetof(SE_GloopGunEffect_C_ReceiveClearEffect, Target) == 0x000000, "Member 'SE_GloopGunEffect_C_ReceiveClearEffect::Target' has a wrong offset!");

// Function SE_GloopGunEffect.SE_GloopGunEffect_C.ReceiveApplyEffect
// 0x0010 (0x0010 - 0x0000)
struct SE_GloopGunEffect_C_ReceiveApplyEffect final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRestoredFromSave;                                 // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SE_GloopGunEffect_C_ReceiveApplyEffect) == 0x000008, "Wrong alignment on SE_GloopGunEffect_C_ReceiveApplyEffect");
static_assert(sizeof(SE_GloopGunEffect_C_ReceiveApplyEffect) == 0x000010, "Wrong size on SE_GloopGunEffect_C_ReceiveApplyEffect");
static_assert(offsetof(SE_GloopGunEffect_C_ReceiveApplyEffect, Target) == 0x000000, "Member 'SE_GloopGunEffect_C_ReceiveApplyEffect::Target' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ReceiveApplyEffect, Ratio) == 0x000008, "Member 'SE_GloopGunEffect_C_ReceiveApplyEffect::Ratio' has a wrong offset!");
static_assert(offsetof(SE_GloopGunEffect_C_ReceiveApplyEffect, bRestoredFromSave) == 0x00000C, "Member 'SE_GloopGunEffect_C_ReceiveApplyEffect::bRestoredFromSave' has a wrong offset!");

}

