#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsMenu_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsMenu_BP.SettingsMenu_BP_C
// 0x0020 (0x0698 - 0x0678)
class USettingsMenu_BP_C final : public USettingsMenuWidget
{
public:
	class UWidgetAnimation*                       Outro;                                             // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundPanelWidget_C*               BackgroundPanelWidget;                             // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootCanvas;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool OnOutro(const TDelegate<void()>& AnimationCompleteCallback);
	bool OnIntro(const TDelegate<void()>& AnimationCompleteCallback);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsMenu_BP_C">();
	}
	static class USettingsMenu_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsMenu_BP_C>();
	}
};
static_assert(alignof(USettingsMenu_BP_C) == 0x000008, "Wrong alignment on USettingsMenu_BP_C");
static_assert(sizeof(USettingsMenu_BP_C) == 0x000698, "Wrong size on USettingsMenu_BP_C");
static_assert(offsetof(USettingsMenu_BP_C, Outro) == 0x000678, "Member 'USettingsMenu_BP_C::Outro' has a wrong offset!");
static_assert(offsetof(USettingsMenu_BP_C, Intro) == 0x000680, "Member 'USettingsMenu_BP_C::Intro' has a wrong offset!");
static_assert(offsetof(USettingsMenu_BP_C, BackgroundPanelWidget) == 0x000688, "Member 'USettingsMenu_BP_C::BackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(USettingsMenu_BP_C, RootCanvas) == 0x000690, "Member 'USettingsMenu_BP_C::RootCanvas' has a wrong offset!");

}

