#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsMenuKeyRebind_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function SettingsMenuKeyRebind_BP.SettingsMenuKeyRebind_BP_C.ExecuteUbergraph_SettingsMenuKeyRebind_BP
// 0x0038 (0x0038 - 0x0000)
struct SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x0008(0x0030)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP) == 0x000008, "Wrong alignment on SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP");
static_assert(sizeof(SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP) == 0x000038, "Wrong size on SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP");
static_assert(offsetof(SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP, EntryPoint) == 0x000000, "Member 'SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP, K2Node_ComponentBoundEvent_Event) == 0x000008, "Member 'SettingsMenuKeyRebind_BP_C_ExecuteUbergraph_SettingsMenuKeyRebind_BP::K2Node_ComponentBoundEvent_Event' has a wrong offset!");

// Function SettingsMenuKeyRebind_BP.SettingsMenuKeyRebind_BP_C.BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'SettingsMenuKeyRebind_BP_C_BndEvt__GameplayButton_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

