#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShipAI_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShipAI_AnimBP.ShipAI_AnimBP_C.ExecuteUbergraph_ShipAI_AnimBP
// 0x0040 (0x0040 - 0x0000)
struct ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocomotionAnimationSet*                K2Node_Event_NewLocomtionAnimationSet;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTPVPersonalitySet*                     K2Node_Event_Personality;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTPVPersonalitySet*                     K2Node_DynamicCast_AsTPVPersonality_Set;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponAnimations*                      K2Node_Event_NewWeaponAnimations;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimationsTPV_BP_C*              K2Node_DynamicCast_AsWeapon_Animations_TPV_BP;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP) == 0x000008, "Wrong alignment on ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP");
static_assert(sizeof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP) == 0x000040, "Wrong size on ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, EntryPoint) == 0x000000, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_Event_NewLocomtionAnimationSet) == 0x000008, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_Event_NewLocomtionAnimationSet' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_Event_Personality) == 0x000010, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_Event_Personality' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_DynamicCast_AsTPVPersonality_Set) == 0x000018, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_DynamicCast_AsTPVPersonality_Set' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_Event_NewWeaponAnimations) == 0x000028, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_Event_NewWeaponAnimations' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_DynamicCast_AsWeapon_Animations_TPV_BP) == 0x000030, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_DynamicCast_AsWeapon_Animations_TPV_BP' has a wrong offset!");
static_assert(offsetof(ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ShipAI_AnimBP_C_ExecuteUbergraph_ShipAI_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ShipAI_AnimBP.ShipAI_AnimBP_C.OnNewWeaponAnimations
// 0x0008 (0x0008 - 0x0000)
struct ShipAI_AnimBP_C_OnNewWeaponAnimations final
{
public:
	class UWeaponAnimations*                      NewWeaponAnimations;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShipAI_AnimBP_C_OnNewWeaponAnimations) == 0x000008, "Wrong alignment on ShipAI_AnimBP_C_OnNewWeaponAnimations");
static_assert(sizeof(ShipAI_AnimBP_C_OnNewWeaponAnimations) == 0x000008, "Wrong size on ShipAI_AnimBP_C_OnNewWeaponAnimations");
static_assert(offsetof(ShipAI_AnimBP_C_OnNewWeaponAnimations, NewWeaponAnimations) == 0x000000, "Member 'ShipAI_AnimBP_C_OnNewWeaponAnimations::NewWeaponAnimations' has a wrong offset!");

// Function ShipAI_AnimBP.ShipAI_AnimBP_C.SetPersonality
// 0x0008 (0x0008 - 0x0000)
struct ShipAI_AnimBP_C_SetPersonality final
{
public:
	class UTPVPersonalitySet*                     Personality;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShipAI_AnimBP_C_SetPersonality) == 0x000008, "Wrong alignment on ShipAI_AnimBP_C_SetPersonality");
static_assert(sizeof(ShipAI_AnimBP_C_SetPersonality) == 0x000008, "Wrong size on ShipAI_AnimBP_C_SetPersonality");
static_assert(offsetof(ShipAI_AnimBP_C_SetPersonality, Personality) == 0x000000, "Member 'ShipAI_AnimBP_C_SetPersonality::Personality' has a wrong offset!");

// Function ShipAI_AnimBP.ShipAI_AnimBP_C.OnNewLocomotionAnimationSet
// 0x0008 (0x0008 - 0x0000)
struct ShipAI_AnimBP_C_OnNewLocomotionAnimationSet final
{
public:
	class ULocomotionAnimationSet*                NewLocomtionAnimationSet;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShipAI_AnimBP_C_OnNewLocomotionAnimationSet) == 0x000008, "Wrong alignment on ShipAI_AnimBP_C_OnNewLocomotionAnimationSet");
static_assert(sizeof(ShipAI_AnimBP_C_OnNewLocomotionAnimationSet) == 0x000008, "Wrong size on ShipAI_AnimBP_C_OnNewLocomotionAnimationSet");
static_assert(offsetof(ShipAI_AnimBP_C_OnNewLocomotionAnimationSet, NewLocomtionAnimationSet) == 0x000000, "Member 'ShipAI_AnimBP_C_OnNewLocomotionAnimationSet::NewLocomtionAnimationSet' has a wrong offset!");

// Function ShipAI_AnimBP.ShipAI_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ShipAI_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShipAI_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ShipAI_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(ShipAI_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ShipAI_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(ShipAI_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ShipAI_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ShipAI_AnimBP.ShipAI_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ShipAI_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ShipAI_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ShipAI_AnimBP_C_AnimGraph");
static_assert(sizeof(ShipAI_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on ShipAI_AnimBP_C_AnimGraph");
static_assert(offsetof(ShipAI_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ShipAI_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

