#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsPerkSummaryEntry_BP1

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function StatsPerkSummaryEntry_BP1.StatsPerkSummaryEntry_BP1_C.ExecuteUbergraph_StatsPerkSummaryEntry_BP1
// 0x0138 (0x0138 - 0x0000)
struct StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_3;                // 0x0040(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_2;                // 0x0070(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event_1;                // 0x00A0(0x0030)(ConstParm, ContainsInstancedReference)
	struct FComponentEvent                        K2Node_ComponentBoundEvent_Event;                  // 0x00D0(0x0030)(ConstParm, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_GetColorByType_ReturnValue_1;             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0110(0x0028)()
};
static_assert(alignof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1) == 0x000008, "Wrong alignment on StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1");
static_assert(sizeof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1) == 0x000138, "Wrong size on StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, EntryPoint) == 0x000000, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, CallFunc_GetColorByType_ReturnValue) == 0x000004, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::CallFunc_GetColorByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, K2Node_ComponentBoundEvent_Event_3) == 0x000040, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::K2Node_ComponentBoundEvent_Event_3' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, K2Node_ComponentBoundEvent_Event_2) == 0x000070, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::K2Node_ComponentBoundEvent_Event_2' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, K2Node_ComponentBoundEvent_Event_1) == 0x0000A0, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::K2Node_ComponentBoundEvent_Event_1' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, K2Node_ComponentBoundEvent_Event) == 0x0000D0, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::K2Node_ComponentBoundEvent_Event' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, CallFunc_GetColorByType_ReturnValue_1) == 0x000100, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::CallFunc_GetColorByType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1, K2Node_MakeStruct_SlateColor_1) == 0x000110, "Member 'StatsPerkSummaryEntry_BP1_C_ExecuteUbergraph_StatsPerkSummaryEntry_BP1::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function StatsPerkSummaryEntry_BP1.StatsPerkSummaryEntry_BP1_C.BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_3_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsPerkSummaryEntry_BP1.StatsPerkSummaryEntry_BP1_C.BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_2_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsPerkSummaryEntry_BP1.StatsPerkSummaryEntry_BP1_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_0_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

// Function StatsPerkSummaryEntry_BP1.StatsPerkSummaryEntry_BP1_C.BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature final
{
public:
	struct FComponentEvent                        Event;                                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature) == 0x000008, "Wrong alignment on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature");
static_assert(sizeof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature) == 0x000030, "Wrong size on StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature");
static_assert(offsetof(StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature, Event) == 0x000000, "Member 'StatsPerkSummaryEntry_BP1_C_BndEvt__Button_K2Node_ComponentBoundEvent_15_ComponentEventMCD__DelegateSignature::Event' has a wrong offset!");

}

