#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwitchBase_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"
#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SwitchBase_BP.SwitchBase_BP_C
// 0x0018 (0x0368 - 0x0350)
class ASwitchBase_BP_C : public ASwitch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 AudioComponentClass;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USwitchAudioComponent*                  AudioComponent;                                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SwitchBase_BP(int32 EntryPoint);
	void OnSwitchStateChanged_Event_0(class AActor* Initiator, int32 StateIndex);
	void PlayChangedAudio();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void UpdateCurrentState(bool IgnoreSound, bool InstantAnimation);
	void SetState(int32 StateIndex, bool IgnoreSound, bool InstantAnimation, bool* Unused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SwitchBase_BP_C">();
	}
	static class ASwitchBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASwitchBase_BP_C>();
	}
};
static_assert(alignof(ASwitchBase_BP_C) == 0x000008, "Wrong alignment on ASwitchBase_BP_C");
static_assert(sizeof(ASwitchBase_BP_C) == 0x000368, "Wrong size on ASwitchBase_BP_C");
static_assert(offsetof(ASwitchBase_BP_C, UberGraphFrame) == 0x000350, "Member 'ASwitchBase_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASwitchBase_BP_C, AudioComponentClass) == 0x000358, "Member 'ASwitchBase_BP_C::AudioComponentClass' has a wrong offset!");
static_assert(offsetof(ASwitchBase_BP_C, AudioComponent) == 0x000360, "Member 'ASwitchBase_BP_C::AudioComponent' has a wrong offset!");

}

