#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TechyPillar_A_Lit_Blue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TechyPillar_A_Lit_Blue.TechyPillar_A_Lit_Blue_C
// 0x0040 (0x02F8 - 0x02B8)
class ATechyPillar_A_Lit_Blue_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   IndPlrTchy_Lit_Blue;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight3;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight2;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TechyPillar_A_Lit_Blue(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TechyPillar_A_Lit_Blue_C">();
	}
	static class ATechyPillar_A_Lit_Blue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATechyPillar_A_Lit_Blue_C>();
	}
};
static_assert(alignof(ATechyPillar_A_Lit_Blue_C) == 0x000008, "Wrong alignment on ATechyPillar_A_Lit_Blue_C");
static_assert(sizeof(ATechyPillar_A_Lit_Blue_C) == 0x0002F8, "Wrong size on ATechyPillar_A_Lit_Blue_C");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, UberGraphFrame) == 0x0002B8, "Member 'ATechyPillar_A_Lit_Blue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, IndPlrTchy_Lit_Blue) == 0x0002C0, "Member 'ATechyPillar_A_Lit_Blue_C::IndPlrTchy_Lit_Blue' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, PointLight) == 0x0002C8, "Member 'ATechyPillar_A_Lit_Blue_C::PointLight' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, PointLight3) == 0x0002D0, "Member 'ATechyPillar_A_Lit_Blue_C::PointLight3' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, PointLight2) == 0x0002D8, "Member 'ATechyPillar_A_Lit_Blue_C::PointLight2' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, StaticMeshComponent0) == 0x0002E0, "Member 'ATechyPillar_A_Lit_Blue_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, SharedRoot) == 0x0002E8, "Member 'ATechyPillar_A_Lit_Blue_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ATechyPillar_A_Lit_Blue_C, UseLight) == 0x0002F0, "Member 'ATechyPillar_A_Lit_Blue_C::UseLight' has a wrong offset!");

}

