#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeleportDoorBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.ExecuteUbergraph_TeleportDoorBase_BP
// 0x0050 (0x0050 - 0x0000)
struct TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerController*               CallFunc_GetIndianaPlayerController_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerController*               CallFunc_GetIndianaPlayerController_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP) == 0x000008, "Wrong alignment on TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP");
static_assert(sizeof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP) == 0x000050, "Wrong size on TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, EntryPoint) == 0x000000, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, K2Node_CustomEvent_Actor) == 0x000038, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, CallFunc_GetIndianaPlayerController_ReturnValue) == 0x000040, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::CallFunc_GetIndianaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP, CallFunc_GetIndianaPlayerController_ReturnValue_1) == 0x000048, "Member 'TeleportDoorBase_BP_C_ExecuteUbergraph_TeleportDoorBase_BP::CallFunc_GetIndianaPlayerController_ReturnValue_1' has a wrong offset!");

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.OnInteract_Event
// 0x0008 (0x0008 - 0x0000)
struct TeleportDoorBase_BP_C_OnInteract_Event final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeleportDoorBase_BP_C_OnInteract_Event) == 0x000008, "Wrong alignment on TeleportDoorBase_BP_C_OnInteract_Event");
static_assert(sizeof(TeleportDoorBase_BP_C_OnInteract_Event) == 0x000008, "Wrong size on TeleportDoorBase_BP_C_OnInteract_Event");
static_assert(offsetof(TeleportDoorBase_BP_C_OnInteract_Event, Actor) == 0x000000, "Member 'TeleportDoorBase_BP_C_OnInteract_Event::Actor' has a wrong offset!");

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.TeleportToStart
// 0x0018 (0x0018 - 0x0000)
struct TeleportDoorBase_BP_C_TeleportToStart final
{
public:
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerStart*                    K2Node_DynamicCast_AsIndiana_Player_Start;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeleportDoorBase_BP_C_TeleportToStart) == 0x000008, "Wrong alignment on TeleportDoorBase_BP_C_TeleportToStart");
static_assert(sizeof(TeleportDoorBase_BP_C_TeleportToStart) == 0x000018, "Wrong size on TeleportDoorBase_BP_C_TeleportToStart");
static_assert(offsetof(TeleportDoorBase_BP_C_TeleportToStart, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000000, "Member 'TeleportDoorBase_BP_C_TeleportToStart::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_TeleportToStart, K2Node_DynamicCast_AsIndiana_Player_Start) == 0x000008, "Member 'TeleportDoorBase_BP_C_TeleportToStart::K2Node_DynamicCast_AsIndiana_Player_Start' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_TeleportToStart, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TeleportDoorBase_BP_C_TeleportToStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_TeleportToStart, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'TeleportDoorBase_BP_C_TeleportToStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.FadeOut
// 0x0030 (0x0030 - 0x0000)
struct TeleportDoorBase_BP_C_FadeOut final
{
public:
	float                                         FadeOutTime_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             FadeOutComplete;                                   // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerController*               CallFunc_GetIndianaPlayerController_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeleportDoorBase_BP_C_FadeOut) == 0x000008, "Wrong alignment on TeleportDoorBase_BP_C_FadeOut");
static_assert(sizeof(TeleportDoorBase_BP_C_FadeOut) == 0x000030, "Wrong size on TeleportDoorBase_BP_C_FadeOut");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeOut, FadeOutTime_0) == 0x000000, "Member 'TeleportDoorBase_BP_C_FadeOut::FadeOutTime_0' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeOut, FadeOutComplete) == 0x000004, "Member 'TeleportDoorBase_BP_C_FadeOut::FadeOutComplete' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeOut, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'TeleportDoorBase_BP_C_FadeOut::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeOut, CallFunc_GetIndianaPlayerController_ReturnValue) == 0x000020, "Member 'TeleportDoorBase_BP_C_FadeOut::CallFunc_GetIndianaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeOut, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'TeleportDoorBase_BP_C_FadeOut::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.FadeIn
// 0x0030 (0x0030 - 0x0000)
struct TeleportDoorBase_BP_C_FadeIn final
{
public:
	float                                         FadeInTime_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             FadeInComplete;                                    // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AIndianaPlayerController*               CallFunc_GetIndianaPlayerController_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeleportDoorBase_BP_C_FadeIn) == 0x000008, "Wrong alignment on TeleportDoorBase_BP_C_FadeIn");
static_assert(sizeof(TeleportDoorBase_BP_C_FadeIn) == 0x000030, "Wrong size on TeleportDoorBase_BP_C_FadeIn");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeIn, FadeInTime_0) == 0x000000, "Member 'TeleportDoorBase_BP_C_FadeIn::FadeInTime_0' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeIn, FadeInComplete) == 0x000004, "Member 'TeleportDoorBase_BP_C_FadeIn::FadeInComplete' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeIn, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'TeleportDoorBase_BP_C_FadeIn::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeIn, CallFunc_GetIndianaPlayerController_ReturnValue) == 0x000020, "Member 'TeleportDoorBase_BP_C_FadeIn::CallFunc_GetIndianaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_FadeIn, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'TeleportDoorBase_BP_C_FadeIn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.GetInteraction
// 0x0048 (0x0048 - 0x0000)
struct TeleportDoorBase_BP_C_GetInteraction final
{
public:
	struct FInteractionDescription                Description;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	struct FInteractPayload                       Payload;                                           // 0x0028(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InteractDistance;                                  // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionType                              ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeleportDoorBase_BP_C_GetInteraction) == 0x000008, "Wrong alignment on TeleportDoorBase_BP_C_GetInteraction");
static_assert(sizeof(TeleportDoorBase_BP_C_GetInteraction) == 0x000048, "Wrong size on TeleportDoorBase_BP_C_GetInteraction");
static_assert(offsetof(TeleportDoorBase_BP_C_GetInteraction, Description) == 0x000000, "Member 'TeleportDoorBase_BP_C_GetInteraction::Description' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_GetInteraction, Payload) == 0x000028, "Member 'TeleportDoorBase_BP_C_GetInteraction::Payload' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_GetInteraction, InteractDistance) == 0x000040, "Member 'TeleportDoorBase_BP_C_GetInteraction::InteractDistance' has a wrong offset!");
static_assert(offsetof(TeleportDoorBase_BP_C_GetInteraction, ReturnValue) == 0x000044, "Member 'TeleportDoorBase_BP_C_GetInteraction::ReturnValue' has a wrong offset!");

// Function TeleportDoorBase_BP.TeleportDoorBase_BP_C.GetInteractLocString
// 0x0008 (0x0008 - 0x0000)
struct TeleportDoorBase_BP_C_GetInteractLocString final
{
public:
	struct FLocString                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeleportDoorBase_BP_C_GetInteractLocString) == 0x000004, "Wrong alignment on TeleportDoorBase_BP_C_GetInteractLocString");
static_assert(sizeof(TeleportDoorBase_BP_C_GetInteractLocString) == 0x000008, "Wrong size on TeleportDoorBase_BP_C_GetInteractLocString");
static_assert(offsetof(TeleportDoorBase_BP_C_GetInteractLocString, ReturnValue) == 0x000000, "Member 'TeleportDoorBase_BP_C_GetInteractLocString::ReturnValue' has a wrong offset!");

}

