#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimelineMeshTransform

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct TimelineMeshTransform.TimelineMeshTransform
// 0x0038 (0x0038 - 0x0000)
struct FTimelineMeshTransform final
{
public:
	class UStaticMeshComponent*                   Mesh_10_09E530194C82E6114DAA69848495D826;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Position0_3_DB8A8EF54CF96198C140C59B8B2EB87E;      // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Position1_5_20D7916144822431D178AFA6153582F1;      // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotator0_24_C7ED1A3A41EE6C3738FB288530AD3E9A;      // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Rotator1_26_A58F49924467545C76FAF1B263AB6A95;      // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FTimelineMeshTransform) == 0x000008, "Wrong alignment on FTimelineMeshTransform");
static_assert(sizeof(FTimelineMeshTransform) == 0x000038, "Wrong size on FTimelineMeshTransform");
static_assert(offsetof(FTimelineMeshTransform, Mesh_10_09E530194C82E6114DAA69848495D826) == 0x000000, "Member 'FTimelineMeshTransform::Mesh_10_09E530194C82E6114DAA69848495D826' has a wrong offset!");
static_assert(offsetof(FTimelineMeshTransform, Position0_3_DB8A8EF54CF96198C140C59B8B2EB87E) == 0x000008, "Member 'FTimelineMeshTransform::Position0_3_DB8A8EF54CF96198C140C59B8B2EB87E' has a wrong offset!");
static_assert(offsetof(FTimelineMeshTransform, Position1_5_20D7916144822431D178AFA6153582F1) == 0x000014, "Member 'FTimelineMeshTransform::Position1_5_20D7916144822431D178AFA6153582F1' has a wrong offset!");
static_assert(offsetof(FTimelineMeshTransform, Rotator0_24_C7ED1A3A41EE6C3738FB288530AD3E9A) == 0x000020, "Member 'FTimelineMeshTransform::Rotator0_24_C7ED1A3A41EE6C3738FB288530AD3E9A' has a wrong offset!");
static_assert(offsetof(FTimelineMeshTransform, Rotator1_26_A58F49924467545C76FAF1B263AB6A95) == 0x00002C, "Member 'FTimelineMeshTransform::Rotator1_26_A58F49924467545C76FAF1B263AB6A95' has a wrong offset!");

}

