#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Electric_Fence_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.ExecuteUbergraph_Trap_Electric_Fence_BP
// 0x0150 (0x0150 - 0x0000)
struct Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float SecondsTilDeployment)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_3;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Instigator)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_3;                   // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Armed;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SecondsTilDeployment;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_2;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABeamLauncher*                          K2Node_DynamicCast_AsBeam_Launcher;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABeamLauncher*                          K2Node_DynamicCast_AsBeam_Launcher_1;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_2;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_3;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_4;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP) == 0x000008, "Wrong alignment on Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP");
static_assert(sizeof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP) == 0x000150, "Wrong size on Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, EntryPoint) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, Temp_int_Variable) == 0x000004, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, Temp_bool_Variable) == 0x000008, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, Temp_int_Variable_1) == 0x000010, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, Temp_int_Variable_2) == 0x000014, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, Temp_int_Variable_3) == 0x000040, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x000054, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, Temp_int_Variable_4) == 0x000058, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_MakeStruct_LinearColor) == 0x00005C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Add_IntInt_ReturnValue_4) == 0x00006C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_MakeStruct_LinearColor_1) == 0x000070, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_MakeStruct_LinearColor_2) == 0x000080, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_MakeStruct_LinearColor_3) == 0x000090, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_MakeStruct_LinearColor_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_Event_Armed) == 0x0000A0, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_Event_Armed' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_GetMaterialIndex_ReturnValue) == 0x0000B8, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_Select_Default) == 0x0000C0, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_CustomEvent_SecondsTilDeployment) == 0x0000C8, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_CustomEvent_SecondsTilDeployment' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Get_Item_2) == 0x0000E0, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0000E8, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000EC, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_DynamicCast_AsBeam_Launcher) == 0x0000F0, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_DynamicCast_AsBeam_Launcher' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_DynamicCast_AsBeam_Launcher_1) == 0x000100, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_DynamicCast_AsBeam_Launcher_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, K2Node_CustomEvent_Instigator) == 0x000110, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_PostEventAtLocation_ReturnValue) == 0x000124, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000128, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_PostEventAtLocation_ReturnValue_2) == 0x00012C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_PostEventAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Get_Item_3) == 0x000130, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Length_ReturnValue_3) == 0x000138, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Less_IntInt_ReturnValue_3) == 0x00013C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Get_Item_4) == 0x000140, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Array_Length_ReturnValue_4) == 0x000148, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP, CallFunc_Less_IntInt_ReturnValue_4) == 0x00014C, "Member 'Trap_Electric_Fence_BP_C_ExecuteUbergraph_Trap_Electric_Fence_BP::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.BeamLauncher_Destroyed
// 0x0008 (0x0008 - 0x0000)
struct Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed) == 0x000008, "Wrong alignment on Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed");
static_assert(sizeof(Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed) == 0x000008, "Wrong size on Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed");
static_assert(offsetof(Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed, Instigator_0) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_BeamLauncher_Destroyed::Instigator_0' has a wrong offset!");

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.OnTrapTriggerPreDeploy_Event_0
// 0x0004 (0x0004 - 0x0000)
struct Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0 final
{
public:
	float                                         SecondsTilDeployment;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0) == 0x000004, "Wrong alignment on Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0");
static_assert(sizeof(Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0) == 0x000004, "Wrong size on Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0");
static_assert(offsetof(Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0, SecondsTilDeployment) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_OnTrapTriggerPreDeploy_Event_0::SecondsTilDeployment' has a wrong offset!");

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.SetArmed
// 0x0001 (0x0001 - 0x0000)
struct Trap_Electric_Fence_BP_C_SetArmed final
{
public:
	bool                                          Armed;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_SetArmed) == 0x000001, "Wrong alignment on Trap_Electric_Fence_BP_C_SetArmed");
static_assert(sizeof(Trap_Electric_Fence_BP_C_SetArmed) == 0x000001, "Wrong size on Trap_Electric_Fence_BP_C_SetArmed");
static_assert(offsetof(Trap_Electric_Fence_BP_C_SetArmed, Armed) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_SetArmed::Armed' has a wrong offset!");

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.UserConstructionScript
// 0x0218 (0x0218 - 0x0000)
struct Trap_Electric_Fence_BP_C_UserConstructionScript final
{
public:
	TArray<class UParticleSystemComponent*>       K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsArmed_IsArmed;                          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Trap_Electric_Fence_BP_C_UserConstructionScript");
static_assert(sizeof(Trap_Electric_Fence_BP_C_UserConstructionScript) == 0x000218, "Wrong size on Trap_Electric_Fence_BP_C_UserConstructionScript");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_Abs_ReturnValue) == 0x000010, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_IsArmed_IsArmed) == 0x000034, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_IsArmed_IsArmed' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_VLerp_ReturnValue) == 0x000038, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000044, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000048, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x00004C, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000050, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00005C, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x0000E4, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x0000E8, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x0000EC, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x0000F0, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000FC, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_4) == 0x000184, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000190, "Member 'Trap_Electric_Fence_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.ApplyBeamLocations
// 0x0088 (0x0088 - 0x0000)
struct Trap_Electric_Fence_BP_C_ApplyBeamLocations final
{
public:
	TArray<class FName>                           BeamSockets;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_ApplyBeamLocations) == 0x000008, "Wrong alignment on Trap_Electric_Fence_BP_C_ApplyBeamLocations");
static_assert(sizeof(Trap_Electric_Fence_BP_C_ApplyBeamLocations) == 0x000088, "Wrong size on Trap_Electric_Fence_BP_C_ApplyBeamLocations");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, BeamSockets) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::BeamSockets' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, Temp_bool_Variable) == 0x000010, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, K2Node_MakeArray_Array) == 0x000018, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, Temp_bool_Variable_1) == 0x00002C, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_Percent_IntInt_ReturnValue) == 0x000030, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_Array_Get_Item) == 0x000038, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_GetSocketLocation_ReturnValue) == 0x000048, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00005C, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, K2Node_Select_Default) == 0x000068, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, K2Node_Select_Default_1) == 0x000074, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_ApplyBeamLocations, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'Trap_Electric_Fence_BP_C_ApplyBeamLocations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Trap_Electric_Fence_BP.Trap_Electric_Fence_BP_C.TryDisarmTrapTrigger
// 0x0028 (0x0028 - 0x0000)
struct Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger final
{
public:
	class ABeamLauncher*                          K2Node_DynamicCast_AsBeam_Launcher;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABeamLauncher*                          K2Node_DynamicCast_AsBeam_Launcher_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger) == 0x000008, "Wrong alignment on Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger");
static_assert(sizeof(Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger) == 0x000028, "Wrong size on Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger");
static_assert(offsetof(Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger, K2Node_DynamicCast_AsBeam_Launcher) == 0x000000, "Member 'Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger::K2Node_DynamicCast_AsBeam_Launcher' has a wrong offset!");
static_assert(offsetof(Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Trap_Electric_Fence_BP_C_TryDisarmTrapTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
