#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TripBlade_AnimBP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TripBlade_AnimBP.TripBlade_AnimBP_C
// 0x0080 (0x0390 - 0x0310)
class UTripBlade_AnimBP_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0318(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0348(0x0048)()

public:
	void ExecuteUbergraph_TripBlade_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TripBlade_AnimBP_C">();
	}
	static class UTripBlade_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTripBlade_AnimBP_C>();
	}
};
static_assert(alignof(UTripBlade_AnimBP_C) == 0x000010, "Wrong alignment on UTripBlade_AnimBP_C");
static_assert(sizeof(UTripBlade_AnimBP_C) == 0x000390, "Wrong size on UTripBlade_AnimBP_C");
static_assert(offsetof(UTripBlade_AnimBP_C, UberGraphFrame) == 0x000310, "Member 'UTripBlade_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTripBlade_AnimBP_C, AnimGraphNode_Root) == 0x000318, "Member 'UTripBlade_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTripBlade_AnimBP_C, AnimGraphNode_Slot) == 0x000348, "Member 'UTripBlade_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

