#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TTDScanner_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function TTDScanner_BP.TTDScanner_BP_C.ExecuteUbergraph_TTDScanner_BP
// 0x0020 (0x0020 - 0x0000)
struct TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP) == 0x000008, "Wrong alignment on TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP");
static_assert(sizeof(TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP) == 0x000020, "Wrong size on TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP");
static_assert(offsetof(TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP, EntryPoint) == 0x000000, "Member 'TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'TTDScanner_BP_C_ExecuteUbergraph_TTDScanner_BP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

