#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnarmedRagdollCharacterDeath

#include "Basic.hpp"


namespace SDK::Params
{

// Function UnarmedRagdollCharacterDeath.UnarmedRagdollCharacterDeath_C.ExecuteUbergraph_UnarmedRagdollCharacterDeath
// 0x0010 (0x0010 - 0x0000)
struct UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterDeathComponent*               K2Node_Event_InDeathComponent;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath) == 0x000008, "Wrong alignment on UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath");
static_assert(sizeof(UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath) == 0x000010, "Wrong size on UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath");
static_assert(offsetof(UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath, EntryPoint) == 0x000000, "Member 'UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath::EntryPoint' has a wrong offset!");
static_assert(offsetof(UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath, K2Node_Event_InDeathComponent) == 0x000008, "Member 'UnarmedRagdollCharacterDeath_C_ExecuteUbergraph_UnarmedRagdollCharacterDeath::K2Node_Event_InDeathComponent' has a wrong offset!");

// Function UnarmedRagdollCharacterDeath.UnarmedRagdollCharacterDeath_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct UnarmedRagdollCharacterDeath_C_Execute final
{
public:
	class UCharacterDeathComponent*               InDeathComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnarmedRagdollCharacterDeath_C_Execute) == 0x000008, "Wrong alignment on UnarmedRagdollCharacterDeath_C_Execute");
static_assert(sizeof(UnarmedRagdollCharacterDeath_C_Execute) == 0x000008, "Wrong size on UnarmedRagdollCharacterDeath_C_Execute");
static_assert(offsetof(UnarmedRagdollCharacterDeath_C_Execute, InDeathComponent) == 0x000000, "Member 'UnarmedRagdollCharacterDeath_C_Execute::InDeathComponent' has a wrong offset!");

}

