#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VendorWidget_BP

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function VendorWidget_BP.VendorWidget_BP_C.ExecuteUbergraph_VendorWidget_BP
// 0x0028 (0x0028 - 0x0000)
struct VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVendorPages                                  K2Node_Event_Page;                                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAnimate;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP) == 0x000008, "Wrong alignment on VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP");
static_assert(sizeof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP) == 0x000028, "Wrong size on VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP");
static_assert(offsetof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP, EntryPoint) == 0x000000, "Member 'VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP, K2Node_Event_Page) == 0x000010, "Member 'VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP::K2Node_Event_Page' has a wrong offset!");
static_assert(offsetof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP, K2Node_Event_bAnimate) == 0x000011, "Member 'VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP::K2Node_Event_bAnimate' has a wrong offset!");
static_assert(offsetof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'VendorWidget_BP_C_ExecuteUbergraph_VendorWidget_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function VendorWidget_BP.VendorWidget_BP_C.OnSetCurrentPage
// 0x0002 (0x0002 - 0x0000)
struct VendorWidget_BP_C_OnSetCurrentPage final
{
public:
	EVendorPages                                  Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimate;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VendorWidget_BP_C_OnSetCurrentPage) == 0x000001, "Wrong alignment on VendorWidget_BP_C_OnSetCurrentPage");
static_assert(sizeof(VendorWidget_BP_C_OnSetCurrentPage) == 0x000002, "Wrong size on VendorWidget_BP_C_OnSetCurrentPage");
static_assert(offsetof(VendorWidget_BP_C_OnSetCurrentPage, Page) == 0x000000, "Member 'VendorWidget_BP_C_OnSetCurrentPage::Page' has a wrong offset!");
static_assert(offsetof(VendorWidget_BP_C_OnSetCurrentPage, bAnimate) == 0x000001, "Member 'VendorWidget_BP_C_OnSetCurrentPage::bAnimate' has a wrong offset!");

}

