#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBModificationPage_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBModificationPage_BP.WBModificationPage_BP_C
// 0x0018 (0x0440 - 0x0428)
class UWBModificationPage_BP_C final : public UWBModificationPageWidget
{
public:
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInputLabel_BP_C*                       ActionInputLabelMod;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PagesSizeBox;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBModificationPage_BP_C">();
	}
	static class UWBModificationPage_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBModificationPage_BP_C>();
	}
};
static_assert(alignof(UWBModificationPage_BP_C) == 0x000008, "Wrong alignment on UWBModificationPage_BP_C");
static_assert(sizeof(UWBModificationPage_BP_C) == 0x000440, "Wrong size on UWBModificationPage_BP_C");
static_assert(offsetof(UWBModificationPage_BP_C, NewAnimation_1) == 0x000428, "Member 'UWBModificationPage_BP_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UWBModificationPage_BP_C, ActionInputLabelMod) == 0x000430, "Member 'UWBModificationPage_BP_C::ActionInputLabelMod' has a wrong offset!");
static_assert(offsetof(UWBModificationPage_BP_C, PagesSizeBox) == 0x000438, "Member 'UWBModificationPage_BP_C::PagesSizeBox' has a wrong offset!");

}

