#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkbenchBase_BP

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WorkbenchBase_BP.WorkbenchBase_BP_C
// 0x0018 (0x02E0 - 0x02C8)
class AWorkbenchBase_BP_C : public AWorkbench
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WorkbenchBase_BP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorkbenchBase_BP_C">();
	}
	static class AWorkbenchBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWorkbenchBase_BP_C>();
	}
};
static_assert(alignof(AWorkbenchBase_BP_C) == 0x000008, "Wrong alignment on AWorkbenchBase_BP_C");
static_assert(sizeof(AWorkbenchBase_BP_C) == 0x0002E0, "Wrong size on AWorkbenchBase_BP_C");
static_assert(offsetof(AWorkbenchBase_BP_C, UberGraphFrame) == 0x0002C8, "Member 'AWorkbenchBase_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWorkbenchBase_BP_C, Scene) == 0x0002D0, "Member 'AWorkbenchBase_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(AWorkbenchBase_BP_C, StaticMesh) == 0x0002D8, "Member 'AWorkbenchBase_BP_C::StaticMesh' has a wrong offset!");

}

