#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XFH_CE_Chilled

#include "Basic.hpp"

#include "Indiana_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass XFH_CE_Chilled.XFH_CE_Chilled_C
// 0x0020 (0x01D8 - 0x01B8)
class UXFH_CE_Chilled_C final : public UMultiStatusEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           Color;                                             // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_XFH_CE_Chilled(int32 EntryPoint);
	void ReceiveApplyEffect(class AActor* Target, float Ratio_0, bool bRestoredFromSave);
	void ReceiveClearEffect(class AActor* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"XFH_CE_Chilled_C">();
	}
	static class UXFH_CE_Chilled_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXFH_CE_Chilled_C>();
	}
};
static_assert(alignof(UXFH_CE_Chilled_C) == 0x000008, "Wrong alignment on UXFH_CE_Chilled_C");
static_assert(sizeof(UXFH_CE_Chilled_C) == 0x0001D8, "Wrong size on UXFH_CE_Chilled_C");
static_assert(offsetof(UXFH_CE_Chilled_C, UberGraphFrame) == 0x0001B8, "Member 'UXFH_CE_Chilled_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UXFH_CE_Chilled_C, Color) == 0x0001C0, "Member 'UXFH_CE_Chilled_C::Color' has a wrong offset!");
static_assert(offsetof(UXFH_CE_Chilled_C, Ratio) == 0x0001D0, "Member 'UXFH_CE_Chilled_C::Ratio' has a wrong offset!");

}

