#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_EmeraldVale_P

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.SetShipLocation
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_SetShipLocation final
{
public:
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_SetShipLocation) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_SetShipLocation");
static_assert(sizeof(Zero001_EmeraldVale_P_C_SetShipLocation) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_SetShipLocation");
static_assert(offsetof(Zero001_EmeraldVale_P_C_SetShipLocation, CallFunc_GetIndianaPC_ReturnValue) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_SetShipLocation::CallFunc_GetIndianaPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_SetShipLocation, CallFunc_IsGlobalValue_Result) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_SetShipLocation::CallFunc_IsGlobalValue_Result' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_SetShipLocation, CallFunc_IsGlobalValue_ReturnValue) == 0x000009, "Member 'Zero001_EmeraldVale_P_C_SetShipLocation::CallFunc_IsGlobalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_SetShipLocation, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'Zero001_EmeraldVale_P_C_SetShipLocation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_east_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_geo_ext_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_silas_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_ship_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_zoe_camp_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_thomas_west_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_greenhouse_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_peak_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_river_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_landing_pad_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_EmeraldVale_P_C_BndEvt__TRIG_parvati_bark_robot_scout_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_EmeraldVale_P.0001_EmeraldVale_P_C.ExecuteUbergraph_0001_EmeraldVale_P
// 0x0180 (0x0180 - 0x0000)
struct Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_10;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_10;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_9;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_9;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_1;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_1;              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_2;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_2;              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_1;             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StartConversation_InstanceID_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_1;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_3;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_3;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_8;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_8;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_1;   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_2;             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_2;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_2;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_7;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_7;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_2;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_4;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_4;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_3;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_3;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_3;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_3;   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_6;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_6;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_4;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_4;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_4;           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_4;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_9;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_5;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_5;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_4;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_4;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_5;   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_5;             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_5;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_5;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_10;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_3;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_3;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_6;   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_6;             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_6;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_6;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_11;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_7;   // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_2;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_2;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_8;   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_7;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_7;           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_7;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_12;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_8;             // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_8;           // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_8;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_1;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_1;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_13;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompanionInActiveParty_ReturnValue_9;   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches_9;             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID_9;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue_9;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_14;                   // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_5;                   // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_5;              // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue;                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_15;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaAiCharacter*                    CallFunc_GetActiveCompanionWithSpecialID_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_6;                   // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_6;              // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_16;                   // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue_1;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor;                 // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P) == 0x000008, "Wrong alignment on Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P");
static_assert(sizeof(Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P) == 0x000180, "Wrong size on Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P");
static_assert(offsetof(Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P, EntryPoint) == 0x000000, "Member 'Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P, CallFunc_IsGlobalValue_Result) == 0x000004, "Member 'Zero001_EmeraldVale_P_C_ExecuteUbergraph_0001_EmeraldVale_P::CallFunc_IsGlobalValue_Result' has a wrong offset!");
