#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_ShipAI

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function 0001_ShipAI.0001_ShipAI_C.ExecuteUbergraph_0001_ShipAI
// 0x0050 (0x0050 - 0x0000)
struct Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterDescription                  CallFunc_MakeCharacterDescription_ReturnValue;     // 0x0008(0x0020)()
	class AActor*                                 K2Node_ComponentBoundEvent_ZoneOwner;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCharacterDescription>          K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBranches                                CallFunc_StartConversation_Branches;               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartConversation_InstanceID;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConversation_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI) == 0x000008, "Wrong alignment on Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI");
static_assert(sizeof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI) == 0x000050, "Wrong size on Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, EntryPoint) == 0x000000, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, CallFunc_MakeCharacterDescription_ReturnValue) == 0x000008, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::CallFunc_MakeCharacterDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, K2Node_ComponentBoundEvent_ZoneOwner) == 0x000028, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::K2Node_ComponentBoundEvent_ZoneOwner' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, K2Node_MakeArray_Array) == 0x000030, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, CallFunc_IsGlobalValue_Result) == 0x000040, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::CallFunc_IsGlobalValue_Result' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, CallFunc_IsGlobalValue_ReturnValue) == 0x000041, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::CallFunc_IsGlobalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, CallFunc_StartConversation_Branches) == 0x000042, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::CallFunc_StartConversation_Branches' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, CallFunc_StartConversation_InstanceID) == 0x000044, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::CallFunc_StartConversation_InstanceID' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, CallFunc_StartConversation_ReturnValue) == 0x000048, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::CallFunc_StartConversation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI, K2Node_SwitchEnum_CmpSuccess_1) == 0x00004A, "Member 'Zero001_ShipAI_C_ExecuteUbergraph_0001_ShipAI::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function 0001_ShipAI.0001_ShipAI_C.BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature final
{
public:
	class AActor*                                 ZoneOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature");
static_assert(sizeof(Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature) == 0x000008, "Wrong size on Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature");
static_assert(offsetof(Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature, ZoneOwner) == 0x000000, "Member 'Zero001_ShipAI_C_BndEvt__PersonalSpaceComponent_K2Node_ComponentBoundEvent_0_PlayerEnteredZone__DelegateSignature::ZoneOwner' has a wrong offset!");

}

