#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero3_ADA_Speaker_Blueprint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 03_ADA_Speaker_Blueprint.03_ADA_Speaker_Blueprint_C
// 0x0020 (0x02D8 - 0x02B8)
class AZero3_ADA_Speaker_Blueprint_C final : public AActor
{
public:
	class UCharacterInfoComponent*                CharacterInfo;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConversationFramingComponent*          ConversationFraming;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UConversationRegisterComponent*         ConversationRegister;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"03_ADA_Speaker_Blueprint_C">();
	}
	static class AZero3_ADA_Speaker_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZero3_ADA_Speaker_Blueprint_C>();
	}
};
static_assert(alignof(AZero3_ADA_Speaker_Blueprint_C) == 0x000008, "Wrong alignment on AZero3_ADA_Speaker_Blueprint_C");
static_assert(sizeof(AZero3_ADA_Speaker_Blueprint_C) == 0x0002D8, "Wrong size on AZero3_ADA_Speaker_Blueprint_C");
static_assert(offsetof(AZero3_ADA_Speaker_Blueprint_C, CharacterInfo) == 0x0002B8, "Member 'AZero3_ADA_Speaker_Blueprint_C::CharacterInfo' has a wrong offset!");
static_assert(offsetof(AZero3_ADA_Speaker_Blueprint_C, ConversationFraming) == 0x0002C0, "Member 'AZero3_ADA_Speaker_Blueprint_C::ConversationFraming' has a wrong offset!");
static_assert(offsetof(AZero3_ADA_Speaker_Blueprint_C, ConversationRegister) == 0x0002C8, "Member 'AZero3_ADA_Speaker_Blueprint_C::ConversationRegister' has a wrong offset!");
static_assert(offsetof(AZero3_ADA_Speaker_Blueprint_C, StaticMeshComponent0) == 0x0002D0, "Member 'AZero3_ADA_Speaker_Blueprint_C::StaticMeshComponent0' has a wrong offset!");

}

