#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zero001_SD

#include "Basic.hpp"

#include "Indiana_structs.hpp"


namespace SDK::Params
{

// Function 0001_SD.0001_SD_C.ExecuteUbergraph_0001_SD
// 0x0128 (0x0128 - 0x0000)
struct Zero001_SD_C_ExecuteUbergraph_0001_SD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent2D_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_2;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_3;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_4;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_5;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_6;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_7;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_8;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_9;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_7;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_7;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_6;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_6;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_5;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_5;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_4;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_4;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_1;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_10;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_11;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_3;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_3;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_2;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_2;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_2;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_3;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_1;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_4;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_2;                   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_5;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_12;       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_13;       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_14;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_15;       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoolResult                                   CallFunc_IsGlobalValue_Result_3;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGlobalValue_ReturnValue_6;              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_1;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_1;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndianaPlayerCharacter*                CallFunc_GetIndianaPC_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent2D_ReturnValue_1;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGender                                       CallFunc_GetGender_ReturnValue;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zero001_SD_C_ExecuteUbergraph_0001_SD) == 0x000008, "Wrong alignment on Zero001_SD_C_ExecuteUbergraph_0001_SD");
static_assert(sizeof(Zero001_SD_C_ExecuteUbergraph_0001_SD) == 0x000128, "Wrong size on Zero001_SD_C_ExecuteUbergraph_0001_SD");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, EntryPoint) == 0x000000, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEvent2D_ReturnValue) == 0x000004, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue) == 0x000018, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x00001C, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_2) == 0x000020, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_3) == 0x000024, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue) == 0x000028, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_4) == 0x00002C, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_5) == 0x000030, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_6) == 0x000034, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_7) == 0x000038, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_8) == 0x00003C, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_9) == 0x000040, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_7) == 0x000048, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_7' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_7) == 0x000050, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_7' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_6) == 0x000058, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_6' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_6) == 0x000060, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_6' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_5) == 0x000068, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_5' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_5) == 0x000070, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_5' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_4) == 0x000078, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_4' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_4) == 0x000080, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_4' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_Result) == 0x000088, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_Result' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue_1) == 0x000089, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_SwitchEnum_CmpSuccess) == 0x00008A, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_10) == 0x00008C, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_11) == 0x000090, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_3) == 0x000098, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_3' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_3) == 0x0000A0, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue_2) == 0x0000A8, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEvent_ReturnValue) == 0x0000AC, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_2) == 0x0000B0, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_2) == 0x0000B8, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue_3) == 0x0000C0, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEvent_ReturnValue_1) == 0x0000C4, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_Result_1) == 0x0000C8, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_Result_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue_4) == 0x0000C9, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000CA, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_Result_2) == 0x0000CB, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_Result_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue_5) == 0x0000CC, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000CD, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_12) == 0x0000D0, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_13) == 0x0000D4, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_14) == 0x0000D8, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEventAtLocation_ReturnValue_15) == 0x0000DC, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEventAtLocation_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_Result_3) == 0x0000E0, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_Result_3' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_IsGlobalValue_ReturnValue_6) == 0x0000E1, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_IsGlobalValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor_1) == 0x0000E8, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor_1) == 0x0000F0, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000F8, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OverlappedActor) == 0x000100, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_ActorBoundEvent_OtherActor) == 0x000108, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_ActorBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEvent_ReturnValue_2) == 0x000110, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_GetIndianaPC_ReturnValue) == 0x000118, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_GetIndianaPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_PostEvent2D_ReturnValue_1) == 0x000120, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_PostEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, CallFunc_GetGender_ReturnValue) == 0x000124, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::CallFunc_GetGender_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_ExecuteUbergraph_0001_SD, K2Node_SwitchEnum_CmpSuccess_4) == 0x000125, "Member 'Zero001_SD_C_ExecuteUbergraph_0001_SD::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_IntroCave_FallDamage_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle3_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle2_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_Jingle_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Music_Exited_Ship2_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box7_9_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box6_6_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function 0001_SD.0001_SD_C.BndEvt__Trigger_Saveable_PlayerOnly_Box_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on Zero001_SD_C_BndEvt__Trigger_Saveable_PlayerOnly_Box_2_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
